{"model":{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 8, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 16, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 3, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["conv2d_9", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"},"weights":[{"shape": [4, 4, 3, 8], "kernelweight": [[[[0.12489405274391174, -0.1451665163040161, -0.12649092078208923, -0.04247884079813957, 0.12903131544589996, 0.022536123171448708, -0.07582920044660568, 0.18820685148239136], [0.08502733707427979, -0.12102875858545303, 0.021588316187262535, 0.11455141752958298, -0.005546645727008581, -0.023162050172686577, -0.12495014816522598, -0.10182475298643112], [0.19117453694343567, -0.08407994359731674, -0.08592783659696579, 0.04897734150290489, -0.011768633499741554, -0.055882442742586136, 0.0034264391288161278, -0.2108975350856781]], [[0.07516002655029297, 0.07039312273263931, 0.05133439227938652, -0.11152995377779007, 0.16253700852394104, 0.12016141414642334, 0.07206476479768753, 0.16032961010932922], [0.16151446104049683, -0.001154884696006775, -0.033682700246572495, -0.10381752997636795, -0.18965694308280945, -0.026579691097140312, 0.0797899067401886, -0.08105587959289551], [0.04535898193717003, 0.12968729436397552, -0.11651106923818588, 0.18719545006752014, 0.15776997804641724, -0.053575631231069565, 0.1343592405319214, -0.11596851795911789]], [[-0.1329345852136612, -0.03129658102989197, -0.09267336875200272, -0.07391782850027084, -0.0044922782108187675, -0.05472654849290848, 0.1735619604587555, -0.14865821599960327], [0.11393854767084122, 0.22539637982845306, -0.05616214871406555, -0.0710606798529625, -0.206101655960083, -0.0894390270113945, -0.14445234835147858, 0.13037855923175812], [0.1879008561372757, -0.0471944697201252, 0.041106585413217545, 0.10147855430841446, 0.0294170044362545, -0.07227904349565506, 0.1716081202030182, -0.10542552918195724]], [[0.09620645642280579, 0.16192542016506195, 0.05763491615653038, 0.1724632978439331, 0.006162947043776512, 0.06305461376905441, 0.02233908139169216, -0.08498132973909378], [-0.15669912099838257, 0.024571318179368973, -0.0037789135240018368, -0.013023397885262966, 0.07792861759662628, 0.14556577801704407, -0.12685401737689972, 0.08182241022586823], [-0.10464756190776825, 0.039364587515592575, 0.1771431863307953, 0.08851829916238785, 0.1976810246706009, -0.19579258561134338, 0.17480862140655518, 0.13241514563560486]]], [[[0.0033165612258017063, 0.14045272767543793, -0.11840323358774185, -0.003801524406298995, 0.08832449465990067, -0.12617260217666626, 0.020920637995004654, -0.022142896428704262], [0.016736527904868126, 0.0003152029821649194, 0.1222357451915741, 0.09684261679649353, -0.19471988081932068, 0.15339981019496918, -0.09589576721191406, -0.10206848382949829], [0.10633007436990738, -0.025048187002539635, -0.014516543596982956, 0.0800757184624672, 0.13225536048412323, 0.06609643250703812, 0.12164561450481415, 0.08835209161043167]], [[-0.06045204773545265, 0.19819462299346924, -0.04696444794535637, -0.16292375326156616, 0.15599772334098816, -0.1060451865196228, -0.026857733726501465, -0.07354766130447388], [-0.04185209050774574, -0.06473763287067413, -0.028438575565814972, -0.06433913111686707, -0.09133878350257874, 0.04473908990621567, -0.09794118255376816, -0.016210755333304405], [0.08860725164413452, 0.1389182060956955, -0.1276347041130066, -0.008056416176259518, 0.08751038461923599, 0.08753564208745956, 0.12884289026260376, -0.12830761075019836]], [[-0.15682341158390045, -0.19461332261562347, -0.1351357251405716, 0.11433736979961395, 0.0978752076625824, 0.14379370212554932, -0.06614996492862701, 0.031424202024936676], [0.09886017441749573, -0.12060949206352234, -0.052806682884693146, -0.16067463159561157, -0.20745401084423065, 0.007476795464754105, -0.2086685448884964, 0.15774671733379364], [0.020610032603144646, -0.18667861819267273, -0.0013789298245683312, 0.10081495344638824, -0.08854959905147552, -0.11365564912557602, -0.018985815346240997, 0.040724776685237885]], [[0.18985825777053833, 0.1811889111995697, -0.10470756143331528, -0.10880742967128754, -0.019637545570731163, -0.04685623571276665, -0.1522248238325119, -0.12312361598014832], [0.004085156600922346, -0.030979963019490242, 0.016382142901420593, -0.005697095766663551, 0.017633402720093727, -0.04808015748858452, 0.07214589416980743, 0.16062085330486298], [-0.09015519917011261, -0.12955044209957123, 0.07101274281740189, 0.020558733493089676, 0.00099698337726295, 0.04295823723077774, 0.06989967077970505, -0.14709177613258362]]], [[[-0.14900606870651245, 0.2054973989725113, -0.05179242789745331, -0.1378217190504074, 0.08176590502262115, -0.1318953037261963, 0.021618913859128952, -0.1308269053697586], [0.09818048030138016, 0.15298260748386383, 0.08498992025852203, 0.10509894043207169, 0.014988373965024948, 0.12831361591815948, 0.020108401775360107, 0.06543304771184921], [0.05175858736038208, -0.010491165332496166, 0.07462610304355621, -0.00616193562746048, 0.07398264110088348, -0.04208986833691597, -0.1434222161769867, 0.1072641909122467]], [[-0.09726179391145706, -0.15151841938495636, 0.006387139670550823, 0.09047100692987442, -0.07865309715270996, 0.036935869604349136, 0.13689646124839783, 0.11485723406076431], [0.024188967421650887, -0.13066907227039337, 0.09350568801164627, 0.15468141436576843, -0.15786445140838623, 0.13158327341079712, 0.07989807426929474, -0.06317878514528275], [0.04297057166695595, 0.03683473914861679, 0.018410559743642807, 0.19980201125144958, 0.07916279137134552, 0.02015061303973198, 0.1738763302564621, 0.046224549412727356]], [[-0.08221881836652756, -0.24751052260398865, 0.07236669212579727, -0.10822387784719467, 0.09531216323375702, -0.10041994601488113, 0.1589301973581314, 0.022893548011779785], [-0.12102477997541428, -0.20883361995220184, 0.1890077292919159, -0.17949220538139343, 0.13941775262355804, -0.029898716136813164, -0.08933310955762863, -0.09161426872015], [-0.10471044480800629, 0.139176145195961, 0.016367454081773758, 0.21031303703784943, -0.09072466939687729, 0.004626469220966101, -0.10432547330856323, -0.1311827152967453]], [[-0.1407453566789627, -0.17082376778125763, 0.06421702355146408, 0.16382548213005066, -0.03244069591164589, 0.08533547818660736, -0.033331964164972305, -0.017536019906401634], [0.027665164321660995, 0.026428598910570145, -0.1298040747642517, -0.10211794078350067, -0.03560838848352432, 0.1272820234298706, 0.08600981533527374, -0.09162744879722595], [-0.06383289396762848, -0.16223573684692383, 0.05983617901802063, 0.12414471060037613, 0.15451470017433167, -0.03442465513944626, -0.10648978501558304, -0.08498518913984299]]], [[[0.16327638924121857, -0.07457098364830017, -0.048090241849422455, -0.15263928472995758, 0.13750168681144714, -0.03881757706403732, 0.11343435198068619, 0.009202592074871063], [-0.15163713693618774, 0.05788840353488922, 0.05034646391868591, 0.15266864001750946, 0.14301015436649323, -0.045163389295339584, -0.1741572469472885, 0.15227234363555908], [0.2110661119222641, 0.07850078493356705, -0.17020411789417267, -0.06951156258583069, -0.09149578213691711, 0.0847245529294014, 0.22016403079032898, -0.2167007476091385]], [[-0.019982585683465004, 0.030512062832713127, -0.06621245294809341, -0.05472877621650696, -0.07185166329145432, -0.09018190205097198, 0.06923631578683853, 0.10960367321968079], [0.09826017171144485, 0.10565944015979767, -0.17198646068572998, 0.06864633411169052, -0.1717940717935562, 0.09392695873975754, -0.15434633195400238, 0.014736520126461983], [0.05857328325510025, -0.1307792216539383, -0.04309621825814247, 0.08878554403781891, 0.004857455845922232, -0.11810419708490372, -0.0033505007158964872, 0.02447885274887085]], [[0.16440439224243164, -0.03125106543302536, 0.13392330706119537, -0.01851658523082733, -0.04700636863708496, -0.07878566533327103, 0.18932028114795685, 0.095753513276577], [0.12316649407148361, 0.14803169667720795, -0.16186557710170746, 0.17222976684570312, -0.05835187807679176, -0.024580106139183044, -0.06806404143571854, 0.16126875579357147], [-0.004582952708005905, 0.11433698982000351, 0.09571267664432526, 0.2064954936504364, -0.04719489440321922, -0.0614706315100193, -0.1242387518286705, -0.1411782056093216]], [[0.10569655895233154, 0.0944475308060646, -0.16242797672748566, -0.1447461098432541, -0.12046673148870468, 0.024954264983534813, 0.10034593939781189, -0.07902152091264725], [-0.09049432724714279, -0.09166011214256287, -0.14101587235927582, -0.17330098152160645, 0.03522144630551338, 0.009094827808439732, -0.028475448489189148, -0.1356339305639267], [0.13933907449245453, 0.06620284169912338, -0.02535974234342575, 0.06933608651161194, 0.18676060438156128, 0.048441335558891296, 0.1288212537765503, 0.016125518828630447]]]]}, {"shape": [8], "arrayweight": [-0.07100728154182434, -0.024921508505940437, -0.04472609981894493, -0.07263500988483429, 0.05872035026550293, 0.15666760504245758, 0.15516647696495056, 0.010053579695522785]}, {"shape": [4, 4, 8, 16], "kernelweight": [[[[-0.02421353943645954, 0.0009520389721728861, -0.07031027227640152, 0.0857572853565216, -0.048260997980833054, 0.041699979454278946, -0.05665331706404686, 0.06735146790742874, -0.06985457986593246, 0.09561439603567123, 0.07558362931013107, 0.03530070558190346, 0.12324361503124237, -0.09217452257871628, -0.09754321724176407, 0.13369117677211761], [0.12792262434959412, -0.10575507581233978, -0.14424364268779755, -0.007347949780523777, -0.2961259186267853, -0.05930835381150246, -0.108631432056427, 0.118841752409935, 0.03502659127116203, -0.0850805789232254, 0.0022715404629707336, -0.05058395862579346, -0.14594879746437073, 0.002671730937436223, 0.2120448648929596, -0.038897138088941574], [0.07392644137144089, -0.04187348484992981, 0.08134236931800842, -0.07227019965648651, 0.06161785125732422, 0.0851707011461258, -0.11900093406438828, 0.03273646906018257, 0.03355292230844498, -0.0377391017973423, 0.07070380449295044, -0.12888100743293762, -0.06499005109071732, 0.06469840556383133, 0.006416154559701681, 0.07334461808204651], [-0.0175203625112772, 0.03690037503838539, 0.04882734268903732, 0.08760223537683487, 0.047312118113040924, 0.04334763064980507, 0.07118859142065048, -0.11209502816200256, -0.001445178291760385, 0.04475809633731842, 0.026048140600323677, 0.18866361677646637, -0.010660475119948387, 0.08935386687517166, -0.11871720105409622, 0.048826079815626144], [0.03665289655327797, 0.09870371222496033, -0.08812346309423447, -0.026347877457737923, 0.04965812340378761, -0.12427861988544464, -0.04657236486673355, 0.0399407334625721, -0.08274120092391968, 0.06802333146333694, 0.06425617635250092, 0.06581030040979385, 0.07361447811126709, 0.049866702407598495, 0.01632656902074814, 0.032189905643463135], [-0.07347694784402847, -0.0035466370172798634, 0.07836704701185226, -0.08624405413866043, 0.024020778015255928, 0.07101528346538544, -0.10974226891994476, 0.1833764910697937, -0.14556917548179626, 0.0443117581307888, 0.03500351309776306, -0.10260653495788574, -0.004275367595255375, 0.033666905015707016, 0.032895222306251526, 0.004029370378702879], [-0.11794549971818924, -0.09009027481079102, 0.09078925848007202, -0.07203299552202225, 0.07597436755895615, -0.017090220004320145, -0.04708939045667648, -0.0052994629368186, -0.0990770012140274, 0.08479809761047363, 0.0946931540966034, 0.1271420568227768, 0.06973139941692352, 0.0025980505160987377, 0.16723473370075226, -0.04127633944153786], [0.060640234500169754, 0.10829786956310272, 0.06056736782193184, -0.05039167404174805, 0.052697066217660904, -0.02878408320248127, 0.09262021631002426, 0.08704713732004166, -0.03734726458787918, -0.05777565762400627, -0.024663927033543587, -0.19017234444618225, 0.06994926184415817, 0.11552992463111877, -0.06993873417377472, -0.12204238027334213]], [[0.00561314495280385, -0.015234234742820263, -0.0995962917804718, -0.05232425406575203, 0.09578637033700943, 0.014636621810495853, 0.17920264601707458, 0.003361731767654419, 0.06598220765590668, 0.09168742597103119, -0.10352955758571625, 0.06472940742969513, 0.04405594244599342, -0.157451331615448, -0.0066815586760640144, 0.01069583185017109], [0.14948956668376923, -0.1804601103067398, -0.1346467286348343, -0.026219915598630905, -0.3447258174419403, -0.1458287239074707, -0.012694128789007664, -0.09486499428749084, 0.06182548776268959, -0.15335576236248016, -0.10034925490617752, -0.019451692700386047, -0.11842572689056396, -0.04402223229408264, 0.27045172452926636, -0.1432674676179886], [0.1397790163755417, 0.032491035759449005, -0.03779062628746033, -0.14911848306655884, -0.041084155440330505, 0.0784134566783905, 0.042913708835840225, 0.09346427023410797, 0.018264664337038994, 0.0812104195356369, -0.036282364279031754, 0.026228435337543488, -0.010202676057815552, 0.05877634510397911, -0.04298385605216026, 0.07050628215074539], [0.06458508223295212, 0.10659030079841614, 0.05057547613978386, 0.0457034632563591, 0.051989179104566574, 0.020079614594578743, -0.07077079266309738, -0.09221751242876053, 0.18475055694580078, 0.15339632332324982, 0.033133767545223236, -0.07301653921604156, 0.09929896146059036, 0.05257970839738846, -0.11777011305093765, 0.08348110318183899], [0.03637867793440819, 0.07033796608448029, -0.0723562091588974, 0.10380682349205017, 0.036046694964170456, 0.08508709073066711, -0.038582950830459595, 0.012504355050623417, -0.022253617644309998, 0.10219301283359528, 0.06703953444957733, 0.023915238678455353, 0.143451988697052, -0.10000299662351608, 0.05878768861293793, -0.076991006731987], [0.020464159548282623, 0.11611220240592957, -0.09639395028352737, -0.10147789865732193, -0.07725002616643906, 0.014905858784914017, 0.007426138035953045, 0.1352517455816269, -0.059545133262872696, 0.1087861880660057, 0.051076024770736694, 0.08998750895261765, 0.0678841844201088, -0.04551659896969795, -0.08538983762264252, -0.06844011694192886], [0.013254842720925808, 0.0929165631532669, -0.060958556830883026, 0.15117034316062927, 0.02534823678433895, 0.06061722710728645, -0.002245925599709153, 0.10167302191257477, -0.0408356711268425, 0.19966624677181244, -0.08784522861242294, -0.07689288258552551, 0.1340724676847458, 0.03174062445759773, -0.02524816058576107, -0.031385887414216995], [-0.06474218517541885, 0.10880857706069946, 0.04000478237867355, -0.07029124349355698, -0.10823371261358261, 0.0253378227353096, 0.01071182917803526, -0.036622244864702225, -0.12785141170024872, 0.030527912080287933, 0.030349528416991234, -0.08750699460506439, -0.06075911223888397, -0.028981251642107964, 0.036635782569646835, -0.11613227427005768]], [[-0.021932236850261688, -0.03949359431862831, 0.053265657275915146, -0.0502922497689724, 0.08768164366483688, 0.07297766953706741, 0.0690046027302742, -0.01323014497756958, 0.07037502527236938, 0.017104536294937134, -0.04269962012767792, -0.003663142677396536, -0.06458614766597748, -0.04544734209775925, -0.04147719591856003, 0.07089342921972275], [0.19455261528491974, -0.10034661740064621, -0.00520148454234004, 0.03298579901456833, -0.1548289805650711, -0.14269068837165833, -0.19801947474479675, -0.12130311876535416, -0.04656512662768364, -0.1259554773569107, -0.17781858146190643, -0.07511694729328156, -0.1604660153388977, 0.04200683906674385, 0.19384722411632538, 0.13644753396511078], [0.08266658335924149, -0.07136678695678711, -0.06757321208715439, -0.04958371818065643, 0.07737758755683899, -0.04454393312335014, 0.03706534206867218, 0.05438077077269554, -0.09924353659152985, 0.07544512301683426, -0.14719420671463013, 0.06850498169660568, -0.13589845597743988, -0.015990158542990685, 0.006177236326038837, -0.03220701962709427], [0.032789260149002075, 0.11414708942174911, -0.03434216231107712, -0.162751704454422, 0.14275461435317993, -0.06932368129491806, -0.09230342507362366, -0.06876826286315918, 0.07905606180429459, -0.07215829193592072, 0.02880638651549816, -0.019508423283696175, 0.07001490890979767, -0.13158707320690155, -0.02054240182042122, 0.07426458597183228], [-0.07318273186683655, -0.08966479450464249, -0.07421337068080902, 0.08523208647966385, 0.07273013889789581, -0.028304360806941986, -0.005796817597001791, 0.005114656873047352, -0.015193216502666473, 0.22176457941532135, 0.08095424622297287, -0.08401014655828476, 0.034444648772478104, 0.017246762290596962, -0.030748486518859863, -0.001499065081588924], [-0.047129157930612564, 0.00831182673573494, -0.11569313704967499, -0.10987970232963562, -0.03662344068288803, 0.04224267229437828, -0.07338111102581024, 0.051650308072566986, -0.08151783794164658, -0.06858235597610474, -0.012474458664655685, -0.00453118234872818, 0.026102999225258827, 0.05996735021471977, 0.11916600167751312, -0.010588265024125576], [0.057216327637434006, -0.07125182449817657, -0.11668889224529266, -0.02418414130806923, 0.025239070877432823, 0.03695613145828247, -0.03121482953429222, 0.07938160002231598, -0.08045433461666107, 0.0455503836274147, -0.014678610488772392, -0.017317280173301697, 0.021736232563853264, -0.1114233061671257, -0.08849723637104034, -0.03930237516760826], [0.06965046375989914, 0.06856078654527664, -0.07216928154230118, -0.05691598355770111, -0.058415185660123825, 0.11917770653963089, 0.10693658888339996, -0.04406576231122017, 0.03821913152933121, 0.07998230308294296, -0.09971019625663757, -0.0013095415197312832, -0.10063441097736359, 0.0025750414934009314, -0.014712492004036903, -0.02836855687201023]], [[-0.031208401545882225, 0.011682355776429176, 0.03193346783518791, -0.12251414358615875, -0.043724969029426575, 0.044834867119789124, 0.05866187438368797, -0.043723709881305695, -0.10786504298448563, -0.0874447226524353, -0.03503423184156418, -0.11779368668794632, -0.0183645598590374, 0.07441143691539764, -0.030922820791602135, 0.0037688142620027065], [0.03574293479323387, -0.04495704174041748, -0.14680054783821106, 0.02419012039899826, -0.10300449281930923, -0.05596651881933212, -0.013504180125892162, -0.06869686394929886, -0.04006243124604225, -0.0934608206152916, -0.12962330877780914, -0.08248946070671082, -0.13532917201519012, 0.0057800570502877235, 0.11939983814954758, -0.00625012069940567], [0.06540491431951523, -0.04659496620297432, 0.0617552176117897, -0.11073071509599686, 0.013531106524169445, -0.07650972902774811, 0.04715443402528763, 0.008841186761856079, -0.05082431435585022, -0.08106526732444763, 0.03137464076280594, -0.07996527850627899, 0.05354456976056099, 0.020691951736807823, -0.04943147674202919, -0.10610536485910416], [0.01657414808869362, 0.13035154342651367, -0.01956106536090374, -0.029073629528284073, 0.007624581456184387, -0.07998698204755783, -0.1012507751584053, -0.06338527053594589, -0.06756504625082016, 0.09344258904457092, -0.053908415138721466, -0.09760049730539322, -0.10341114550828934, -0.0550803504884243, 0.11743387579917908, 0.06603804230690002], [-0.08791635930538177, -0.04344606772065163, -0.03348523750901222, -0.08411899209022522, 0.01793239451944828, 0.04641979932785034, 0.09977708756923676, 0.06400495767593384, -0.10831916332244873, 0.11038120090961456, -0.03534194082021713, 0.10473030805587769, 0.021465308964252472, 0.003452013013884425, -0.10481062531471252, 0.07052787393331528], [0.026042377576231956, -0.0219374131411314, 0.04524863883852959, -0.0015352822374552488, -0.1047731339931488, -0.03154752776026726, -0.0032791071571409702, 0.09857752174139023, -0.09020095318555832, -0.04479026421904564, -0.09881643950939178, 0.028484592214226723, 0.030409226194024086, 0.039107486605644226, -0.09943050146102905, 0.034114040434360504], [-0.011815405450761318, 0.07031410187482834, -0.0560372956097126, -0.12033926695585251, 0.05089814215898514, -0.06648174673318863, 0.037167925387620926, 0.13272488117218018, 0.023546237498521805, 0.14000128209590912, 0.1713801473379135, 0.11308865994215012, 0.07484696805477142, -0.07913830131292343, -0.07602175325155258, 0.09558798372745514], [-0.02727867290377617, -0.04536132141947746, 0.12236973643302917, 0.059684496372938156, 0.02953801304101944, -0.04258103296160698, -0.08782434463500977, 0.028148449957370758, -0.05732569843530655, -0.11398307979106903, 0.017017824575304985, 0.013577299192547798, -0.06147170066833496, 0.039663806557655334, -0.09463666379451752, -0.033886898308992386]]], [[[-0.11552627384662628, 0.08255840837955475, -0.07022205740213394, -0.11012115329504013, 0.0044142259284853935, -0.03690207377076149, -0.010202336125075817, -0.05242490395903587, -0.10138595849275589, -0.027896787971258163, 0.08249015361070633, 0.047763001173734665, 0.03037968836724758, -0.17676445841789246, 0.05316886678338051, 0.10892538726329803], [0.24311217665672302, -0.011940973810851574, -0.16336017847061157, 0.029175763949751854, -0.3886353671550751, -0.014158232137560844, -0.1407630294561386, 0.01619633473455906, -0.00037774565862491727, -0.058053091168403625, -0.10693537443876266, -0.019830379635095596, -0.13667933642864227, 0.1282312422990799, 0.1864980012178421, -0.057032614946365356], [0.07969529926776886, 0.14883416891098022, -0.06552262604236603, 0.1041368693113327, -0.07761695981025696, 0.025774141773581505, -0.13226060569286346, 0.12507833540439606, 0.04389186203479767, -0.011793500743806362, -0.14857055246829987, 0.07564102113246918, -0.060259152203798294, 0.1434195190668106, 0.061778996139764786, -0.0618792325258255], [-0.10451880097389221, -0.05777125805616379, -0.05735273286700249, 0.21999292075634003, 0.10035169869661331, -0.17776259779930115, 0.16284261643886566, -0.07117762416601181, 0.023273741826415062, -0.029355723410844803, -0.06476794928312302, 0.1764628291130066, 0.0398649126291275, 0.007884431630373001, 0.014998945407569408, -0.01796203851699829], [-0.05101390182971954, -0.06810638308525085, 0.07906319200992584, -0.019072052091360092, 0.08066543191671371, -0.004703369922935963, -0.07069618254899979, -0.014469152316451073, 0.04617295041680336, 0.23944002389907837, -0.010766762308776379, 0.13006585836410522, 0.1691882163286209, 0.07923343032598495, -0.056236717849969864, 0.14119687676429749], [0.03429344296455383, 0.054329898208379745, -0.045025672763586044, -0.049723297357559204, -0.07716167718172073, 0.06965814530849457, -0.023632027208805084, 0.16533413529396057, -0.06745050102472305, -0.036043062806129456, -0.027435488998889923, -0.11869078129529953, 0.09869661182165146, -0.11249784380197525, -0.043526776134967804, -0.05440353602170944], [-0.008428898639976978, -0.026255948469042778, 0.08570833504199982, 0.11078678071498871, -0.06654234230518341, 0.04799843952059746, -0.07828143984079361, 0.06170286238193512, -0.13397981226444244, 0.17203588783740997, 0.06868491321802139, 0.05328759923577309, 0.026234237477183342, -0.07498599588871002, 0.007719692308455706, -0.05169253796339035], [-0.018297705799341202, -0.03152729943394661, -0.02850341610610485, -0.12094634026288986, 0.10974303632974625, -0.041924044489860535, 0.09537574648857117, 0.052537500858306885, -0.0709245353937149, -0.038266416639089584, -0.125693678855896, -0.09290309250354767, -0.022564062848687172, 0.014179025776684284, 0.02481435239315033, -0.11768815666437149]], [[-0.03543303161859512, -0.10236184298992157, -0.115666963160038, 0.05646120384335518, 0.04823935404419899, -0.09901908040046692, 0.03434848412871361, 0.061028677970170975, 0.08753228187561035, -0.08469653874635696, -0.058251794427633286, 0.08462175726890564, 0.02102334424853325, 0.07790343463420868, 0.07896275818347931, -0.09320921450853348], [0.2037653923034668, -0.23810641467571259, -0.21362212300300598, -0.01211990974843502, -0.42161688208580017, -0.12286058813333511, -0.13809819519519806, -0.15580151975154877, -0.10857059061527252, -0.14273686707019806, -0.24747133255004883, -0.015891622751951218, -0.10312218219041824, 0.0383371002972126, 0.28333503007888794, -0.1162523701786995], [0.03472171723842621, 0.019737543538212776, 0.019890196621418, 0.04246269166469574, 0.047243740409612656, 0.006114030256867409, -0.05021124333143234, -0.05432876944541931, -0.09904547780752182, -0.05513863265514374, -0.007156284060329199, 0.12028965353965759, -0.11889524012804031, 0.04493369162082672, 0.020523851737380028, -0.03188563510775566], [-0.041215453296899796, -0.07743251323699951, 0.05544229969382286, -0.04200480505824089, 0.17870301008224487, -0.011327861808240414, -0.08762173354625702, -0.004430822562426329, 0.15171611309051514, 0.09149286895990372, -0.10963904112577438, -0.09459773451089859, -0.004902185872197151, 0.010564186610281467, -0.021500596776604652, 0.2052198201417923], [-0.037682272493839264, 0.13373152911663055, -0.08452694863080978, -0.009990116581320763, -0.046435706317424774, -0.02376212179660797, -0.06923739612102509, 0.023205198347568512, 0.018283044919371605, 0.24176406860351562, -0.08237205445766449, -0.004915591329336166, 0.1568426936864853, -0.028945328667759895, -0.13323864340782166, -0.03528154268860817], [0.07228288054466248, 0.08868226408958435, -0.1358884871006012, 0.0492807999253273, 0.08045849204063416, 0.01096298173069954, 0.0862235352396965, 0.11737372726202011, -0.018888918682932854, -0.08160649985074997, -0.1316034346818924, -0.036443933844566345, 0.08727588504552841, 0.011531316675245762, -0.05717470124363899, 0.00507901469245553], [0.09130984544754028, -0.05406128987669945, 0.040509290993213654, 0.10005427896976471, 0.10220471024513245, -0.12129957228899002, -0.08289787918329239, -0.03595654293894768, -0.007259069476276636, 0.24435359239578247, 0.0673852413892746, -0.04148472473025322, -0.06658051162958145, 0.05735711008310318, 0.11695596575737, -0.050503235310316086], [-0.015320206061005592, 0.11722197383642197, 0.008730999194085598, -0.007279522716999054, 0.0017455107299610972, 0.06397303938865662, 0.03278293088078499, -0.04901692643761635, -0.08799988031387329, -0.017506856471300125, -0.0304726492613554, 0.07113897055387497, 0.10111577063798904, 0.005284389480948448, 0.031289663165807724, 0.06331907957792282]], [[0.012663043104112148, 0.08365413546562195, -0.009549953043460846, -0.04900198057293892, -0.04225164279341698, -0.09502164274454117, 0.010540571063756943, 0.07745393365621567, -0.10513421148061752, 0.09317421168088913, -0.019373837858438492, -0.09691336750984192, -0.02021561563014984, -0.12981297075748444, 0.017868900671601295, 0.12120477855205536], [0.18728546798229218, -0.18227219581604004, -0.23957303166389465, -0.08972002565860748, -0.2059260755777359, -0.06210935115814209, -0.2756161689758301, -0.14808762073516846, -0.0837760642170906, -0.0039020900148898363, -0.155085027217865, -0.10555893927812576, -0.1374787986278534, 0.16517627239227295, 0.1554286628961563, 0.04063492640852928], [0.01574176922440529, -0.011214624159038067, -0.11913879960775375, -0.041920602321624756, 0.03820252791047096, -0.011333444155752659, -0.1024508848786354, -0.05947074294090271, -0.08418620377779007, 0.11321767419576645, -0.15938736498355865, -0.0322396494448185, -0.09807243943214417, 0.10044710338115692, -0.04454590007662773, 0.1178005039691925], [0.016181591898202896, 0.15694685280323029, 0.06425385177135468, -0.006363079883158207, -0.029192190617322922, -0.17159099876880646, -0.048531729727983475, 0.00993958581238985, 0.0997452363371849, -0.051567938178777695, -0.08426002413034439, -0.13812905550003052, -0.1056106835603714, 0.0438821017742157, -0.058529339730739594, 0.10485611110925674], [0.041117630898952484, 0.08224547654390335, -0.10706332325935364, 0.06381817907094955, 0.06684877723455429, -0.03009282425045967, 0.024626515805721283, -0.03485707938671112, 0.06040116026997566, 0.11665911227464676, -0.016859466210007668, 0.04644381254911423, -0.023911774158477783, -0.10641282796859741, -0.09312329441308975, 0.057286620140075684], [0.10891502350568771, -0.15206976234912872, -0.06647424399852753, -0.006962175946682692, -0.0733247771859169, -0.12572847306728363, -0.09625585377216339, 0.04554034769535065, 0.013932205736637115, -0.0869002640247345, -0.0166016798466444, 0.1027475893497467, -0.03113238513469696, -0.02734171599149704, 0.0944187343120575, -0.02495652809739113], [0.08051352947950363, 0.06992556154727936, 0.018169011920690536, -0.0012811721535399556, -0.005795606411993504, -0.14534230530261993, -0.09362319111824036, -0.06784078478813171, 0.0054089766927063465, 0.13028976321220398, -0.09135347604751587, -0.03188643977046013, 0.11691101640462875, -0.012487056665122509, 0.02472095377743244, -0.009239086881279945], [-0.028390871360898018, -0.038134146481752396, -0.08440764993429184, -0.03741908445954323, -0.02670115977525711, -0.0697949156165123, 0.11217983812093735, 0.02591303177177906, 0.05523655563592911, 0.0201105959713459, 0.010658877901732922, 0.090979665517807, 0.03832332789897919, -0.05499549210071564, 0.09933503717184067, -0.04268376901745796]], [[0.053512800484895706, 0.016353564336895943, -0.12032323330640793, 0.004553098697215319, -0.009621359407901764, -0.00940739456564188, 0.07611756026744843, -0.03296247124671936, -0.07615532726049423, 0.05946029722690582, -0.1041308045387268, 0.09463293105363846, -0.03781919553875923, 0.0592045933008194, 0.019148383289575577, 0.12837782502174377], [0.10567529499530792, -0.01645662821829319, -0.12132585793733597, -0.1000777930021286, -0.012794752605259418, 0.06062912195920944, -0.1797027587890625, -0.07705961912870407, -0.10423097759485245, -0.04299880191683769, -0.09022015333175659, -0.03516021743416786, -0.23558932542800903, 0.05483420193195343, 0.0987691730260849, -0.05764764919877052], [-0.12465423345565796, -0.0587686225771904, -0.0052008009515702724, -0.02912319079041481, 0.10152485966682434, 0.10764701664447784, -0.03308754414319992, 0.059612371027469635, 0.04933534190058708, 0.06251253932714462, -0.1020059660077095, 0.09178488701581955, -0.07795687764883041, 0.0006632202421315014, -0.11773201078176498, -0.04414808750152588], [0.07816280424594879, 0.13152353465557098, -0.029619472101330757, -0.022656932473182678, 0.05504631996154785, -0.17295625805854797, -0.0721408799290657, -0.0008495515212416649, -0.09227827191352844, 0.050906311720609665, -0.04684457927942276, -0.07880917191505432, -0.09707028418779373, -0.014244446530938148, 0.14913217723369598, 0.12828391790390015], [-0.005755671299993992, -0.02680780179798603, 0.07369569689035416, 0.049431584775447845, -0.06570860743522644, -0.1277652084827423, 0.038967736065387726, 0.04263368993997574, -0.09403949975967407, 0.05850391462445259, 0.09329753369092941, 0.034424472600221634, 0.03607733175158501, 0.011937137693166733, -0.06198647618293762, -0.0031185976695269346], [-0.040229957550764084, 0.016487959772348404, -0.015873881056904793, 0.0676003098487854, 0.10415099561214447, 0.007618335075676441, -0.018874917179346085, 0.13435089588165283, -0.08177358657121658, -0.03155922517180443, -0.1181638240814209, -0.06615420430898666, 0.0689084529876709, -0.014855753630399704, 0.03529052436351776, -0.15542171895503998], [-0.09149879962205887, -0.022042619064450264, -0.08454494923353195, 0.023624053224921227, -0.07104162126779556, -0.006858861073851585, -0.04711303487420082, 0.04804912954568863, -0.015493075363337994, 0.054975640028715134, 0.0010962886735796928, 0.07922546565532684, 0.018994223326444626, -0.12821924686431885, -0.03439369425177574, 0.05136023834347725], [-0.06398172676563263, 0.07065173238515854, -0.05120305344462395, 0.016996389254927635, -0.014314193278551102, 0.09965252876281738, -0.053909577429294586, -0.025161949917674065, -0.02882395125925541, 0.056606803089380264, -0.14024381339550018, 0.054745592176914215, 0.05258387327194214, -0.07303956151008606, -0.11764562875032425, -0.12438670545816422]]], [[[-0.13129903376102448, 0.11084280908107758, 0.05792786180973053, -0.011096298694610596, -0.08550964295864105, -0.024746868759393692, 0.031285084784030914, -0.014921351335942745, 0.06417929381132126, 0.035124484449625015, 0.07771260291337967, 0.005548316519707441, -0.050815656781196594, -0.10197590291500092, -0.14743223786354065, 0.1247701346874237], [0.26568102836608887, 0.024249792098999023, -0.06837498396635056, 0.10484711080789566, -0.23323726654052734, 0.030163602903485298, -0.17506471276283264, -0.08208406716585159, -0.06803890317678452, 0.03668426722288132, -0.17317025363445282, -0.03431174159049988, -0.14180611073970795, 0.14519557356834412, 0.04121152311563492, -0.1450587511062622], [0.05324173718690872, 0.07128734886646271, 0.02805042453110218, 0.02547755092382431, 0.04432356357574463, 0.0593469999730587, -0.10584480315446854, 0.021869448944926262, -0.1042371466755867, -0.07377642393112183, -0.10972894728183746, -0.0018147380324080586, -0.08632633835077286, -0.009192011319100857, 0.09004279226064682, 0.07452255487442017], [0.010301711037755013, 0.06459038704633713, 0.16598938405513763, -0.09534458070993423, -0.001158521743491292, 0.0333140604197979, -0.0386173389852047, 0.14188812673091888, 0.17136640846729279, -0.021734273061156273, 0.09960602968931198, 0.223537415266037, 0.06764509528875351, 0.08512434363365173, -0.0592946782708168, -0.057480089366436005], [-0.002095842035487294, 0.04282279312610626, -0.08166607469320297, -0.1273428201675415, 0.05888950824737549, 0.03734573721885681, -0.00014378389460034668, 0.048724640160799026, 0.056149013340473175, 0.12720678746700287, -0.045128826051950455, -0.04274480789899826, 0.09843121469020844, -0.0369105227291584, 0.10509540885686874, -0.013063546270132065], [-0.042370669543743134, 0.08768775314092636, -0.015175026841461658, 0.03680305927991867, 0.07872369140386581, 0.09626000374555588, -0.11056865006685257, 0.11525961011648178, 0.024234294891357422, -0.057378727942705154, -0.025141257792711258, -0.14870162308216095, 0.12594489753246307, 0.021442487835884094, 0.06817234307527542, -0.10833095759153366], [-0.040961239486932755, -0.08928506821393967, -0.12389280647039413, -0.14230692386627197, 0.006117683835327625, -0.040413521230220795, 0.016902146860957146, -0.014915992505848408, 0.04344377666711807, 0.0815340057015419, 0.05584194138646126, -0.029229052364826202, 0.12998820841312408, -0.10714294016361237, -0.008369089104235172, 0.015515973791480064], [-0.08199222385883331, 0.07604773342609406, -0.11597967892885208, 0.06681475788354874, -0.03866061940789223, 0.1336485743522644, 0.10034725815057755, -0.007261521182954311, -0.08346223086118698, 0.05555427446961403, 0.012415261939167976, -0.12285176664590836, -0.02528074011206627, -0.001466815359890461, 0.05243060737848282, -0.06346973031759262]], [[-0.015552861616015434, -0.0646141916513443, -0.0043790340423583984, 0.054760176688432693, 0.0002398634678684175, -0.0011299003381282091, 0.11529065668582916, 0.07220558077096939, 0.05032826215028763, -0.07152964919805527, 0.021937187761068344, -0.026435142382979393, 0.11859458684921265, 0.01415590662509203, -0.11164883524179459, -0.0011269274400547147], [0.23298004269599915, -0.019854489713907242, -0.2422790676355362, -0.012654769234359264, -0.4277556240558624, 0.027908315882086754, -0.17274561524391174, -0.15149028599262238, -0.144667387008667, -0.09177977591753006, -0.14363239705562592, 0.011008123867213726, -0.1047060489654541, 0.07181756943464279, 0.1311820149421692, -0.052383553236722946], [-0.044925589114427567, 0.012180223129689693, -0.006833234801888466, -0.12386313080787659, 0.03295775502920151, -0.005688088480383158, -0.055039677768945694, -0.015601997263729572, 0.03277386352419853, 0.10555321723222733, 0.03482143580913544, 0.08167725801467896, 0.038955386728048325, 0.10525031387805939, -0.013852991163730621, -0.09076571464538574], [0.028363864868879318, -0.059740617871284485, 0.25370141863822937, -0.07930256426334381, 0.016116386279463768, 0.011961797252297401, 0.09182155877351761, 0.0470450296998024, -0.023138929158449173, 0.016336144879460335, -0.034974243491888046, -0.09301145374774933, 0.07930158078670502, -0.06177370622754097, 0.01607956364750862, 0.12440799176692963], [0.09665480256080627, 0.12895360589027405, 0.06456287950277328, -0.02408921718597412, 0.14239414036273956, 0.08015555143356323, 0.06007930636405945, -0.05200576409697533, 0.0539417639374733, 0.17589503526687622, 0.11265760660171509, -0.06421869248151779, 0.15797382593154907, -0.011973417364060879, -0.0794297382235527, -0.09496551752090454], [0.020887305960059166, 0.04963098093867302, -0.05439631640911102, 0.06543514132499695, 0.03869470953941345, 0.07848935574293137, 0.014145848341286182, -0.07209880650043488, -0.09790078550577164, -0.014559624716639519, -0.013421131297945976, 0.07851021736860275, 0.08006807416677475, 0.07414458692073822, -0.07229240983724594, -0.007822321727871895], [0.07599516957998276, 0.05260692164301872, -0.020980995148420334, 0.14514586329460144, -0.005130212754011154, -0.04227563738822937, -0.026620738208293915, 0.1383453607559204, 0.08141974359750748, 0.15538056194782257, -0.08398260921239853, -0.022542301565408707, 0.12047218531370163, -0.0025647678412497044, 0.12121124565601349, -0.10285995900630951], [-0.05225573480129242, 0.019736822694540024, -0.15414288640022278, -0.05016922205686569, -0.006480189971625805, 0.09497743844985962, 0.11149027943611145, -0.11684947460889816, 0.055189501494169235, 0.10929291695356369, -0.14862783253192902, 0.05850397050380707, 0.11193308979272842, -0.048536840826272964, 0.011741031892597675, -0.14071539044380188]], [[-0.10037770867347717, 0.047266196459531784, -0.11196206510066986, -0.07526525855064392, 0.0483415424823761, -0.08154652267694473, 0.04639340564608574, 0.005995140410959721, 0.05417675897479057, 0.03496735543012619, 0.05841147527098656, -0.1093616932630539, -0.09154398739337921, -0.008318204432725906, -0.06645793467760086, -0.09836945682764053], [0.17552511394023895, 0.0127945551648736, -0.1824190318584442, 0.057302966713905334, -0.24409475922584534, -0.03492871671915054, -0.15321317315101624, -0.14015282690525055, -0.15626764297485352, -0.13393232226371765, -0.1158505231142044, -0.05579753965139389, -0.07233357429504395, 0.17338509857654572, 0.16710801422595978, -0.0021682088263332844], [0.04187146574258804, -0.0749916136264801, 0.05512717738747597, -0.1352372020483017, -0.07111755758523941, -0.01228597853332758, 0.04715779423713684, 0.08750421553850174, 0.11790469288825989, -0.03848453238606453, 0.015347111038863659, 0.13002465665340424, -0.08820553123950958, 0.008666573092341423, 0.05416760966181755, 0.045104533433914185], [-0.0670807957649231, 0.035868775099515915, 0.006285021081566811, -0.14499741792678833, 0.014237099327147007, -0.17805805802345276, -0.10302369296550751, -0.06403882801532745, -0.015322871506214142, -0.06216450408101082, -0.05135290324687958, -0.11462796479463577, 0.04076426848769188, -0.14765454828739166, -0.10552982240915298, 0.18187743425369263], [-0.05521634593605995, -0.09146503359079361, 0.05207211896777153, 0.03195306286215782, -0.04728057235479355, 0.00021979666780680418, 0.03961995989084244, -0.040436673909425735, 0.06522762775421143, 0.22576995193958282, 0.1282714158296585, 0.0422402024269104, 0.1245710626244545, 0.03780874237418175, 0.11550930142402649, -0.05915810912847519], [-0.08596502989530563, -0.0014018032234162092, -0.07201569527387619, 0.07835511118173599, -0.05493956059217453, 0.0238451287150383, 0.010731048882007599, 0.014001909643411636, -0.013986010104417801, -0.043391961604356766, -0.04994327947497368, -0.04143791273236275, 0.03152432292699814, -0.043705474585294724, 0.07960397005081177, -0.08728285133838654], [0.09609710425138474, -0.03166435658931732, 0.08827037364244461, 0.12068222463130951, -0.09434937685728073, -0.031272079795598984, -0.03254548832774162, -0.003124640556052327, -0.018565494567155838, 0.09468309581279755, 0.024627327919006348, 0.07942239940166473, -0.009989307262003422, -0.09623908251523972, -0.0557091124355793, -0.014370820485055447], [-0.044278696179389954, -0.09778420627117157, -0.023209644481539726, -0.03939773142337799, 0.05439237132668495, 0.08915688842535019, -0.04121231287717819, -0.056841474026441574, -0.0601348802447319, 0.08800618350505829, -0.1601739078760147, -0.09135405719280243, -0.04280240088701248, 0.061290595680475235, 0.004238917957991362, -0.030550889670848846]], [[-0.09023234248161316, -0.08196842670440674, -0.09039181470870972, -0.13605166971683502, -0.07144493609666824, 0.06943473219871521, 0.011915169656276703, -0.004074900411069393, -0.0423470064997673, -0.1175728291273117, 0.043513014912605286, 0.05834655463695526, -0.08189723640680313, 0.03705323860049248, 0.07995041459798813, -0.01897599548101425], [0.134231299161911, 0.06630644202232361, -0.08477586507797241, 0.012814716435968876, -0.08133505284786224, -0.06997323036193848, -0.16577963531017303, -0.1021299883723259, 0.0019546388648450375, -0.06631115078926086, -0.17909231781959534, 0.012819584459066391, -0.1481335163116455, 0.05494428426027298, 0.014263743534684181, -0.07465874403715134], [-0.05009353160858154, -0.09606987982988358, 0.026928551495075226, 0.08423599600791931, -0.014472021721303463, 0.03918684646487236, 0.056133925914764404, -0.07343101501464844, -0.030513668432831764, 0.011676899157464504, -0.06358468532562256, 0.08226136118173599, -0.01251863781362772, 0.019141685217618942, -0.013528279028832912, -0.09984270483255386], [-0.01026856992393732, -0.08198164403438568, -0.10441207140684128, -0.07433116436004639, -0.04187474027276039, 0.02083163894712925, -0.03249480202794075, -0.08078593760728836, 0.09474930912256241, 0.06782926619052887, 0.014832749031484127, 0.1093619242310524, 0.05683451145887375, 0.009319150820374489, 0.005838429089635611, 0.1247747465968132], [-0.03411129117012024, 0.043337851762771606, -0.0031623218674212694, -0.07262131571769714, 0.02685905620455742, 0.030168689787387848, -0.08879107236862183, -0.005556829739362001, -0.05899885669350624, 0.1404554694890976, -0.07142157852649689, 0.010500903241336346, 0.01637931354343891, 0.006705936044454575, 0.21908827126026154, 0.08044009655714035], [-0.0674704909324646, 0.03551527112722397, 0.12320984154939651, -0.00011571618961170316, 0.09880690276622772, -0.07289861142635345, -0.06193866208195686, 0.008257956244051456, 0.09144597500562668, 0.09194160252809525, -0.02169366180896759, -0.009907910600304604, -0.042142827063798904, -0.057925403118133545, 0.016390196979045868, -0.1541392058134079], [0.1321287304162979, -0.057929039001464844, -0.027790246531367302, 0.1066921204328537, 0.05070251226425171, -0.0037838665302842855, -0.07041765749454498, 0.02451365999877453, -0.036357078701257706, 0.006859197746962309, 0.06584490835666656, 0.031251419335603714, 0.11060070991516113, 0.10673452168703079, 0.07321630418300629, -0.0848006159067154], [-0.027217980474233627, 0.013231943361461163, -0.06434883922338486, 0.0441700741648674, -0.03152921423316002, -0.0074566020630300045, -0.019370002672076225, 0.13337165117263794, 0.009701471775770187, -0.025292109698057175, -0.01280483603477478, -0.09035032242536545, 0.0056703281588852406, -0.016911745071411133, 0.009806649759411812, -0.13478507101535797]]], [[[-0.11876311153173447, -0.06788419932126999, -0.06456021219491959, -0.06995022296905518, -0.08843915164470673, 0.056457385420799255, -0.04318545013666153, 0.05467592179775238, 0.02486610785126686, 0.1418178230524063, -0.03444856032729149, 0.0777251273393631, -0.009271274320781231, -0.23597438633441925, -0.08473395556211472, 0.12625671923160553], [0.19957971572875977, 0.0036936914548277855, 0.021765444427728653, 0.05491553992033005, -0.1345621943473816, -0.05996093153953552, 0.03893795236945152, -0.08434638381004333, -0.16910959780216217, 0.0455424003303051, 0.03457031771540642, -0.1120421513915062, -0.029044169932603836, 0.0033875969238579273, 0.050330109894275665, 0.013447025790810585], [0.03657045215368271, 0.04482218995690346, 0.05817988142371178, 0.06743565201759338, -0.08254388719797134, 0.049710024148225784, 0.000122578683658503, 0.03974764421582222, 0.09369364380836487, 0.10988999903202057, 0.04675199091434479, 0.001908321981318295, -0.01202329806983471, 0.03338758274912834, 0.010623391717672348, 0.027368301525712013], [-0.042220812290906906, 0.006501048803329468, -0.09659752249717712, 0.0961262658238411, 0.026914525777101517, -0.0695539265871048, 0.0726127102971077, -0.00816867034882307, 0.1588183045387268, 0.06246578320860863, -0.14946472644805908, 0.043144870549440384, 0.09126606583595276, -0.09519735723733902, -0.16333460807800293, 0.175005704164505], [0.0276375412940979, 0.10800879448652267, -0.10799288004636765, 0.023875152692198753, 0.019394759088754654, 0.08745059370994568, 0.028028646484017372, 0.13170306384563446, -0.11057489365339279, 0.11773912608623505, 0.004780316259711981, 0.09829661250114441, 0.03843967989087105, -0.018645012751221657, 0.07024045288562775, 0.11090459674596786], [0.06824319064617157, -0.099235400557518, 0.06948647648096085, -0.12731541693210602, 0.0927572250366211, 0.01642312854528427, 0.041692204773426056, 0.0941670835018158, -0.09896942228078842, -0.06766016036272049, 0.07751097530126572, -0.03746660798788071, 0.10605496913194656, -0.13252292573451996, 0.00784993264824152, -0.12206193804740906], [0.06431691348552704, 0.02008669264614582, 0.07755844295024872, -0.07689804583787918, 0.08282441645860672, -0.10291501879692078, -0.10457747429609299, 0.0076754046604037285, -0.08020669966936111, 0.11802414804697037, 0.07017574459314346, 0.1050620973110199, 0.11407776921987534, -0.06505087018013, 0.05526687949895859, 0.00939196813851595], [0.030183900147676468, 0.0037680543027818203, -0.08758994191884995, -0.05095037445425987, -0.00024183497589547187, 0.11172736436128616, -0.04005288705229759, 