{"model":{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 4], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 4, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["conv2d_12", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"},"weights":[{"shape": [3, 3, 4, 8], "kernelweight": [[[[-0.05558571219444275, 0.09481657296419144, -0.08917152881622314, 0.004939981736242771, -0.18814027309417725, -0.08254746347665787, -0.04923255369067192, -0.11241302639245987], [0.14962711930274963, -0.1084977313876152, -0.10404139757156372, -0.08844660222530365, 0.12390080094337463, -0.08859632909297943, -0.12790171802043915, 0.11451347172260284], [-0.14905041456222534, -0.0517064593732357, -0.06696425378322601, 0.16054165363311768, -0.22440822422504425, -0.06966543942689896, 0.1914227157831192, 0.06325966119766235], [-0.09696928411722183, 0.20882275700569153, 0.19762316346168518, -0.17794841527938843, -0.0010000959737226367, 0.1704547107219696, 0.19092780351638794, 0.2770690619945526]], [[0.12378109991550446, 0.118160679936409, -0.09823906421661377, 0.18877094984054565, 0.0029354149010032415, -0.04243117943406105, -0.19771035015583038, -0.1175069510936737], [-0.037986237555742264, -0.023463791236281395, 0.03598539158701897, 0.1274518519639969, -0.004620533902198076, 0.24331416189670563, -0.12885339558124542, 0.05943731591105461], [-0.20108458399772644, 0.21156488358974457, -0.08886987715959549, -0.11895182728767395, -0.268930047750473, -0.033037424087524414, -0.02802138961851597, -0.09519186615943909], [-0.20378552377223969, -0.017442386597394943, 0.21167007088661194, -0.23863519728183746, 0.1942533552646637, 0.11802900582551956, 0.16227298974990845, 0.1599753201007843]], [[-0.015345140360295773, -0.015770766884088516, -0.04928702116012573, -0.09444613754749298, -0.12530860304832458, -0.03596462309360504, 0.19795098900794983, 0.03610492870211601], [0.19661398231983185, -0.043085116893053055, -0.2228097915649414, -0.08172088116407394, 0.16982053220272064, 0.045925308018922806, 0.23302553594112396, -0.1297961324453354], [-0.2045750916004181, -0.11388758569955826, -0.03323296457529068, -0.044682130217552185, 0.057254791259765625, -0.11612246185541153, -0.14101992547512054, -0.08217967301607132], [0.07472117245197296, 0.244149312376976, 0.2314336746931076, -0.27328062057495117, 0.025036107748746872, -0.07432647794485092, -0.08428211510181427, 0.177268385887146]]], [[[-0.22608841955661774, -0.1935739666223526, -0.053041670471429825, -0.05388899892568588, -0.15505141019821167, 0.11455753445625305, 0.041965894401073456, -0.20083464682102203], [0.17338813841342926, 0.20203423500061035, 0.14963583648204803, -0.11206267029047012, 0.061611466109752655, 0.004920195322483778, 0.10785578936338425, 0.09422935545444489], [-0.034975890070199966, -0.12772320210933685, -0.14196576178073883, -0.14436762034893036, 0.023575492203235626, -0.46641215682029724, 0.21525466442108154, 0.18170307576656342], [0.10603134334087372, -0.05299730971455574, 0.015206354670226574, -0.251781165599823, 0.13961312174797058, -0.156790629029274, -0.10982826352119446, 0.21183030307292938]], [[-0.08976132422685623, 0.11850304901599884, -0.03502979502081871, -0.07696542888879776, 0.05859522521495819, 0.010261419229209423, -0.05435382202267647, 0.05945722013711929], [-0.13801050186157227, 0.10009398311376572, -0.20768508315086365, 0.10822025686502457, -0.137796550989151, 0.006547501776367426, -0.10713700950145721, 0.0064919209107756615], [-0.10272479057312012, -0.06485791504383087, -0.1860363781452179, 0.019575750455260277, -0.1671116203069687, 0.09007342904806137, -0.11761759221553802, 0.007759330794215202], [-0.22425663471221924, -0.005277655087411404, -0.07335411757230759, -0.09435967355966568, 0.23035386204719543, -0.11871015280485153, -0.10780925303697586, 0.0030408597085624933]], [[-0.11059015989303589, 0.03781284764409065, 0.08967521041631699, 0.24173009395599365, -0.1517617255449295, 0.05514928326010704, 0.1347825527191162, 0.018998894840478897], [-0.09431344270706177, -0.08518917113542557, -0.0878438800573349, 0.07660546153783798, 0.22033818066120148, -0.21246151626110077, 0.1274036169052124, 0.059527166187763214], [0.09868151694536209, -0.024688081815838814, -0.09813245385885239, -0.18314559757709503, -0.1161467507481575, -0.12081176042556763, -0.1503506302833557, 0.18982505798339844], [0.056524354964494705, -0.008115088567137718, 0.06585182249546051, -0.26992833614349365, -0.16132710874080658, 0.23286180198192596, -0.05406273528933525, 0.25488030910491943]]], [[[-0.08850311487913132, -0.10393083095550537, -0.09391209483146667, 0.00469336798414588, -0.11698731780052185, -0.09020845592021942, 0.12127307057380676, 0.1363174319267273], [0.07988021522760391, 0.08177071809768677, 0.16103744506835938, -0.06284596771001816, 0.061006564646959305, 0.006193677894771099, 0.03120981901884079, -0.11013947427272797], [-0.10271638631820679, -0.10548734664916992, 0.10943109542131424, -0.20596781373023987, -0.10072135180234909, -0.1499829739332199, 0.22530144453048706, -0.06184998154640198], [-0.15614815056324005, 0.22153465449810028, -0.14691491425037384, -0.011391849257051945, -0.10465777665376663, -0.1359146386384964, 0.18092040717601776, -0.07195789366960526]], [[0.11737202107906342, -0.10717511922121048, -0.084879569709301, 0.07995609939098358, -0.006959311198443174, 0.12659816443920135, -0.15536727011203766, -0.005703599192202091], [0.10806531459093094, 0.056008342653512955, 0.19413964450359344, -0.13132011890411377, -0.1703653335571289, -0.11069180816411972, 0.17961756885051727, -0.022576743736863136], [-0.11638976633548737, -0.07494460046291351, -0.14029543101787567, -0.007433829363435507, -0.04011968895792961, -0.18954619765281677, 0.13603733479976654, 0.13045820593833923], [0.003263007150962949, 0.04661104455590248, -0.09821408987045288, 0.08467172086238861, -0.16140586137771606, -0.10023298114538193, -0.0889861062169075, -0.10573132336139679]], [[-0.15927185118198395, 0.0790705531835556, -0.0798366591334343, 0.04210343211889267, 0.08180952072143555, 0.03668908774852753, -0.20999552309513092, -0.06481858342885971], [-0.02890785224735737, -0.15008316934108734, 0.05496405437588692, 0.1683913767337799, 0.09511787444353104, 0.11723893880844116, -0.26998770236968994, -0.09889571368694305], [-0.12224359810352325, 0.1070919930934906, 0.11520078033208847, -0.14163841307163239, -0.22810254991054535, -0.0580768808722496, -0.1829690784215927, 0.11926764994859695], [-0.28021836280822754, -0.001593462424352765, -0.012006845325231552, -0.13048481941223145, 0.2286929190158844, 0.18125160038471222, -0.09473796933889389, -0.17592854797840118]]]]}, {"shape": [8], "arrayweight": [-0.008686806075274944, 0.01136764045804739, 0.17848560214042664, 0.2118033766746521, -0.01867687702178955, 0.19275322556495667, 0.039810553193092346, -0.1088394820690155]}, {"shape": [8], "arrayweight": [0.9570761322975159, 1.0008727312088013, 0.9623461365699768, 1.1260857582092285, 1.0258182287216187, 0.9412819147109985, 0.8809633255004883, 1.1031851768493652]}, {"shape": [8], "arrayweight": [0.01438008714467287, 0.020135510712862015, -0.04548465088009834, 0.0718918889760971, 0.07116270065307617, 0.12883000075817108, 0.026238057762384415, -0.04911784455180168]}, {"shape": [8], "arrayweight": [0.7872433662414551, 0.10511013120412827, 0.3786931037902832, 1.0457652807235718, 0.5056424140930176, 0.696934700012207, 0.03800507262349129, -0.07102804630994797]}, {"shape": [8], "arrayweight": [0.2512868046760559, 0.08194489777088165, 0.11608706414699554, 0.4906858205795288, 0.19230884313583374, 0.12602511048316956, 0.015200301073491573, 0.033408645540475845]}, {"shape": [4, 4, 8, 8], "kernelweight": [[[[0.045437444001436234, -0.0005676561850123107, -0.05414589121937752, -0.010175252333283424, -0.08290225267410278, 0.01933491975069046, -0.02312946319580078, 0.13077107071876526], [0.1161225289106369, 0.025863248854875565, 0.16726897656917572, 0.08148930966854095, 0.013112272135913372, -0.06085919961333275, 0.08760067820549011, 0.027579737827181816], [0.002371551003307104, -0.02895975485444069, 0.05460885912179947, -0.00976947695016861, 0.07866331934928894, 0.06328772753477097, -0.10851793736219406, -0.039538342505693436], [-0.03301373869180679, -0.1906183362007141, 0.08295520395040512, 0.03288428485393524, -0.17051227390766144, -0.038327138870954514, 0.06630430370569229, 0.18252377212047577], [0.14573617279529572, -0.050147708505392075, 0.08495441824197769, 0.13293994963169098, 0.13020221889019012, -0.059779390692710876, 0.1546737402677536, 0.14534622430801392], [-0.04112919792532921, -0.03367334604263306, 0.10708892345428467, 0.06216258183121681, -0.11688673496246338, 0.00807571318000555, 0.059279441833496094, -0.1087709292769432], [0.041285980492830276, -0.18711461126804352, 0.11392711102962494, 0.08113989979028702, -0.06785935163497925, 0.013016585260629654, 0.11962608247995377, -0.030835825949907303], [0.05898762121796608, 0.1602124124765396, -0.028693431988358498, 0.11984511464834213, 0.1398879736661911, 0.01814351975917816, 0.05867793411016464, -0.05422702431678772]], [[-0.02069070190191269, 0.008007918484508991, -0.035273052752017975, 0.04902580380439758, -0.0744764655828476, 0.16420824825763702, -0.04989991337060928, -0.01341698132455349], [0.19236721098423004, -0.07198762893676758, -0.1322779655456543, -0.037648722529411316, 0.11240555346012115, -0.09297388792037964, 0.07247700542211533, -0.03003796748816967], [-0.17405609786510468, -0.0312797874212265, 0.07285954058170319, 0.08775419741868973, 0.0035960464738309383, 0.040914714336395264, -0.09270238876342773, -0.017337515950202942], [0.013636873103678226, -0.14766424894332886, 0.14979316294193268, -0.04907093942165375, -0.1839165836572647, 0.00784836895763874, -0.12632854282855988, 0.05587604641914368], [0.0378020741045475, 0.03814708814024925, 0.11315122991800308, 0.007552835159003735, 0.1275133639574051, 0.041850749403238297, 0.05831295624375343, 0.12413008511066437], [0.12887553870677948, -0.15688909590244293, 0.09592044353485107, -0.11402588337659836, -0.06554317474365234, 0.08053667843341827, 0.0577348954975605, -0.052902113646268845], [0.03765768185257912, -0.14978256821632385, 0.0667419582605362, -0.057666681706905365, -0.06043340638279915, 0.11085174232721329, 0.02654644101858139, -0.07513035088777542], [0.07452438771724701, 0.15357983112335205, -0.10234378278255463, 0.06491148471832275, 0.1286141574382782, 0.05858352780342102, -0.02021913230419159, -0.17425648868083954]], [[-0.026757599785923958, -0.13691604137420654, 0.041324716061353683, 0.03359479084610939, -0.11982492357492447, 0.1367494761943817, 0.06268216669559479, 0.10107287764549255], [0.07892978191375732, 0.03555895388126373, 0.0387582890689373, 0.04256938025355339, -0.057633113116025925, -0.07545510679483414, -0.07542739063501358, -0.05471256375312805], [-0.01469349954277277, 0.02243899740278721, 0.034459929913282394, 0.12983055412769318, 0.18384239077568054, -0.054247621446847916, 0.10529790818691254, -0.16340669989585876], [-0.16501177847385406, 0.05589566007256508, -0.004838618449866772, -0.11898665130138397, -0.16249194741249084, 0.12289797514677048, -0.04702175781130791, -0.08301179856061935], [0.03843449056148529, 0.0007692702347412705, -0.05264220014214516, 0.10845234245061874, 0.121566541492939, -0.15633077919483185, 0.06412914395332336, 0.03520002216100693], [-0.07650921493768692, 0.011892570182681084, -0.09500697255134583, -0.0892813578248024, 0.07342944294214249, 0.03369404003024101, 0.03699016198515892, -0.14584292471408844], [0.02981182374060154, -0.03923827409744263, -0.011692079715430737, 0.07953426241874695, -0.07839038968086243, 0.019510148093104362, 0.01153077743947506, -0.0019468235550448298], [0.11461063474416733, -0.012729666195809841, -0.09432780742645264, 0.09445714950561523, 0.0652715340256691, -0.09463673830032349, 0.003784953383728862, -0.04136398062109947]], [[-0.04982544854283333, -0.006240001413971186, 0.07151924818754196, -0.05608934164047241, -0.07852066308259964, 0.024406345561146736, -0.18500910699367523, 0.098555788397789], [0.13476668298244476, 0.03098566085100174, -0.04508058726787567, 0.01008612010627985, -0.049036286771297455, -0.009122787043452263, 0.11565887928009033, 0.02301548421382904], [0.0071241422556340694, 0.12837474048137665, -0.013311052694916725, -0.09427230060100555, -0.0746476948261261, -0.05520021915435791, -0.0027104353066533804, -0.03156234696507454], [0.02087664231657982, -0.1720520257949829, 0.040290139615535736, 0.0018016303656622767, -0.12980318069458008, -0.1161554604768753, 0.045178916305303574, 0.10720951855182648], [0.06324879825115204, 0.10744348168373108, -0.10425125807523727, 0.051181674003601074, 0.03002549521625042, -0.16029217839241028, -0.06983933597803116, -0.07211165875196457], [0.0074457949958741665, 0.08343341946601868, 0.010232308879494667, 0.02055426873266697, 0.015516065061092377, 0.09784132987260818, -0.12972238659858704, 0.01188626792281866], [0.06527896970510483, 0.013776678591966629, 0.00775160500779748, 0.07477118819952011, -0.020046761259436607, 0.06168662756681442, 0.1285218894481659, -0.020002828910946846], [-0.03519579768180847, 0.07002182304859161, 0.07218107581138611, 0.18253099918365479, 0.034117668867111206, 0.13768240809440613, 0.11409015953540802, 0.08028773963451385]]], [[[-0.029431015253067017, -0.10913867503404617, 0.11412063986063004, -0.15734423696994781, -0.15767186880111694, -0.08841191977262497, -0.006074319593608379, 0.12553873658180237], [-0.0486232228577137, 0.05268515273928642, 0.12242791056632996, 0.1211862862110138, -0.028774943202733994, -0.08510775864124298, 0.06446167081594467, -0.06529204547405243], [0.03375699743628502, -0.011895235627889633, -0.10540160536766052, -0.02277003414928913, 0.022356463596224785, -0.10174713283777237, 0.06456341594457626, 0.03539479896426201], [-0.16152217984199524, 0.057480037212371826, -0.04582050070166588, -0.015057249926030636, -0.185118168592453, 0.20937058329582214, -0.0377669483423233, -0.0005014421767555177], [0.13746847212314606, 0.1266935020685196, -0.08837158977985382, 0.04841483384370804, 0.10474304854869843, -0.10083838552236557, -0.04175715520977974, 0.11481425166130066], [0.01495949737727642, -0.1106332391500473, 0.025382189080119133, 0.13326600193977356, -0.011629256419837475, 0.21315525472164154, 0.11699685454368591, -0.11162716150283813], [0.02289772406220436, -0.1273447573184967, 0.12026611715555191, 0.07942131161689758, 0.01765238307416439, 0.13455750048160553, 0.028056051582098007, 0.01971522346138954], [0.12544484436511993, 0.07557233422994614, 0.003859349060803652, -0.05926469713449478, 0.12302721291780472, -0.06061010807752609, 0.10134829580783844, 0.02696671336889267]], [[-0.09677457809448242, 0.0707465335726738, 0.19049464166164398, -0.12000562995672226, -0.07763072103261948, 0.0993855744600296, -0.058034151792526245, -0.1274879425764084], [0.14487938582897186, 0.08219361305236816, 0.03443174064159393, 0.1300855129957199, 0.12561355531215668, -0.010333476588129997, 0.07790299504995346, -0.013246971182525158], [0.028734778985381126, 0.0953000858426094, 0.05331556499004364, -0.05962667614221573, 0.07892195880413055, -0.07418996840715408, -0.07674679905176163, -0.04353572800755501], [-0.18688641488552094, -0.18408331274986267, 0.21685688197612762, 0.030459675937891006, -0.042428262531757355, -0.03122072108089924, -0.13734029233455658, 0.17413368821144104], [0.01722855493426323, -0.09488266706466675, 0.07981262356042862, 0.029071221128106117, -0.07067777216434479, -0.062443848699331284, 0.13952885568141937, 0.12704254686832428], [0.11420764774084091, -0.1670965999364853, -0.07156126201152802, -0.12027234584093094, -0.0014370133867487311, 0.12389413267374039, -0.11016258597373962, -0.07760656625032425], [-0.00770590640604496, -0.0918872207403183, 0.011119483038783073, 0.018850481137633324, 0.024074213579297066, 0.06758614629507065, -0.09214840084314346, 0.023864876478910446], [0.023426277562975883, 0.11468321830034256, 0.07482786476612091, 0.0933532789349556, 0.06544378399848938, 0.09135691076517105, 0.02197514846920967, -0.04014892131090164]], [[0.007420940324664116, 0.11820682883262634, 0.08914664387702942, -0.1978437602519989, -0.11675827205181122, -0.03316251188516617, -0.14326654374599457, 0.08951865136623383], [-0.012702709063887596, 0.028524236753582954, -0.146455779671669, 0.07439325749874115, 0.12962938845157623, 0.02950935624539852, 0.14347122609615326, -0.0734667032957077], [0.09250961244106293, -0.0006458379211835563, -0.0735713392496109, 0.14799904823303223, 0.0736527070403099, 0.05946669727563858, -0.07545749098062515, -0.0461389422416687], [-0.10206308960914612, 0.06593223661184311, 0.057352207601070404, -0.09873159229755402, -0.03716183453798294, 0.11178384721279144, -0.05463707819581032, 0.12884904444217682], [0.04190133512020111, 0.08929933607578278, -0.07176496833562851, 0.04196889325976372, -0.12237638235092163, -0.030746929347515106, 0.10036767274141312, 0.11795714497566223], [0.017478279769420624, -0.08521849662065506, 0.12196433544158936, 0.04736395925283432, 0.012815818190574646, -0.07406315207481384, 0.09253226965665817, 0.08844716101884842], [0.05801830440759659, -0.033484283834695816, 0.0817122831940651, -0.008714535273611546, 0.026698995381593704, 0.09271486103534698, 0.20327217876911163, -0.07646609842777252], [0.01905892789363861, 0.1706634759902954, -0.0014895937638357282, 0.07161009311676025, 0.09625185281038284, -0.06223639100790024, 0.15098467469215393, -0.12303546071052551]], [[-0.007626148872077465, -0.08701926469802856, -0.059811513870954514, -0.011920064687728882, 0.0037840583827346563, 0.0892220064997673, 0.08590885251760483, -0.12886852025985718], [-0.06747972220182419, 0.11803538352251053, -0.14287908375263214, 0.08569049090147018, 0.03626750037074089, -0.05778690055012703, 0.042032476514577866, 0.04642222076654434], [0.020947778597474098, 0.09517534077167511, -0.11733175069093704, 0.1440695971250534, -0.0701507106423378, -0.05266304686665535, -0.135902538895607, -0.0346682146191597], [0.020970802754163742, 0.1218564435839653, 0.09624962508678436, 0.04213530570268631, -0.0801878347992897, -0.06603725999593735, -0.13538123667240143, 0.10703925043344498], [0.025264635682106018, 0.15417133271694183, 0.03397953137755394, 0.01359142642468214, 0.04929032549262047, -0.06409139931201935, 0.09049704670906067, 0.11464013904333115], [0.01140496227890253, -0.06525029242038727, 0.10982320457696915, 0.03373192623257637, 0.0006471481756307185, 0.0940980538725853, 0.07951583713293076, -0.004555992316454649], [-0.006637853104621172, -0.09391879290342331, 0.008145700208842754, -0.06302639096975327, -0.026432566344738007, -0.0265238955616951, 0.008594467304646969, -0.045734670013189316], [0.06903614848852158, 0.03201473131775856, -0.09965831786394119, -0.01936931535601616, 0.0680897906422615, -0.09242048859596252, 0.002506214426830411, -0.1419292539358139]]], [[[-0.11307808756828308, -0.07092209905385971, -0.08374135941267014, -0.04138151556253433, -0.024453699588775635, 0.16157682240009308, -0.0976366400718689, -0.041834279894828796], [0.03142566606402397, 0.1129872277379036, 0.06870196014642715, 0.07772471755743027, 0.010016612708568573, -0.0520593486726284, 0.15117348730564117, -0.11847051978111267], [0.08647967129945755, 0.21630966663360596, 0.049021489918231964, 0.07867731899023056, -0.0456865094602108, -0.034274499863386154, 0.037276800721883774, 0.08847079426050186], [-0.015240507200360298, -0.17504224181175232, 0.20189855992794037, -0.008470110595226288, -0.17294159531593323, -0.020107664167881012, 0.008906112052500248, -0.021197788417339325], [0.11095022410154343, 0.0681031346321106, -0.022670915350317955, 0.07362633943557739, 0.13290561735630035, 0.012852797284722328, -0.07285179197788239, -0.03604154661297798], [0.13971619307994843, -0.15963943302631378, 0.04057260975241661, -0.0933372899889946, 0.060869473963975906, 0.051312316209077835, 0.14336082339286804, 0.009785324335098267], [0.044851772487163544, -0.0956542044878006, 0.1318703591823578, -0.05435097962617874, -0.008862766437232494, 0.0469343438744545, 0.043490733951330185, 0.00836609024554491], [0.1253533959388733, 0.13998524844646454, -0.07178478688001633, 0.03793339058756828, -0.06737449765205383, -0.009775152429938316, 0.06634829938411713, 0.03913193941116333]], [[-0.03899692744016647, -0.045599132776260376, 0.07174515724182129, -0.12040568888187408, 0.017972759902477264, 0.09639356285333633, -0.14105162024497986, 0.1103699654340744], [0.04338478296995163, 0.0045242952182888985, -0.1326274275779724, -0.07604445517063141, -0.035945259034633636, -0.030628656968474388, 0.08706559985876083, 0.06538403034210205], [-0.07563961297273636, 0.09207950532436371, -0.08044393360614777, -0.07619622349739075, 0.056965555995702744, -0.06451726704835892, -0.13666021823883057, -0.12209951132535934], [-0.1419190615415573, -0.006138237193226814, 0.18484877049922943, -0.05573034659028053, -0.05360938608646393, 0.002969845198094845, -0.023254625499248505, 0.14528608322143555], [0.0015661028446629643, 0.10621890425682068, -0.1509731560945511, -0.004743142053484917, 0.06325474381446838, 0.03088165447115898, 0.2164173275232315, 2.909380418714136e-05], [0.05403831973671913, -0.0424051471054554, -0.03419271484017372, -0.09727708250284195, -0.06746181100606918, -0.005757973995059729, -0.0025117630138993263, -0.096568763256073], [-0.027082344517111778, -0.10078702121973038, 0.03173476457595825, -0.016044793650507927, -0.09730173647403717, 0.024814710021018982, 0.0768209770321846, -0.03995966166257858], [0.056150272488594055, 0.15450607240200043, -0.13800634443759918, 0.06414926797151566, 0.07709337025880814, -0.106082983314991, 0.10422489047050476, -0.13007812201976776]], [[-0.05306502804160118, -0.011030475609004498, 0.0063249110244214535, -0.016508204862475395, -0.06431014835834503, 0.034373313188552856, 0.05483965203166008, -0.07742346078157425], [0.1435709297657013, 0.12745603919029236, 0.03857727721333504, 0.18025603890419006, 0.01049111969769001, 0.0151978125795722, 0.17468689382076263, -0.08752720803022385], [0.07922977209091187, -0.04979115352034569, 0.02453429065644741, -0.07860207557678223, -0.008542569354176521, -0.10128159821033478, -0.025387337431311607, -0.08961822092533112], [-0.033617787063121796, -0.14110013842582703, 0.1779933124780655, 0.05880620330572128, -0.012664135545492172, 0.07474075257778168, 0.06907058507204056, 0.08024979382753372], [0.07288231700658798, -0.08312136679887772, 0.03285348415374756, 0.030877020210027695, -0.1203722432255745, -0.19227945804595947, 0.02911558747291565, 0.0877658873796463], [0.08781976997852325, -0.043807514011859894, 0.050915177911520004, -0.031397148966789246, 0.058701589703559875, -0.00940979365259409, 0.09902626276016235, 0.10398166626691818], [0.05839184671640396, -0.1237562820315361, 0.07545752078294754, 0.07099930197000504, 0.07320528477430344, 0.09498416632413864, 0.03149587661027908, 0.010968928225338459], [0.0071567450650036335, 0.10685490816831589, -0.2021317481994629, -0.03726448491215706, 0.015059548430144787, -0.12595629692077637, 0.09803175926208496, -0.011936931870877743]], [[0.044016413390636444, 0.10389397293329239, 0.12599828839302063, 0.01788919046521187, 0.028043588623404503, 0.05605059489607811, -0.12170425802469254, 0.1364709436893463], [0.05173610895872116, -0.02324352040886879, 0.06622404605150223, -0.0505581796169281, -0.017083657905459404, -0.08536859601736069, -0.05211659148335457, -0.10134068131446838], [-0.025368547067046165, -0.04174906015396118, -0.09762322157621384, 0.06728047132492065, 0.01609625667333603, -0.15474221110343933, 0.11660613119602203, -0.07978076487779617], [-0.1574900597333908, -0.0884380042552948, 0.03979627415537834, -0.04064592719078064, -0.11660512536764145, -0.07260879129171371, -0.0895037055015564, -0.05893739312887192], [-0.020473597571253777, 0.12446262687444687, -0.17923761904239655, 0.04590291902422905, 0.09316205233335495, 0.039484258741140366, 0.107082299888134, 0.008988765999674797], [0.04804818704724312, 0.05420360341668129, 0.11641717702150345, -0.016412757337093353, 0.06875056028366089, 0.1466062217950821, 0.037934184074401855, -0.035729631781578064], [-0.057640690356492996, -0.03693288192152977, 0.005036353133618832, 0.04828871786594391, -0.09212451428174973, -0.004726223647594452, 0.06143850088119507, -0.11310214549303055], [0.12290222197771072, -0.11271810531616211, -0.02579236403107643, 0.011691094376146793, -0.14643359184265137, -0.0029378856997936964, 0.060791030526161194, 0.0017010271549224854]]], [[[-0.08766098320484161, -0.1834225058555603, 0.06729326397180557, -0.061752889305353165, -0.16999627649784088, -0.056508421897888184, 0.03255501389503479, 0.0252950768917799], [0.01565331034362316, 0.021835513412952423, 0.03325005620718002, -0.06484328955411911, 0.09229069948196411, 0.03386532887816429, 0.043475180864334106, -0.1474742293357849], [0.034775398671627045, -0.011489514261484146, -0.11511807143688202, -0.1086583361029625, -0.05150493234395981, 0.00915211159735918, -0.02985483594238758, -0.05098147690296173], [0.0881165862083435, -0.05689254030585289, 0.2125559002161026, -0.05151456221938133, -0.03853669762611389, 0.1619722694158554, -0.13836216926574707, 0.051998212933540344], [-0.11165419220924377, 0.06256859004497528, -0.031116390600800514, -0.0905006006360054, 0.09177015721797943, 0.07672979682683945, -0.053168248385190964, -0.005257707554847002], [0.08454207330942154, -0.06374577432870865, 0.14870259165763855, 0.00768553651869297, 0.050631508231163025, 0.1845848560333252, 0.00983626302331686, 0.0128083610907197], [0.05636792629957199, -0.08205126971006393, 0.1454029381275177, -0.0007230330375023186, -0.0961117073893547, 0.08516129106283188, -0.07991497218608856, 0.02086266130208969], [-0.017471706494688988, 0.12341776490211487, -0.19930718839168549, 0.048759326338768005, 0.05619502812623978, 0.07470094412565231, 0.06325756013393402, -0.028729289770126343]], [[0.13230593502521515, 0.00040897366125136614, 0.028262408450245857, -0.13065411150455475, 0.004513113759458065, 0.04435672238469124, 0.05612768605351448, -0.03756913170218468], [0.051283665001392365, -0.024208512157201767, 0.013371707871556282, 0.03009566105902195, 0.06490392982959747, -0.07312467694282532, 0.10256113857030869, -0.11907752603292465], [0.021924549713730812, -0.044884759932756424, -0.0860862135887146, 0.033073365688323975, 0.06529370695352554, -0.03594428300857544, 0.057615265250205994, 0.10620920360088348], [-0.11308261007070541, 0.04483046382665634, 0.2596229314804077, 0.11486709117889404, -0.15044590830802917, 0.002647560089826584, 0.07956977188587189, -0.02656339295208454], [-0.045935433357954025, 0.030799273401498795, -0.10898325592279434, 0.10598805546760559, -0.009822784923017025, -0.13501259684562683, -0.021837854757905006, 0.0925072580575943], [0.10242899507284164, 0.05633079633116722, -0.024580100551247597, 0.1076188012957573, -0.1504230946302414, 0.1792556792497635, 0.1091901957988739, -0.05693374201655388], [0.001313346321694553, -0.006831384729593992, 0.05218557268381119, -0.044463761150836945, -0.05816483497619629, 0.05192207172513008, -0.00012652292207349092, 0.004729932174086571], [-0.08732710033655167, 0.06074966490268707, -0.13252313435077667, 0.10244531184434891, 0.0908125787973404, -0.08313701301813126, 0.13150571286678314, -0.1586683839559555]], [[-0.049525924026966095, -0.008635802194476128, 0.06434041261672974, -0.021801164373755455, -0.033488694578409195, 0.0858888030052185, -0.10646139085292816, -0.08596587181091309], [-0.07027538865804672, -0.04432570934295654, -0.13779717683792114, 0.11645237356424332, 0.0632544755935669, -0.005259347148239613, 0.06961666792631149, -0.025016475468873978], [-0.11023638397455215, 0.11456188559532166, -0.11026466637849808, 0.13161809742450714, 0.015020451508462429, -0.12603430449962616, -0.02159474603831768, 0.01864495687186718], [-0.16109487414360046, -0.07671588659286499, 0.032141994684934616, 0.12526312470436096, 0.05308384820818901, -0.06849642843008041, 0.05360167473554611, -0.04866950586438179], [-0.02330077439546585, 0.030568834394216537, -0.08461617678403854, 0.11029879748821259, -0.010658924467861652, -0.1103551983833313, 0.17059862613677979, -0.11047615855932236], [-0.01640474796295166, 0.031741902232170105, 0.08050934970378876, 0.04505188763141632, -0.14377503097057343, 0.10147175937891006, 0.03542304411530495, 0.12346655875444412], [-0.012308888137340546, -0.14024803042411804, 0.07438123971223831, 0.04919550567865372, -0.08737359941005707, 0.0245819129049778, -0.021421441808342934, -0.05437717214226723], [-0.10179237276315689, 0.11375932395458221, -0.06039367988705635, 0.011927719227969646, -0.0021522773895412683, -0.05169885233044624, -0.05216067656874657, 0.03325197473168373]], [[-0.12566044926643372, -0.11045259982347488, -0.042212385684251785, -0.005803198553621769, 0.07753632962703705, -0.04609029367566109, 0.031685199588537216, -0.0337495282292366], [-0.016230778768658638, -0.05219719558954239, -0.05975639075040817, -0.020807234570384026, -0.03169843181967735, 0.05297824740409851, 0.00472356379032135, -0.10204732418060303], [-0.1398872584104538, 0.05576319247484207, -0.07516420632600784, -0.07633601129055023, -0.03448561951518059, -0.02037706784904003, 0.10244424641132355, 0.021457575261592865], [-0.035141393542289734, 0.10090585798025131, 0.13411733508110046, -0.0993661880493164, -0.02132931724190712, -0.15303495526313782, -0.17465676367282867, 0.18932710587978363], [0.015566399320960045, -0.07108944654464722, 0.02423701249063015, -0.10841918736696243, 0.01593792252242565, -0.08609069138765335, 0.07719594985246658, 0.07391153275966644], [0.07840896397829056, 0.05916251614689827, 0.08243335038423538, 0.10824879258871078, 0.013918072916567326, 0.11311995983123779, -0.10761312395334244, -0.011876444332301617], [0.05271320417523384, -0.07536238431930542, 0.016428012400865555, -0.03583328053355217, -0.09817545115947723, 0.008473497815430164, -0.0715923011302948, -0.0743577778339386], [0.1029517650604248, -0.026321183890104294, -0.15089312195777893, 0.12914620339870453, 0.014296191744506359, 0.07280603051185608, 0.06821143627166748, -0.11734405159950256]]]]}, {"shape": [8], "arrayweight": [0.11839184165000916, -0.06277745962142944, 0.11771418899297714, 0.05216377601027489, 0.0016047356184571981, 0.059397079050540924, 0.1082681342959404, 0.0812247171998024]}, {"shape": [8], "arrayweight": [0.9298659563064575, 0.9281406402587891, 0.8706488609313965, 0.9253044128417969, 0.9089584350585938, 0.8896663784980774, 0.9028972387313843, 0.9077352285385132]}, {"shape": [8], "arrayweight": [0.026474714279174805, 0.07577423006296158, -0.06886456906795502, -0.07958974689245224, 0.037082821130752563, -0.08034751564264297, -0.009279397316277027, 0.05255609005689621]}, {"shape": [8], "arrayweight": [1.4500635862350464, 1.3250987529754639, 2.058551788330078, 1.1325585842132568, 1.5832340717315674, 0.9981858134269714, 1.5492912530899048, 1.283048391342163]}, {"shape": [8], "arrayweight": [5.9723076820373535, 5.753957748413086, 2.9107606410980225, 4.141017436981201, 7.055613994598389, 0.8243193030357361, 7.288753032684326, 1.0807002782821655]}, {"shape": [5, 5, 12, 4], "kernelweight": [[[[-0.0747104361653328, 0.004631141200661659, 0.0012689469149336219, 0.08776883780956268], [-0.014957578852772713, -0.0573754608631134, 0.016809748485684395, -0.07427959889173508], [0.024921763688325882, -0.095415398478508, 0.0478474460542202, 0.00422239862382412], [-0.08773032575845718, -0.024108756333589554, 0.01933375373482704, -0.0255101528018713], [-0.04560741409659386, 0.03186793997883797, -0.0792892649769783, 0.02583133988082409], [-0.07030195742845535, -0.04584398865699768, -0.1055959090590477, -0.039347026497125626], [-0.04668274521827698, 0.11077909916639328, -0.07352203130722046, -0.10320064425468445], [0.03294237703084946, -0.03275905176997185, -0.0077445004135370255, 0.06137876212596893], [0.18224379420280457, 0.0977257788181305, -0.04527425765991211, -0.000986441969871521], [0.012475408613681793, -0.006872669793665409, 0.06723564863204956, -0.00791359506547451], [-0.05327257886528969, -0.09232966601848602, 0.06477953493595123, 0.012355582788586617], [0.07805727422237396, -0.06432235985994339, -0.002596040489152074, 0.07862584292888641]], [[0.08277102559804916, 0.030062509700655937, 0.04724115878343582, 0.03375893086194992], [0.0005505690351128578, 0.04727976769208908, 0.10298009216785431, -0.09705667942762375], [0.009884173050522804, 0.07806568592786789, 0.03550940379500389, -0.10359232127666473], [-0.045632172375917435, -0.025352437049150467, -0.011754421517252922, -0.014499775134027004], [0.08026912063360214, -0.09678149223327637, -0.07554663717746735, -0.0715264305472374], [-0.04218493402004242, 0.018023192882537842, -0.008995541371405125, 0.0740743950009346], [0.05624140799045563, -0.025632623583078384, 0.06161971390247345, 0.09178023785352707], [0.0937323197722435, -0.014416086487472057, -0.06842295825481415, 0.013714894652366638], [0.05950978398323059, 0.01916593685746193, 0.022281795740127563, 0.02481188252568245], [-0.005373349878937006, 0.16224950551986694, 0.05059366673231125, -0.0710531696677208], [-0.09283779561519623, 0.012001549825072289, 0.027680769562721252, 0.02889774739742279], [0.018924342468380928, -0.006629799492657185, 0.05727282166481018, 0.09020242094993591]], [[0.10119041055440903, 0.05015536770224571, -0.022076385095715523, -0.10202166438102722], [0.11957227438688278, 0.0028146146796643734, -0.05715959146618843, 0.07826083153486252], [-0.10119446367025375, -0.02980131097137928, 0.056945402175188065, -0.030928412452340126], [-0.03344839811325073, -0.0071589164435863495, -0.06322961300611496, -0.05727854371070862], [-0.0498528815805912, 0.11478204280138016, -0.0356849730014801, 0.08312094956636429], [0.0008734263828955591, -0.06657028198242188, 0.004280447028577328, 0.018892092630267143], [-0.07273820042610168, -0.044642966240644455, -0.005917825270444155, 0.08994366228580475], [0.07601797580718994, 0.10009065270423889, 0.03449919447302818, 0.06100081652402878], [0.0869930163025856, 0.09632959216833115, -0.034188102930784225, -0.01308758556842804], [0.11431193351745605, -0.018761321902275085, 0.09419986605644226, 0.036523859947919846], [-0.12424194812774658, 0.022539904341101646, -0.013912798836827278, -0.0416993647813797], [0.08326307684183121, -0.048606980592012405, 0.0490306131541729, 0.0995243564248085]], [[-0.07045102119445801, 0.042694512754678726, -0.05647975951433182, -0.08894176036119461], [-0.053065747022628784, -0.025973781943321228, 0.09003091603517532, 0.03891700506210327], [0.06358722597360611, -0.060543518513441086, -0.12289254367351532, -0.018420737236738205], [-0.02834904007613659, -0.13981714844703674, -0.021264400333166122, 0.07052859663963318], [0.009763232432305813, 0.09928081929683685, 0.08237798511981964, -0.020277008414268494], [-0.1118353083729744, -0.08690552413463593, -0.017250489443540573, -0.02193452976644039], [-0.00434108218178153, 0.010078191757202148, -0.047112513333559036, 0.05201112851500511], [-0.06609371304512024, 0.0668264850974083, 0.02026589773595333, -0.026332098990678787], [-0.020196208730340004, 0.01618996635079384, 0.041558779776096344, -0.016902608796954155], [-0.03308676928281784, 0.021352937445044518, 0.04457865282893181, 0.022611888125538826], [0.0872182697057724, -0.018711457028985023, -0.03127797320485115, -0.020055942237377167], [0.09983402490615845, -0.062046151608228683, -0.09030789881944656, 0.04994850978255272]], [[0.12730582058429718, 0.03445003554224968, -0.0735933929681778, -0.06298644840717316], [0.005031793378293514, -0.02272949181497097, 0.11227387189865112, 0.019279414787888527], [-0.028103074058890343, 0.06606622040271759, -0.1367742419242859, -0.035322610288858414], [-0.05327364802360535, 0.025201505050063133, -0.04566428065299988, -0.08979156613349915], [-0.02604457177221775, 0.06851194053888321, 0.05495870113372803, -0.04000395908951759], [-0.014258921146392822, -0.025288449600338936, 0.026534220203757286, 0.005468933843076229], [-0.0568423829972744, 0.049494292587041855, 0.028594864532351494, 0.09522166848182678], [0.13322122395038605, 0.11427375674247742, 0.05828825384378433, 0.005581232253462076], [0.07128231227397919, 0.02809523232281208, 0.005097281653434038, 0.029793141409754753], [0.059797368943691254, 0.04049322009086609, -0.012270302511751652, -0.08037007600069046], [0.04578996077179909, -0.02750200405716896, -0.003207153407856822, 0.059550754725933075], [-0.08483008295297623, 0.03749990463256836, -0.040270209312438965, -0.028626758605241776]]], [[[-0.039890632033348083, -0.10727518796920776, -0.07922127842903137, -0.06818501651287079], [0.049409836530685425, 0.05992996692657471, 0.03473158925771713, -0.008205797523260117], [-0.04569774493575096, 0.07555798441171646, 0.07051744312047958, 0.0252337995916605], [0.028716960921883583, -0.013014773838222027, 0.07217840105295181, 0.049380168318748474], [-0.06292358040809631, -0.08552641421556473, 0.09076689928770065, 0.014930011704564095], [-0.0003101358888670802, -0.13041137158870697, -0.07845310866832733, 0.07418758422136307], [-0.08225847780704498, -0.10621766000986099, 0.07916862517595291, 0.061389099806547165], [-0.00120424700435251, -0.051585275679826736, -0.05202285945415497, -0.0003859912103507668], [-0.06394708901643753, -0.08815893530845642, 0.03366994485259056, -0.058660801500082016], [0.13332456350326538, 0.14948312938213348, -0.02407337911427021, 0.07572007179260254], [0.0711415633559227, -0.02093193493783474, 0.08011708408594131, -0.016855718567967415], [0.05162953585386276, 0.10145637392997742, -0.07618990540504456, -0.024126240983605385]], [[0.02434122934937477, 0.07082206755876541, 0.11345063894987106, 0.05153055116534233], [0.05669853463768959, 0.13752761483192444, 0.05599818378686905, 0.09047382324934006], [-0.04779026284813881, -0.11091050505638123, 0.026431690901517868, -0.07633266597986221], [-0.08309117704629898, -0.08628763258457184, 0.04788219928741455, 0.05385033041238785], [-0.0269522275775671, -0.07673574984073639, -0.10040081292390823, -0.1081005334854126], [0.028598370030522346, -0.03178071230649948, -0.05224604532122612, 0.049977269023656845], [-0.046213507652282715, 0.013730882667005062, -0.09437180310487747, 0.003327104961499572], [0.09168921411037445, 0.07013168185949326, 0.12433184683322906, -0.057407695800065994], [-0.03885472193360329, 0.02964445948600769, -0.026995960623025894, -0.06809263676404953], [-0.03499336168169975, 0.07080202549695969, 0.03231966122984886, 0.010397708974778652], [0.08290383219718933, -0.01569700986146927, -0.001988879172131419, 0.07696371525526047], [0.03702873736619949, 0.00912413839250803, -0.008448400534689426, 0.0392879843711853]], [[0.1142512634396553, -0.04214092344045639, -0.025882678106427193, -0.05197228118777275], [0.0886024534702301, 0.11698660254478455, -0.010951722972095013, 0.00392797589302063], [-0.017667807638645172, 0.023075947538018227, -0.017678657546639442, -0.12658996880054474], [-0.10697527229785919, -0.11389702558517456, -0.055068086832761765, -0.03181230649352074], [0.04208880662918091, 0.04291865602135658, -0.025740062817931175, 0.09023945033550262], [-0.02430749125778675, -0.021326037123799324, -0.04920211434364319, 0.03845925256609917], [0.04039503633975983, -0.06919912993907928, -0.049408920109272, -0.09843961149454117], [-0.08421085774898529, 0.0878676250576973, 0.02394380047917366, -0.05856449156999588], [0.028820989653468132, 0.00276146549731493, 0.026000307872891426, -0.05138043314218521], [0.021083978936076164, 0.033425889909267426, 0.03613926097750664, 0.04531411454081535], [0.01971334032714367, -0.11705082654953003, 0.025737499818205833, -0.011646104045212269], [-0.007649376057088375, -0.06474660336971283, -0.04353274032473564, 0.11446761339902878]], [[-0.05868468061089516, 0.056481100618839264, -0.02189720794558525, -0.034361980855464935], [-0.057423364371061325, -0.0504285953938961, -0.08262825012207031, 0.07445943355560303], [0.02462506666779518, -0.005137916188687086, -0.02823750302195549, 0.03258927911520004], [0.01679246313869953, -0.029275069013237953, -0.05489332973957062, 0.0002807413402479142], [0.054353587329387665, -0.0660475343465805, -0.055020201951265335, 0.0380554273724556], [0.10319078713655472, -0.0013301852159202099, -0.0653390884399414, 0.08450111001729965], [0.004784703254699707, 0.06077583506703377, 0.09107817709445953, -0.08978987485170364], [0.08228207379579544, -0.0012196911266073585, -0.009808686561882496, 0.07516727596521378], [-0.02288101427257061, 0.04215579852461815, 0.0744440034031868, 0.05354902893304825], [0.06579039245843887, 0.1358451247215271, -0.09991489350795746, -0.029574505984783173], [-0.11412090063095093, 0.005949723068624735, 0.11626259982585907, -0.041475456207990646], [0.02145334891974926, 0.0477462001144886, 0.10775928199291229, 0.030446436256170273]], [[0.07713782042264938, -0.019812731072306633, 0.06245814636349678, 0.028843490406870842], [-0.07999348640441895, -0.020854739472270012, 0.07793361693620682, 0.04436298459768295], [0.02349432185292244, -0.1142682284116745, 0.06433570384979248, 0.08825628459453583], [-0.09282780438661575, 0.006342523731291294, -0.10026201605796814, -0.0316641628742218], [0.06840025633573532, 0.04497747868299484, 0.11609138548374176, 0.06066570058465004], [0.0324162021279335, 0.04662986099720001, -0.04290308058261871, 0.006338146049529314], [-0.11103035509586334, 0.021041804924607277, -0.015316871926188469, -0.0791555717587471], [-0.06104791909456253, -0.02203134447336197, 0.07534538954496384, -0.03869875520467758], [0.06091678515076637, 0.07921689003705978, -0.02231670171022415, -0.057014044374227524], [0.03400751203298569, 0.029570477083325386, 0.06206386163830757, 0.08451483398675919], [0.027568653225898743, -0.12180449813604355, 0.10073676705360413, -0.026656486093997955], [0.015808993950486183, 0.02776549756526947, -0.07442722469568253, -0.03927096351981163]]], [[[0.07354830205440521, -0.09535611420869827, -0.041300397366285324, -0.07258302718400955], [-0.021844547241926193, 0.06566689163446426, 0.00095042132306844, 0.004320940002799034], [-0.05236152932047844, 0.05469468981027603, -0.009934857487678528, -0.0944875106215477], [0.006067093927413225, -0.029461823403835297, -0.08436237275600433, 0.06672468036413193], [0.11594845354557037, 0.03911713510751724, 0.030894814059138298, 0.0538623221218586], [-0.04999598488211632, 0.050561342388391495, -0.02101384848356247, -0.0004586604773066938], [-0.0606834813952446, 0.05733037739992142, -0.043989431113004684, 0.022266115993261337], [0.0902334600687027, 0.029764218255877495, -0.007553246803581715, -0.07941388338804245], [0.012933969497680664, 0.09149907529354095, 0.06235624849796295, -0.06660029292106628], [-0.03213443607091904, 0.03334138169884682, -0.07902175188064575, 0.00107485125772655], [0.06451892107725143, 0.04598049819469452, 0.0788591206073761, 0.0672152042388916], [0.048660434782505035, -0.06980852037668228, -0.06407100707292557, 0.1013779565691948]], [[-0.12935473024845123, 0.05812223628163338, -0.08118411898612976, -0.0682024359703064], [0.08027154952287674, 0.1318107545375824, -0.05132567882537842, 0.05704404041171074], [0.06731050461530685, -0.009319350123405457, -0.04728389531373978, 0.0554957240819931], [-0.04023749381303787, -0.06050921976566315, 0.10502807050943375, -0.06670106947422028], [0.02377534657716751, -0.0024941961746662855, -0.008117975667119026, -0.09687582403421402], [-0.03915257006883621, -0.06385000050067902, 0.014753956347703934, -0.02346537448465824], [0.0010153125040233135, 0.10213965177536011, 0.0718277245759964, -0.006682421080768108], [-0.029445569962263107, 0.034127745777368546, 0.04585878551006317, 0.006892011500895023], [0.08720947802066803, 0.004051746800541878, -0.05164641886949539, -0.0747433751821518], [0.029644988477230072, -0.006547568365931511, 0.05736260116100311, 0.04689062386751175], [0.004665146581828594, -0.06430290639400482, 0.0634286031126976, 0.04324467107653618], [0.07587186247110367, 0.09089493006467819, 0.06206309795379639, 0.08894334733486176]], [[0.0225013829767704, -0.08575810492038727, -0.0260786060243845, -0.07277976721525192], [0.09128931164741516, -0.09030895680189133, 0.02448083460330963, -0.00236385315656662], [0.01366078294813633, -0.03553590923547745, -0.04391001537442207, -0.025926003232598305], [0.02512773498892784, -0.08592570573091507, -0.017683694139122963, -0.0008377133635804057], [0.01823812909424305, -0.06602703034877777, -0.04376275837421417, 0.10144486278295517], [-0.043795518577098846, 0.015674611553549767, 0.0748099833726883, -0.06937021762132645], [-0.12522801756858826, -0.04144037142395973, 0.05464787781238556, 0.045954518020153046], [0.08932803571224213, -0.03457583114504814, -0.00903341080993414, 0.05292010307312012], [0.05804996192455292, 0.046853840351104736, 0.0009694379987195134, 0.003107061143964529], [-0.012328176759183407, 0.06911490857601166, 0.0644812062382698, 0.06072412431240082], [0.06043732166290283, 0.009932713583111763, 0.0031421519815921783, -0.07587932050228119], [-0.03645777702331543, -0.0467945858836174, 0.031287841498851776, 0.27791479229927063]], [[0.06615713238716125, 0.0068120709620416164, 0.00124301144387573, 0.0047386507503688335], [0.1153857409954071, 0.06155990809202194, 0.0958598330616951, 0.023378949612379074], [0.07203138619661331, -0.023434817790985107, -0.010124393738806248, 0.020412122830748558], [0.04976467043161392, -0.022615691646933556, -0.005025485064834356, -0.05384413152933121], [-0.0851169005036354, 0.07302990555763245, -0.04849503934383392, -0.0863855704665184], [-0.08769252151250839, 0.035371311008930206, 0.01971038058400154, -0.05592259019613266], [-0.07487843930721283, -0.0268832016736269, -0.03797514736652374, 0.0524480827152729], [-0.04374292120337486, -0.05008935555815697, 0.023554159328341484, -0.027068909257650375], [0.05067348852753639, 0.043689414858818054, -0.08342438191175461, -0.021758366376161575], [-0.0640542060136795, 0.042480237782001495, 0.023334018886089325, 0.005858801770955324], [0.06981009989976883, -0.05622180178761482, 0.13027238845825195, 0.016050389036536217], [0.09313362836837769, 0.06640058755874634, 