{"model":{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_normalize_1", "class_name": "InputNormalize", "config": {"name": "input_normalize_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 8, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_normalize_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "size": [1, 1], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 3, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "transform_output", "class_name": "Denormalize", "config": {"name": "transform_output", "trainable": true}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["transform_output", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"},"weights":[{"shape": [9, 9, 3, 8], "kernelweight": [[[[-0.3883998692035675, -0.17927435040473938, 0.12324865162372589, 0.0784938707947731, 0.12386355549097061, 0.06592769920825958, 0.11154358088970184, 0.09722590446472168], [0.09964383393526077, -0.009497717954218388, 0.04956313967704773, 0.05090099200606346, -0.18277831375598907, -0.08936109393835068, -0.19086986780166626, -0.016780981793999672], [0.14415566623210907, 0.19570322334766388, 0.03567877411842346, -0.08151794224977493, -0.103415347635746, 0.06327778100967407, -0.13904179632663727, -0.08631814271211624]], [[-0.273872047662735, -0.2481105923652649, -0.09953686594963074, 0.04626599699258804, 0.11155305802822113, -0.033334579318761826, 0.11519225686788559, 0.0666094496846199], [-0.011161609552800655, -0.15168841183185577, -0.0949183851480484, 0.08010563999414444, -0.04888587072491646, -0.018418924883008003, -0.04527434706687927, 0.06819961220026016], [0.07227049022912979, 0.16945356130599976, -0.07018484175205231, -0.13698810338974, -0.09148463606834412, 0.1051659882068634, -0.15277765691280365, -0.07982043921947479]], [[-0.018927989527583122, -0.12207517772912979, 0.026560291647911072, 0.1059236228466034, 0.13597072660923004, -0.10743170231580734, 0.07788177579641342, 0.09141635149717331], [-0.024981820955872536, -0.12026330828666687, -0.06671778857707977, 0.1158665269613266, -0.038089293986558914, -0.005391639657318592, -0.034771453589200974, -0.027628812938928604], [0.10553184896707535, 0.14571022987365723, 0.027841150760650635, -0.054478734731674194, 0.006894536316394806, 0.12002060562372208, 0.004976262338459492, -0.08369839191436768]], [[-0.038558345288038254, -0.048219043761491776, 0.10497766733169556, 0.1489306092262268, 0.1202593445777893, -0.22800397872924805, -0.03135968744754791, 0.07805666327476501], [-0.06751056015491486, -0.12629109621047974, 0.08786551654338837, 0.12463614344596863, -0.07266426086425781, -0.11346971243619919, -0.10253452509641647, -0.03740356117486954], [0.055639058351516724, 0.07546960562467575, 0.051217760890722275, -0.05882873758673668, -0.017832161858677864, -0.06031636521220207, -0.02114257775247097, -0.021523699164390564]], [[-0.0357632152736187, -0.2266608476638794, 0.046774398535490036, -0.06028565391898155, 0.01187179610133171, -0.15404577553272247, -0.14520342648029327, -0.009672487154603004], [-0.1920364946126938, -0.1336696296930313, -0.06841728091239929, 0.15665793418884277, -0.008111942559480667, -0.07563875615596771, -0.17786546051502228, 0.14884476363658905], [0.0414748415350914, -0.01601376384496689, 0.09212515503168106, -0.10081552714109421, -0.015167205594480038, 0.003356033703312278, -0.06753577291965485, -0.13077794015407562]], [[0.02256825380027294, -0.23152372241020203, -0.14456135034561157, -0.0025753143709152937, 0.06001615524291992, -0.17008261382579803, -0.07138581573963165, 0.03678259253501892], [-0.1688448041677475, -0.08746914565563202, -0.1186327412724495, -0.008428887464106083, 0.10552889108657837, 0.026783589273691177, -0.16550104320049286, 0.025648638606071472], [0.09335936605930328, -0.07493143528699875, -0.014900480397045612, -0.21158654987812042, 0.1233263686299324, -0.026730747893452644, -0.12403890490531921, 0.001008136197924614]], [[0.017025616019964218, -0.2822437882423401, 0.11163704097270966, -0.07401862740516663, 0.08685111999511719, -0.19444723427295685, 0.01412609126418829, -0.01648598350584507], [-0.17777131497859955, -0.12081170082092285, 0.03180139139294624, 0.07307647913694382, 0.0837811678647995, 0.059707798063755035, -0.14241600036621094, -0.022089926525950432], [0.19322220981121063, 0.002769145183265209, 0.016173595562577248, -0.1847001612186432, 0.06431939452886581, 0.09265708923339844, -0.14579321444034576, -0.020676618441939354]], [[-0.04920648783445358, -0.1564100682735443, -0.06332133710384369, -0.007556302007287741, 0.12845084071159363, 0.01298557035624981, 0.13552576303482056, 0.03567320480942726], [0.08579695969820023, -0.030568284913897514, -0.09908029437065125, -0.01008990965783596, -0.05312032252550125, 0.00832348596304655, -0.14025752246379852, -0.07286763936281204], [0.1574079692363739, 0.11733505874872208, -0.19380265474319458, -0.15331879258155823, 0.005794570781290531, -0.12023180723190308, -0.08726880699396133, 0.001705237664282322]], [[-0.12101873755455017, -0.042504675686359406, -0.12912814319133759, 0.05686279386281967, 0.2593909204006195, 0.13965976238250732, 0.1747804880142212, 0.1590341478586197], [0.06796684116125107, 0.030461542308330536, -0.23609666526317596, 0.0746423527598381, -0.02439713105559349, 0.0006797571550123394, -0.1456862986087799, 0.06939460337162018], [0.22424449026584625, 0.27675580978393555, -0.1355569064617157, -0.014791657216846943, -0.09756352007389069, -0.09702732414007187, -0.04433313012123108, -0.043353863060474396]]], [[[-0.14017939567565918, -0.012379785999655724, 0.10350780189037323, -0.02097143791615963, 0.1059955433011055, 0.006290210410952568, 0.008687975816428661, 0.009751137346029282], [-0.003494454547762871, 0.1287815421819687, 0.06966552138328552, -0.001802457612939179, -0.1234557256102562, -0.12406992167234421, -0.16671253740787506, 0.10565648972988129], [-0.07207854837179184, 0.10868579894304276, 0.0523371696472168, -0.043753836303949356, -0.0055451421067118645, 0.12303351610898972, -0.1127508282661438, -0.06497395783662796]], [[0.007725102361291647, -0.00028638174990192056, 0.13602645695209503, -0.052618369460105896, 0.0124925272539258, 0.07305964827537537, -0.020446261391043663, 0.004609305411577225], [-0.01881573162972927, -0.016958018764853477, 0.2346058040857315, 0.05769868195056915, 0.07844840735197067, 0.02147131785750389, -0.13795815408229828, -0.08004643768072128], [0.009101294912397861, 0.09285508096218109, 0.060534972697496414, -0.06778852641582489, 0.12369797378778458, 0.33018073439598083, -0.07109634578227997, -0.034313175827264786]], [[0.15003111958503723, 0.08551381528377533, 0.12644921243190765, 0.156036838889122, -0.0652025043964386, -0.17281413078308105, -0.09827805310487747, -0.0010871276026591659], [-0.0027544056065380573, -0.024818265810608864, 0.2206025868654251, 0.18954648077487946, 0.06258273869752884, 0.02973509579896927, -0.14791572093963623, 0.06742657721042633], [0.025152292102575302, 0.015938933938741684, 0.05787590891122818, 0.0357491560280323, 0.14332854747772217, 0.23391836881637573, -0.02995406650006771, 0.10771623998880386]], [[0.3106715679168701, -0.021250708028674126, 0.16230978071689606, 0.16430124640464783, -0.1656949818134308, -0.3211002051830292, -0.12996818125247955, -0.07451096922159195], [0.00948476791381836, 0.04861193150281906, 0.19211719930171967, 0.24199484288692474, -0.05555417388677597, -0.03945256397128105, -0.13352081179618835, 0.009471398778259754], [-0.07251919060945511, -0.06438568979501724, 0.10627052187919617, 0.1763189285993576, -0.03511986881494522, -0.0026411693543195724, -0.11011791229248047, 0.0017501224065199494]], [[0.22444602847099304, -0.029401184991002083, 0.11278625577688217, -0.06017588451504707, -0.19118505716323853, -0.2576771676540375, -0.0937701016664505, -0.1728336364030838], [-0.11061297357082367, 0.062175899744033813, -0.056796856224536896, 0.1701699197292328, -0.0936085507273674, -0.03481993451714516, -0.0822480246424675, -0.07409507036209106], [0.014049013145267963, -0.010167069733142853, 0.18031266331672668, 0.1299951672554016, 0.09150128066539764, 0.1636793613433838, 0.03469296544790268, -0.08606477081775665]], [[-0.08593177795410156, -0.08295702934265137, -0.034239061176776886, -0.09054809808731079, 0.028068944811820984, -0.13746388256549835, -0.13094569742679596, 0.09877461194992065], [-0.27586179971694946, -0.023485472425818443, -0.06109321117401123, 0.09828592836856842, -0.07830686867237091, -0.021980442106723785, -0.14544793963432312, 0.06749957799911499], [-0.1594875007867813, 0.009372287429869175, 0.0523538663983345, -0.0158688947558403, 0.041860707104206085, 0.06130252033472061, -0.18293000757694244, 0.10059873014688492]], [[-0.001450074021704495, -0.08824151754379272, -0.15499678254127502, -0.12951035797595978, 0.039672184735536575, -0.06989193707704544, -0.24528267979621887, 0.35323917865753174], [-0.2775596082210541, 0.013885227032005787, -0.06917960941791534, -0.04617748036980629, 0.050809092819690704, 0.1485101282596588, -0.21049970388412476, 0.20598173141479492], [-0.08106189966201782, -0.003498886711895466, -0.1449766755104065, -0.0811101645231247, 0.13393768668174744, 0.1271340250968933, -0.1987575888633728, 0.2473461776971817]], [[0.09845130890607834, -0.0978872999548912, -0.12624391913414001, -0.04753988981246948, 0.2525128126144409, 0.11880063265562057, 0.030939903110265732, 0.06565035879611969], [-0.15526317059993744, -0.031203363090753555, -0.20282062888145447, -0.07152679562568665, -0.014124126173555851, 0.13201087713241577, -0.031404126435518265, 0.0813356339931488], [0.11068293452262878, 0.06998571753501892, -0.1319909542798996, -0.13407136499881744, 0.11064709722995758, 0.21868707239627838, -0.14868870377540588, -0.02182469144463539]], [[-0.02729017287492752, 0.028812529519200325, 0.008951760828495026, 0.04394350200891495, 0.1542915254831314, 0.1393035650253296, 0.26508229970932007, -0.040591977536678314], [0.032290372997522354, 0.019086772575974464, -0.05853187292814255, -0.037819042801856995, -0.08247809112071991, 0.02761433832347393, -0.0035547404550015926, -0.09673813730478287], [0.06336679309606552, 0.16386397182941437, 0.22411015629768372, -0.07184632867574692, 0.02452649176120758, -0.10829570144414902, 0.08433115482330322, -0.08849025517702103]]], [[[-0.01987302489578724, -0.0191354863345623, 0.14956919848918915, 0.0761299654841423, 0.15515786409378052, 0.032052770256996155, 0.058339618146419525, -0.021977316588163376], [0.0344010666012764, 0.09586961567401886, 0.09637104719877243, 0.14552874863147736, 0.034611400216817856, -0.02314794436097145, -0.21435829997062683, 0.03575259447097778], [0.03763850778341293, 0.037408798933029175, -0.0005969741614535451, 0.0480942502617836, 0.024101005867123604, 0.173370823264122, -0.1029433012008667, -0.0034597257617861032]], [[0.08801918476819992, 0.16356956958770752, 0.2741485834121704, 0.020988212898373604, -0.030623629689216614, 0.08629259467124939, -0.21277999877929688, 0.07659686356782913], [0.08150964230298996, 0.08491815626621246, 0.1818840354681015, 0.23879951238632202, -0.04679841548204422, 0.1419077068567276, -0.3271787762641907, 0.06641367077827454], [-0.03833717480301857, 0.04898304492235184, 0.15418289601802826, 0.20604313910007477, 0.0697861835360527, 0.2593674957752228, -0.16370703279972076, 0.1259414255619049]], [[0.2787232995033264, 0.17376436293125153, 0.15062111616134644, 0.10710173845291138, -0.3073825240135193, 0.03107643313705921, -0.16614945232868195, 0.19180156290531158], [0.08672942966222763, 0.1902521848678589, 0.20160868763923645, 0.365828275680542, -0.09924545884132385, 0.19072958827018738, -0.08921503275632858, 0.14401455223560333], [0.05606313794851303, -0.01681402325630188, 0.13109305500984192, 0.25759074091911316, 0.13274644315242767, 0.486248642206192, 0.05604033172130585, 0.061552949249744415]], [[0.512116014957428, 0.15483777225017548, 0.21966034173965454, 0.22146949172019958, -0.7368038296699524, -0.24803099036216736, -0.11643889546394348, -0.02059619128704071], [-0.04190884530544281, 0.16637162864208221, 0.22218124568462372, 0.37371015548706055, -0.3969828188419342, 0.09416323900222778, 0.12977851927280426, -0.04396198317408562], [0.08670888841152191, -0.13887178897857666, 0.14843426644802094, 0.2826167941093445, -0.16374361515045166, 0.22975194454193115, 0.12430357933044434, -0.06703154742717743]], [[0.2833388149738312, 0.2444717437028885, -0.07904540747404099, 0.21175427734851837, -0.5691844820976257, -0.12055724859237671, -0.018885305151343346, -0.08781544864177704], [-0.19636300206184387, 0.09827811270952225, -0.05674513056874275, 0.3699183166027069, -0.1800321638584137, 0.20091083645820618, 0.0708206295967102, -0.03718123584985733], [-0.16402298212051392, -0.08419592678546906, 0.03239838033914566, 0.36636650562286377, -0.06360294669866562, 0.34789979457855225, 0.10101140290498734, 0.06381133943796158]], [[0.16583453118801117, 0.16490288078784943, -0.48367491364479065, -0.00592791847884655, -0.20194314420223236, -0.2689433693885803, -0.19966979324817657, 0.22939333319664001], [-0.3123219609260559, 0.00902561005204916, -0.42377394437789917, 0.13209721446037292, 0.007481651846319437, 0.1535036861896515, -0.14157089591026306, 0.18814386427402496], [-0.2963821291923523, -0.03081677481532097, -0.3912084102630615, 0.10449880361557007, -0.00875210389494896, 0.10264678299427032, -0.06390120089054108, 0.3727153241634369]], [[0.1321888267993927, -0.08148124068975449, -0.46997544169425964, -0.01689143478870392, 0.03885747119784355, -0.14324124157428741, -0.3241562843322754, 0.298716276884079], [-0.31251227855682373, -0.018703898414969444, -0.44573116302490234, 0.15224777162075043, 0.01133402343839407, 0.08565304428339005, -0.13536250591278076, 0.26413533091545105], [0.009163795039057732, -0.2142399549484253, -0.2225237488746643, -0.010380564257502556, 0.17762887477874756, 0.24248266220092773, -0.12107199430465698, 0.0633920282125473]], [[0.09217734634876251, -0.0770888403058052, -0.07893819361925125, 0.060866136103868484, 0.20769013464450836, -0.06598514318466187, 0.0023013646714389324, -0.04244333505630493], [-0.12471921741962433, -0.020165739580988884, -0.11849584430456161, 0.03562377765774727, 0.1125689372420311, 0.1415267288684845, -0.02556057646870613, 0.0795397236943245], [0.12474621832370758, -0.18210583925247192, -0.04596778377890587, -0.12136374413967133, 0.07860583811998367, 0.1944313645362854, -0.04224424809217453, 0.012260198593139648]], [[-0.04074835032224655, 0.023901021108031273, 0.055436648428440094, -0.04270968213677406, 0.09833846986293793, 0.17321717739105225, 0.13484646379947662, -0.11710526049137115], [-0.08094912767410278, 0.04431954398751259, -0.1334216445684433, 0.09608441591262817, -0.022057529538869858, 0.22533480823040009, -0.016306404024362564, 0.035600777715444565], [0.06252066045999527, 0.017226755619049072, 0.04511503130197525, -0.06802357733249664, 0.012787621468305588, 0.10427699238061905, 0.026766503229737282, -0.0038540996611118317]]], [[[-0.10666429996490479, 0.12005927413702011, 0.132989764213562, 0.06742721796035767, 0.13109052181243896, 0.15182335674762726, -0.0760878175497055, -0.04529908299446106], [-0.04912055283784866, 0.13430114090442657, 0.11236261576414108, 0.06432604044675827, -0.04200609773397446, 0.06359997391700745, -0.24926522374153137, 0.02219212055206299], [0.04732365533709526, 0.0019113842863589525, 0.032143086194992065, 0.13557612895965576, 0.13496795296669006, 0.10411859303712845, -0.15557977557182312, 0.00531645817682147]], [[0.12456070631742477, 0.28598326444625854, 0.15742695331573486, 0.2097337394952774, -0.24732860922813416, -0.14542971551418304, -0.0479222871363163, 0.09692326933145523], [-0.050704747438430786, 0.24029763042926788, 0.23195287585258484, 0.30569887161254883, -0.12078158557415009, 0.11196558177471161, -0.24621859192848206, 0.2553390860557556], [0.028809664770960808, -0.013403559103608131, 0.08140983432531357, 0.3908156156539917, -0.03871231526136398, 0.2005220502614975, -0.12012624740600586, 0.04137871041893959]], [[0.40545031428337097, 0.4971809685230255, 0.3087681233882904, 0.1098199412226677, -0.6440525650978088, -0.30753663182258606, 0.032690681517124176, 0.036848284304142], [0.04346205294132233, 0.2341850847005844, 0.24385352432727814, 0.40981167554855347, -0.2525726854801178, -0.10234558582305908, 0.06050917133688927, 0.10731105506420135], [-0.03505929186940193, -0.09981923550367355, 0.16144365072250366, 0.39006003737449646, -0.07490664720535278, 0.1908871829509735, 0.14785374701023102, 0.10125357657670975]], [[0.350331574678421, 0.37621015310287476, 0.15611320734024048, 0.07082211226224899, -0.9429975748062134, -0.15632371604442596, 0.05778295546770096, -0.12603415548801422], [-0.14112429320812225, 0.2597312033176422, 0.2306937277317047, 0.31510597467422485, -0.36216825246810913, 0.05537598952651024, 0.2892690598964691, -0.0609138160943985], [-0.05554899200797081, -0.16018517315387726, 0.2043018490076065, 0.2841579020023346, -0.07760966569185257, 0.2075711339712143, 0.1834651231765747, -0.0520535483956337]], [[0.36790233850479126, 0.3774636387825012, -0.23959100246429443, 0.11491470038890839, -0.8326274156570435, 0.08619752526283264, -0.022870440036058426, -0.10646133124828339], [-0.13165012001991272, 0.33872780203819275, -0.18475598096847534, 0.47161877155303955, -0.3184299170970917, 0.335539847612381, 0.2010474056005478, -0.30699586868286133], [-0.017947517335414886, -0.07586665451526642, -0.16709530353546143, 0.4030868113040924, -0.17211087048053741, 0.42841798067092896, 0.22145988047122955, -0.03466219827532768]], [[0.3295496106147766, 0.29724961519241333, -0.3792523741722107, -0.08784716576337814, -0.38554590940475464, -0.13163039088249207, -0.0002554692036937922, -0.16214916110038757], [-0.2731495797634125, 0.1464190036058426, -0.39912301301956177, 0.2576172649860382, -0.09310760349035263, 0.12019423395395279, -0.002261135261505842, -0.05359663814306259], [-0.11709537357091904, -0.0730736032128334, -0.3698282539844513, 0.06178048998117447, -0.010205266065895557, 0.3279811441898346, 0.10855374485254288, 0.06852395087480545]], [[0.17956037819385529, -0.08911027759313583, -0.2189355194568634, -0.19923342764377594, -0.03715790435671806, -0.33211812376976013, -0.055664148181676865, 0.11524214595556259], [-0.22113901376724243, 0.07152576744556427, -0.369269996881485, 0.007591716945171356, -0.06839438527822495, 0.05114683881402016, -0.019490091130137444, 0.06824919581413269], [-0.04874422773718834, -0.22257252037525177, -0.21983465552330017, 0.05092969164252281, 0.06394528597593307, 0.019890064373612404, 0.06625649333000183, 0.029704729095101357]], [[0.16751284897327423, -0.0645473524928093, -0.14946597814559937, -0.05219990387558937, 0.0332096666097641, -0.2781548500061035, -0.06092764809727669, -0.03242094814777374], [-0.07569730281829834, 0.0025936346501111984, -0.15968483686447144, 0.049524061381816864, -0.03394220396876335, -0.00668806629255414, -0.022819701582193375, 0.05346928536891937], [0.07299374043941498, -0.10662105679512024, -0.05543246865272522, 0.03546721860766411, 0.05752980709075928, -0.10779242217540741, 0.048276133835315704, -0.01350089255720377]], [[0.031946491450071335, -0.055064983665943146, -0.08794446289539337, 0.04271160811185837, 0.12173473834991455, -0.004468818660825491, -0.0007431775447912514, -0.054591093212366104], [0.02769264206290245, 0.06156034395098686, -0.1537894755601883, 0.1038927361369133, -0.08811555057764053, 0.11803483217954636, -0.11129599809646606, -0.14919690787792206], [-0.012476774863898754, 0.022136449813842773, 0.003790186019614339, 0.02812526375055313, -0.10399226099252701, -0.02343529276549816, -0.11380597949028015, -0.12302035093307495]]], [[[-0.03791211172938347, 0.18780480325222015, 0.028046224266290665, -0.09490708261728287, -0.0034403817262500525, 0.028003927320241928, -0.06708044558763504, 0.005893817637115717], [0.03189709410071373, 0.042237911373376846, 0.05800456181168556, -0.009239481762051582, -0.13274843990802765, 0.036476679146289825, -0.19134937226772308, 0.058501530438661575], [-0.05523386597633362, 0.06386959552764893, 0.04842061549425125, -0.100534588098526, 0.03001268208026886, -0.0079044783487916, -0.16269011795520782, -0.011962062679231167]], [[0.12682323157787323, 0.2168128937482834, 0.21558406949043274, -0.031032197177410126, -0.13484737277030945, -0.021545324474573135, -0.1731959581375122, 0.07740207016468048], [-0.018844323232769966, 0.18942125141620636, 0.23764728009700775, 0.005437619052827358, -0.05463181063532829, -0.06364678591489792, -0.13631056249141693, 0.12806104123592377], [-0.0696980357170105, -0.08210118860006332, 0.13460563123226166, 0.1403665989637375, 0.034935612231492996, 0.1630694419145584, -0.10791432112455368, 0.12760059535503387]], [[0.25412821769714355, 0.41505447030067444, 0.24267242848873138, 0.1096690446138382, -0.4241585433483124, -0.37485334277153015, 0.012886552140116692, 0.2087792009115219], [-0.170904740691185, 0.15731826424598694, 0.26548758149147034, 0.13967595994472504, -0.08427916467189789, -0.09059640020132065, 0.09139043837785721, 0.10854023694992065], [-0.1876172125339508, -0.13538163900375366, 0.1797441989183426, 0.18139132857322693, 0.08052075654268265, -0.00385099183768034, 0.19533246755599976, 0.20217208564281464]], [[0.20731545984745026, 0.4742266535758972, 0.035064104944467545, -0.001406615017913282, -0.2940218448638916, -0.24324937164783478, 0.1778627336025238, 0.016091447323560715], [-0.11802370846271515, 0.21125192940235138, 0.17653623223304749, 0.14463838934898376, 0.03308052569627762, 0.026912303641438484, 0.36437687277793884, -0.18121473491191864], [-0.22706900537014008, -0.2273000180721283, 0.030794933438301086, 0.08983905613422394, 0.1257096230983734, 0.06742653995752335, 0.37435054779052734, 0.023568011820316315]], [[0.2668364644050598, 0.39103877544403076, -0.05890541151165962, -0.03802509978413582, -0.2775973677635193, -0.12560518085956573, 0.3343229293823242, -0.3972676694393158], [-0.3122677803039551, 0.34250497817993164, 0.07658006250858307, 0.10549745708703995, 0.04574071243405342, 0.3544341027736664, 0.41913896799087524, -0.5338122248649597], [-0.13374651968479156, -0.1426454335451126, 0.0450654998421669, 0.11974579840898514, 0.15655623376369476, 0.5060635805130005, 0.5174247026443481, -0.3254806697368622]], [[0.23599615693092346, 0.26217472553253174, -0.08296950906515121, -0.04963354393839836, -0.09062304347753525, -0.17517808079719543, 0.1458192616701126, -0.5818501114845276], [-0.4527207314968109, 0.1736130267381668, -0.13387548923492432, 0.004518636502325535, -0.027171386405825615, 0.03391241282224655, 0.3350203037261963, -0.309478223323822], [-0.19145861268043518, -0.13967491686344147, 0.0848257914185524, 0.0005377487395890057, 0.08651448041200638, 0.07435961067676544, 0.35340240597724915, -0.4355218708515167]], [[0.27009716629981995, -0.04984503239393234, -0.16618229448795319, -0.08201887458562851, -0.0819915309548378, -0.2555100619792938, -0.03462965041399002, -0.12884342670440674], [-0.2636065185070038, 0.053783927112817764, -0.13532525300979614, -0.07020357996225357, -0.07151754200458527, 0.04234222322702408, 0.05357363820075989, -0.014507179148495197], [-0.044825900346040726, -0.10488720238208771, 0.004044753964990377, -0.06922750920057297, 0.05419646576046944, -0.019542377442121506, 0.03921490162611008, -0.06345587968826294]], [[0.08823241293430328, -0.11765360832214355, -0.08663131296634674, -0.0927538052201271, 0.14557501673698425, -0.1840481162071228, -0.034792859107255936, 0.22056320309638977], [-0.16954448819160461, 0.07779879122972488, -0.2243320345878601, 0.10354465246200562, 0.04153859242796898, -0.03320980444550514, -0.05842910334467888, 0.030739502981305122], [0.015912655740976334, -0.1512005776166916, -0.15859368443489075, 0.051652342081069946, 0.029848827049136162, 0.042743682861328125, -0.11896967887878418, 0.23937702178955078]], [[-0.061555564403533936, 0.05330478399991989, -0.05365487188100815, -0.027881892397999763, 0.09956857562065125, -0.04103600233793259, 0.0053506772965192795, 0.07482744753360748], [-0.06280778348445892, 0.14953503012657166, -0.12389016896486282, 0.13646411895751953, -0.06684276461601257, 0.026126520708203316, -0.03853892534971237, -0.056872665882110596], [-0.06941808760166168, 0.01959686353802681, -0.06359376758337021, 0.088151715695858, -0.06086757406592369, -0.06386645138263702, -0.044799044728279114, 0.03336039558053017]]], [[[-0.0022845950443297625, -0.01666068285703659, -0.0003681649104692042, 0.016313571482896805, -0.08606404066085815, 0.058018267154693604, 0.05888000875711441, 0.007113464642316103], [0.006889909040182829, 0.043722838163375854, 0.13150615990161896, -0.07497569918632507, -0.027678364887833595, -0.07412023097276688, -0.08244971185922623, 0.03300100192427635], [0.03314388543367386, -0.03507739305496216, -0.010277085937559605, -0.0005178996361792088, 0.05115634948015213, -0.1737784743309021, -0.05487477779388428, -0.0916544571518898]], [[-0.0025310791097581387, 0.2674580514431, 0.0638975277543068, -0.03838229179382324, -0.1580723077058792, -0.017872458323836327, -0.0415254682302475, 0.14441058039665222], [-0.06238258630037308, 0.07302592694759369, 0.18538714945316315, -0.09387665241956711, 0.04457326978445053, -0.006671457085758448, -0.06463956087827682, -0.0671374723315239], [0.02488703653216362, -0.16127905249595642, 0.1301908642053604, -0.04497438296675682, 0.06365686655044556, 0.07556682825088501, -0.05516703426837921, -0.05094199627637863]], [[0.06836502999067307, 0.36779099702835083, -0.001634205924347043, 0.035714857280254364, -0.13469474017620087, -0.1575959473848343, -0.010496791452169418, 0.20790761709213257], [-0.13484016060829163, 0.17720480263233185, 0.0881151333451271, 0.04059087857604027, 0.030614390969276428, -0.01757637970149517, 0.1789899617433548, 0.09817862510681152], [-0.07470251619815826, -0.28046178817749023, 0.0523071251809597, 0.11118903011083603, 0.06918670237064362, 0.08714079856872559, 0.12591682374477386, 0.19783474504947662]], [[0.1966831237077713, 0.2929657995700836, -0.006870865821838379, -0.13643155992031097, 0.006427227519452572, -0.061052531003952026, 0.1400192230939865, -0.10621184855699539], [-0.22789634764194489, 0.10435418784618378, 0.021425761282444, 0.02391386590898037, 0.13964688777923584, 0.031394604593515396, 0.37874534726142883, 0.05584421381354332], [-0.048483241349458694, -0.3022175431251526, -0.07996765524148941, -0.03959706053137779, 0.2783907651901245, 0.09378976374864578, 0.34642091393470764, 0.130819633603096]], [[0.12721136212348938, 0.18033431470394135, 0.08758153021335602, -0.13574692606925964, -0.022541465237736702, -0.032797813415527344, 0.3105972707271576, -0.49531078338623047], [-0.4222928583621979, 0.2146090716123581, 0.08747445046901703, -0.01712922193109989, 0.18371440470218658, 0.2379668951034546, 0.4619702398777008, -0.4121640920639038], [-0.12355107069015503, -0.2740560472011566, 0.16703662276268005, -0.1522793471813202, 0.30927446484565735, 0.15854865312576294, 0.413904070854187, -0.3917863965034485]], [[0.19819936156272888, 0.21010428667068481, 0.15997302532196045, -0.17864233255386353, -0.11627651751041412, -0.22269311547279358, 0.22491538524627686, -0.4068411886692047], [-0.2776774764060974, 0.11894526332616806, 0.08210576325654984, -0.1226116418838501, 0.01474748458713293, 0.18656383454799652, 0.3353516757488251, -0.44488900899887085], [-0.1571710854768753, -0.18451623618602753, 0.2861746847629547, -0.0420079305768013, 0.2523963749408722, 0.09718713164329529, 0.19096671044826508, -0.3200741112232208]], [[0.2414926439523697, -0.049815963953733444, 0.0628068596124649, -0.03668602183461189, -0.06556002050638199, -0.260678231716156, 0.04125532507896423, -0.12572410702705383], [-0.1766926497220993, 0.08582133799791336, -0.09781961888074875, -0.015506641939282417, 0.07266191393136978, -0.021085254848003387, 0.1649852693080902, -0.02282392419874668], [0.04292953759431839, -0.18310505151748657, 0.09608394652605057, -0.11425740271806717, 0.04608263075351715, -0.1211538016796112, 0.1537795066833496, 0.014902391470968723]], [[0.006394457537680864, -0.00969675276428461, -0.19010613858699799, -0.09357445687055588, 0.08267930150032043, -0.16524548828601837, -0.0848623514175415, 0.24819785356521606], [-0.1255311220884323, 0.00426085339859128, -0.09110528230667114, 0.0259409099817276, -0.11500182747840881, -0.03410430625081062, 0.06680502742528915, 0.04112427309155464], [0.005694426130503416, -0.0753953829407692, -0.18003390729427338, -0.0023683151230216026, 0.09688493609428406, -0.02355211228132248, -0.055308498442173004, 0.24429579079151154]], [[0.011951962485909462, -0.035433363169431686, -0.07485196739435196, -0.1231343224644661, 0.12086506932973862, -0.07362424582242966, 0.07286106050014496, 0.18168586492538452], [-0.11907877773046494, 0.06182440370321274, -0.1782686859369278, 0.056813906878232956, -0.01497099082916975, 0.04389728605747223, -0.04143895208835602, -0.09922633320093155], [0.08362466096878052, 0.061345405876636505, -0.0804288312792778, -0.15941525995731354, -0.012196360155940056, -0.15702873468399048, -0.054644547402858734, 0.07506434619426727]]], [[[-0.021248795092105865, -0.005746093112975359, 0.20530790090560913, -0.07787463068962097, -0.03211279585957527, 0.00793412234634161, 0.01449927594512701, -0.0019448405364528298], [0.1555890440940857, -0.11066734790802002, 0.24691295623779297, -0.06042282283306122, -0.0890292301774025, -0.015847766771912575, -0.054014358669519424, -0.04241960123181343], [0.15301784873008728, -0.0368708111345768, 0.012778694741427898, -0.09963124990463257, 0.052451636642217636, -0.02195037715137005, -0.22985820472240448, 0.05985558405518532]], [[0.013266745954751968, 0.05820649489760399, -0.09436295926570892, -0.14253449440002441, -0.010633834637701511, 0.07009780406951904, -0.12315870076417923, 0.06022035703063011], [0.05526038631796837, -0.061633024364709854, 0.09510811418294907, -0.10059797763824463, -0.06275074928998947, 0.030765078961849213, -0.08263383060693741, 0.021023863926529884], [0.18331710994243622, -0.11770869791507721, -0.08355824649333954, -0.03843328356742859, -0.003971502184867859, 0.15089242160320282, -0.1665915697813034, 0.05903931334614754]], [[0.00925156194716692, 0.18740259110927582, -0.022740740329027176, -0.17080055177211761, -0.07723365724086761, -0.13838927447795868, 0.03249518200755119, -0.026158349588513374], [-0.13021735846996307, 0.14356426894664764, -0.009036712348461151, -0.1405496597290039, -0.02440841682255268, -0.04819495975971222, -0.015964113175868988, 0.13519184291362762], [-0.007800284307450056, -0.22157630324363708, 0.030546553432941437, -0.1373426914215088, 0.04188207536935806, 0.006881156470626593, 0.1774473339319229, -0.032026443630456924]], [[-0.09190188348293304, 0.16764381527900696, -0.11107765138149261, -0.11052989214658737, -0.02726779319345951, -0.2025684416294098, 0.13665300607681274, -0.19583843648433685], [-0.33930566906929016, 0.05690908804535866, -0.1510094553232193, -0.1765785664319992, -0.06739091128110886, 0.00032530882162973285, 0.17586937546730042, 0.09190735965967178], [0.030387064442038536, -0.12451343983411789, -0.0933007076382637, -0.1682833582162857, 0.11764436215162277, -0.02469613216817379, 0.22240445017814636, -0.05822021886706352]], [[0.06721066683530807, 0.043480273336172104, 0.0191716980189085, -0.29328709840774536, -0.14159324765205383, -0.10128448158502579, 0.05729134380817413, -0.15270890295505524], [-0.16640375554561615, 0.12793035805225372, -0.10249967128038406, -0.1780620515346527, 0.09203816205263138, 0.27661848068237305, 0.2118721604347229, -0.018187394365668297], [-0.030669432133436203, -0.21331797540187836, 0.08716615289449692, -0.24218128621578217, 0.17822489142417908, 0.19402676820755005, 0.11665115505456924, -0.0705132931470871]], [[0.19473561644554138, 0.05899174511432648, 0.09404311329126358, -0.19596533477306366, -0.18864595890045166, -0.0937294214963913, 0.08211997896432877, 0.08166772127151489], [-0.1579420119524002, 0.026003459468483925, 0.22218379378318787, -0.24502530694007874, -0.03746642917394638, 0.13860036432743073, 0.20890477299690247, -0.123923160135746], [0.023274706676602364, -0.14721646904945374, 0.06090415269136429, -0.1686094105243683, 0.1102030947804451, 0.06503944844007492, 0.1314665973186493, 0.18900442123413086]], [[0.14845027029514313, 0.011204644106328487, 0.09307584166526794, 0.011276951059699059, -0.016977177932858467, -0.16543929278850555, 0.0598171204328537, 0.08946087956428528], [-0.13513033092021942, 0.06619753688573837, 0.10815536230802536, -0.025416908785700798, -0.14374075829982758, 0.056386061012744904, 0.07649234682321548, -0.08726788312196732], [0.031806182116270065, -0.12103220820426941, 0.07989396899938583, -0.07682350277900696, -0.004414783790707588, 0.13267458975315094, 0.007118520326912403, 0.17311693727970123]], [[0.08402228355407715, -0.06608136743307114, -0.05381820723414421, -0.0972629189491272, -0.01715703308582306, -0.08700910210609436, -0.0545366108417511, -0.061756569892168045], [-0.0887337476015091, 0.1582432985305786, -0.04216885194182396, -0.07303425669670105, -0.16007183492183685, -0.0130770867690444, -0.01562918908894062, -0.05319702997803688], [0.14577297866344452, 0.03409448266029358, 0.03009863570332527, -0.10070051997900009, -0.12240144610404968, 0.01149989664554596, -0.09356888383626938, -0.022875452414155006]], [[0.05828956142067909, -0.05275487154722214, -0.0030750336591154337, 0.025389738380908966, 0.07131204009056091, -0.05937488377094269, -0.012747795321047306, 0.00912997592240572], [-0.01177719235420227, 0.05938159301877022, -0.03421379625797272, -0.0852000042796135, -0.09435692429542542, 0.00917877722531557, -0.0012737144716084003, 0.02263888344168663], [0.17631113529205322, -0.043068766593933105, 0.04852135479450226, -0.24500267207622528, -0.09434621781110764, -0.02810223214328289, -0.00034693762427195907, 0.07480505853891373]]], [[[-0.056914933025836945, -0.17272615432739258, 0.058451615273952484, 0.05283612385392189, 0.05491717904806137, 0.2519472539424896, -0.03735342621803284, 0.009697622619569302], [0.16270412504673004, -0.08113741129636765, 0.05561653524637222, -0.16086776554584503, -0.10182443261146545, -0.017607351765036583, -0.146949902176857, -0.021181248128414154], [0.05267807096242905, -0.08002102375030518, -0.09816533327102661, -0.19636867940425873, 0.0279175266623497, -0.059947095811367035, -0.14233340322971344, -0.03172990307211876]], [[-0.09265708923339844, -0.0029581307899206877, -0.10232474654912949, -0.09483081102371216, -0.05735408887267113, 0.0908818170428276, -0.07390783727169037, 0.0668119266629219], [-0.01734866201877594, -0.08242061734199524, 0.056725312024354935, -0.23079036176204681, -0.10287121683359146, -0.05532669648528099, -0.07752804458141327, 