{"model":{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_normalize_1", "class_name": "InputNormalize", "config": {"name": "input_normalize_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 8, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_normalize_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "size": [1, 1], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 3, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "transform_output", "class_name": "Denormalize", "config": {"name": "transform_output", "trainable": true}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["transform_output", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"},"weights":[{"shape": [9, 9, 3, 8], "kernelweight": [[[[-0.04849300533533096, -0.2775627672672272, -0.06999984383583069, -0.17625735700130463, -0.031002014875411987, -0.027578623965382576, 0.09236019849777222, 0.028318144381046295], [-0.036440908908843994, -0.20765790343284607, -0.08149368315935135, -0.17217500507831573, 0.041641004383563995, -0.011465843766927719, -0.046628959476947784, 0.005388413090258837], [-0.07535106688737869, -0.13355430960655212, 0.025786669924855232, -0.0573379322886467, -0.02608812041580677, -0.0466109998524189, 0.0381002277135849, -0.11914131790399551]], [[-0.09748309850692749, -0.19017505645751953, -0.1803971230983734, -0.16847531497478485, -0.024786613881587982, 0.0013995446497574449, 0.09921734780073166, -0.024544725194573402], [-0.10936114192008972, -0.058096956461668015, -0.08945346623659134, -0.11261529475450516, 0.021170562133193016, 0.06488809734582901, 0.012807141989469528, 0.07191190123558044], [-0.08226145058870316, -0.07406571507453918, -0.07137710601091385, -0.09376829862594604, -0.03383613005280495, -0.06737195700407028, -0.018135981634259224, 0.004742381628602743]], [[-0.14650790393352509, -0.11695423722267151, -0.05505498871207237, -0.0921475887298584, 0.03831445053219795, -0.01076231338083744, 0.03961341828107834, 0.05587617680430412], [-0.03289063274860382, -0.10323043167591095, 0.004789454396814108, -0.04037878289818764, -0.04630003124475479, 0.051201414316892624, 0.08191382139921188, 0.09091795235872269], [-0.12364757061004639, -0.009853951632976532, 0.04480963572859764, 0.030778225511312485, 0.03406040742993355, 0.10039141029119492, -0.08009360730648041, 0.09981203079223633]], [[-0.1948179453611374, -0.07365302741527557, 0.05270424857735634, -0.15947416424751282, -0.023401953279972076, 0.017719721421599388, 0.06005462631583214, -0.04970818758010864], [-0.00452758464962244, 0.061764929443597794, 0.004330280236899853, 0.0014939620159566402, 0.015262294560670853, -0.0748225674033165, 0.0075036026537418365, 0.06745807826519012], [-0.08837661147117615, 0.06821351498365402, -0.03326890245079994, -0.04519573971629143, 0.03349396586418152, -0.08861477673053741, -0.012991707772016525, -0.05557958409190178]], [[-0.1486888974905014, 0.07459790259599686, -0.018623821437358856, -0.05789422616362572, -0.04795786365866661, 0.07307416945695877, -0.035871054977178574, -0.08726444840431213], [-0.08687093108892441, -0.045556165277957916, 0.02735144831240177, -0.07615607231855392, 0.0021095953416079283, -0.07810309529304504, -0.07073294371366501, -0.024436887353658676], [-0.09020458161830902, 0.1646673083305359, 0.0012507041683420539, -0.046408653259277344, 0.02808573469519615, -0.041658103466033936, 0.018379904329776764, -0.047923844307661057]], [[-0.03820846229791641, 0.14021527767181396, 0.1231883093714714, 0.014964324422180653, -0.043369147926568985, -0.02031492441892624, -0.04978638514876366, -0.1268681436777115], [-0.070746511220932, 0.06224765256047249, 0.020374314859509468, 0.027366990223526955, -0.024454211816191673, -0.08604474365711212, 0.06273231655359268, -0.10531777143478394], [0.0875365361571312, 0.026780903339385986, 0.026857037097215652, 0.09931671619415283, -0.06885480135679245, -0.0195007286965847, -0.14474157989025116, 0.017473271116614342]], [[-0.01382750179618597, 0.16488724946975708, -0.015253697521984577, 0.02017909288406372, 0.023900214582681656, -0.07893127202987671, 0.05723018944263458, 0.009522252716124058], [0.06284642964601517, 0.07645385712385178, 0.0255130548030138, -0.05135468766093254, -0.0682855024933815, -0.0429789274930954, -0.005835856776684523, 0.023390818387269974], [0.09803617000579834, 0.13826502859592438, 0.05338887870311737, 0.02535923570394516, -0.045131538063287735, -0.0702139139175415, -0.006835551466792822, -0.11066434532403946]], [[0.021123088896274567, 0.08669646084308624, -0.017681537196040154, 0.0028695787768810987, 0.05783587694168091, -0.02138635888695717, -0.04292029142379761, -0.012104379013180733], [0.1405317336320877, 0.031181765720248222, -7.097216439433396e-05, -0.08259107172489166, 0.02863963693380356, -0.08938220888376236, 0.05600394308567047, 0.027531316503882408], [0.13530264794826508, -0.0038369244430214167, -0.03306856006383896, -0.03996088728308678, -0.016846636310219765, -0.13284073770046234, 0.047531504184007645, -0.08846054971218109]], [[0.11915238946676254, 0.017151543870568275, 0.028384776785969734, -0.07367389649152756, 0.07148317992687225, -0.12420965731143951, -0.03454853221774101, -0.024304449558258057], [0.14220362901687622, 0.018090443685650826, 0.03405897319316864, -0.10949768871068954, -0.022957641631364822, 0.014879479072988033, -0.023646876215934753, -0.002110218396410346], [0.17073705792427063, -0.07791794091463089, 0.010782293044030666, 0.05649228021502495, 0.005910441745072603, -0.04898566007614136, -0.05611652880907059, 0.10218779742717743]]], [[[0.05324843153357506, -0.12416636198759079, -0.16989120841026306, -0.1343146115541458, -0.006034717429429293, -0.05430109053850174, -0.01890723593533039, 0.10058047622442245], [-0.044995103031396866, -0.1558803766965866, -0.0757434070110321, -0.06777051091194153, 0.03439868241548538, 0.0490095317363739, 0.02524247020483017, 0.05849093198776245], [0.04039287939667702, -0.12365569919347763, -0.030221490189433098, 0.05452917516231537, -0.08604171127080917, -0.004215318709611893, -0.0658005103468895, 0.0431937575340271]], [[0.08111152052879333, -0.20825646817684174, -0.20582212507724762, -0.0488729365170002, -0.13568930327892303, 0.015184162184596062, -0.04062868654727936, 0.08137114346027374], [0.06997504830360413, -0.0692984089255333, -0.20545260608196259, -0.02419823780655861, -0.07776186615228653, 0.06749331951141357, -0.011171429418027401, 0.0009207003749907017], [-0.0769486278295517, -0.0650748461484909, -0.06602266430854797, -0.03847545012831688, -0.08634644001722336, 0.03740997612476349, 0.036631278693675995, 0.05946915224194527]], [[-0.08310875296592712, -0.08254612237215042, -0.08113104850053787, -0.07862866669893265, 0.04259808734059334, 0.06456493586301804, 0.05586976557970047, 0.009538981132209301], [0.06160273402929306, -0.08756929636001587, -0.1870991736650467, -0.10256092250347137, -0.023270560428500175, -0.019898351281881332, -0.04591512307524681, 0.08875017613172531], [-0.025378091260790825, 0.07163181900978088, -0.024584027007222176, 0.026973025873303413, -0.06943688541650772, 0.14044329524040222, 0.046905044466257095, 0.01827818527817726]], [[-0.0674014464020729, -0.07672552019357681, 0.013286866247653961, -0.024426762014627457, -0.019432594999670982, 0.10095065087080002, 0.009207386523485184, 0.13754156231880188], [-0.006117332726716995, 0.03195358067750931, -0.02127942629158497, -0.13659235835075378, 0.04686175659298897, -0.000421432894654572, 0.036671947687864304, 0.06396900117397308], [0.053622059524059296, -0.029019983485341072, -0.05110333859920502, -0.06007095053792, 0.06356842815876007, 0.0960051566362381, -0.0027328638825565577, 0.026024004444479942]], [[0.04375603795051575, -0.04016907885670662, 0.1580587476491928, -0.005937596317380667, 0.06623274087905884, 0.015487760305404663, 0.06899766623973846, -0.027767080813646317], [0.04426853731274605, -0.01308065839111805, 0.04779442399740219, -0.13672509789466858, 0.01808684878051281, 0.07247654348611832, -0.04902011528611183, -0.057723212987184525], [0.03324833884835243, 0.09826363623142242, 0.18831852078437805, -0.03456574305891991, 0.03967944532632828, -0.023043889552354813, -0.09043657034635544, -0.0774998813867569]], [[0.08972964435815811, 0.05201641470193863, 0.2041655331850052, -0.04677816107869148, 0.06534931063652039, -0.03384898230433464, 0.08580154925584793, -0.012759843841195107], [0.050944775342941284, 0.023842718452215195, 0.08276095241308212, 0.009945660829544067, -0.03779588267207146, -0.05525872856378555, 0.060661911964416504, 0.02181529626250267], [0.20685166120529175, 0.1009390726685524, 0.1933973878622055, -0.07215921580791473, 0.03708690404891968, -0.09628169238567352, 0.026861241087317467, 0.03423404321074486]], [[-0.05397193506360054, 0.15807075798511505, 0.09702278673648834, -0.045383188873529434, 0.021964101120829582, -0.09022869169712067, -0.016374127939343452, 0.017037590965628624], [0.02165253832936287, 0.06950604915618896, 0.11281125247478485, -0.07822643965482712, 0.05125225707888603, -0.09412477165460587, 0.013064727187156677, -0.08513663709163666], [0.20798861980438232, 0.015147329308092594, 0.13472063839435577, -0.03994913771748543, -0.026727309450507164, -0.10049135982990265, -0.042803894728422165, -0.1022910475730896]], [[0.056701891124248505, 0.02906680479645729, 0.028136463835835457, -0.0022243887651711702, 0.0636911541223526, -0.09119412302970886, 0.057018108665943146, -0.05336865782737732], [-0.00931165087968111, 0.014804563485085964, 0.0888461098074913, -0.11411441117525101, 0.01768609695136547, -0.08672135323286057, 0.07214251160621643, 0.010473956353962421], [0.12568967044353485, 0.017035173252224922, -0.019675442948937416, -0.07741791754961014, -0.05855448171496391, -0.16799870133399963, -0.031414296478033066, -0.051478251814842224]], [[0.07752345502376556, 0.07866503298282623, 0.10023185610771179, -0.028595199808478355, 0.11048459261655807, -0.11935180425643921, 0.02842579036951065, -0.0638040155172348], [0.14674827456474304, -0.0612594410777092, 0.06003633141517639, -0.07341062277555466, 0.012323154136538506, -0.018505588173866272, -0.019711418077349663, -0.0647813081741333], [0.13326284289360046, -0.036610037088394165, -0.05764777213335037, -0.1042059138417244, -0.01555626466870308, -0.0386538952589035, 0.028991172090172768, -0.014542866498231888]]], [[[0.09817007184028625, -0.05280397832393646, -0.14177539944648743, 0.03767450526356697, -0.055184803903102875, 0.05884956195950508, -0.04844812676310539, 0.04572625458240509], [0.06466750800609589, -0.1482304185628891, -0.21233026683330536, -0.09748656302690506, -0.062153249979019165, -0.05280662700533867, 0.03951988369226456, 0.10029046982526779], [-0.014331530779600143, -0.16368483006954193, -0.055763017386198044, 0.04457920044660568, -0.0878949984908104, 0.0024653258733451366, -0.03953645005822182, 0.03209606558084488]], [[0.012271840125322342, -0.1314210295677185, -0.2007886916399002, -0.011750997975468636, -0.08598846197128296, 0.07930868119001389, -0.019834373146295547, 0.12826132774353027], [0.04661817476153374, -0.0457223504781723, -0.21482673287391663, -0.04685886949300766, -0.023910006508231163, -0.10432782024145126, 0.053935445845127106, -0.0013326610205695033], [0.09136707335710526, -0.10796379297971725, -0.0993494838476181, -0.12017153948545456, -0.03600996360182762, 0.07195837050676346, 0.025381866842508316, 0.11246755719184875]], [[-0.04143127426505089, -0.015845192596316338, -0.08968345820903778, -0.10174454003572464, -0.08467196673154831, -0.023652199655771255, -0.04805879294872284, 0.12890543043613434], [-0.03826530650258064, -0.043302539736032486, -0.14018651843070984, -0.06643102318048477, -0.05152631923556328, 0.07277790457010269, 0.025449218228459358, 0.05506277084350586], [-0.034363918006420135, -0.08468359708786011, -0.13994409143924713, -0.12033738195896149, -0.09437466412782669, 0.11705989390611649, -0.057986319065093994, 0.10542714595794678]], [[-0.033050186932086945, -0.0667157992720604, -0.030118105933070183, -0.1621841937303543, -0.05477026477456093, 0.06187163665890694, -0.010733009316027164, 0.10826677829027176], [-0.028599938377738, 0.043331753462553024, -0.02978328801691532, -0.12989935278892517, 0.03819011524319649, -0.010961092077195644, -0.04944266006350517, 0.029537854716181755], [-0.043293215334415436, 0.06346103549003601, -0.04690053313970566, -0.13742493093013763, -0.03315458819270134, 0.036565907299518585, -0.024096770212054253, 0.12189789861440659]], [[-0.09417645633220673, 0.05099793151021004, 0.10015225410461426, -0.08059242367744446, 0.1279839426279068, -0.02775559015572071, -0.010703494772315025, -0.027803990989923477], [-0.04775971919298172, -0.04575534164905548, 0.060552481561899185, -0.15571269392967224, -0.03932876139879227, 0.006556827574968338, 0.02767755277454853, -0.08084618300199509], [-0.07978278398513794, 0.10928758978843689, 0.027665914967656136, -0.06873896718025208, -0.0213309433311224, 0.1360970288515091, 0.018752697855234146, -0.10187090933322906]], [[-0.06768368929624557, 0.09539887309074402, 0.05188882723450661, -0.12531068921089172, 0.13826438784599304, 0.05780864506959915, 0.00762935820966959, -0.03558661416172981], [-0.06417369097471237, 0.0200597383081913, -0.0033522862941026688, -0.08609964698553085, -0.03265135735273361, -0.05679083243012428, 0.004423778038471937, -0.02899222820997238], [-0.09518307447433472, 0.0653613805770874, 0.05938718467950821, -0.08496610820293427, 0.023502333089709282, -0.04651382192969322, 0.04722417891025543, -0.10574091970920563]], [[-0.12617872655391693, 0.19017691910266876, 0.09612917900085449, -0.00820801593363285, 0.028313307091593742, -0.08018149435520172, -0.010115980170667171, -0.006619338411837816], [-0.03838805481791496, 0.022908538579940796, 0.07965710759162903, -0.0469474270939827, -0.030337609350681305, 0.048180196434259415, 0.03170226141810417, -0.05830282345414162], [-0.1220749169588089, 0.03533647954463959, 0.05950381979346275, -0.04235069453716278, 0.06797410547733307, 0.032724447548389435, 0.08996722102165222, -0.1121680736541748]], [[0.011538072489202023, 0.013739478774368763, 0.05380099266767502, -0.08730602264404297, 0.08224338293075562, -0.100312739610672, 0.09149456769227982, -0.09389381110668182], [-0.056757789105176926, 0.1153963953256607, 0.11168109625577927, -0.029194742441177368, 0.034145288169384, -0.13025639951229095, 0.09852062910795212, -0.09918597340583801], [-0.005937365349382162, 0.07398142665624619, -0.040140826255083084, -0.10804405063390732, -0.009272512048482895, -0.053873464465141296, 0.09071880578994751, -0.060347095131874084]], [[-0.1664760708808899, 0.025285035371780396, 0.12884879112243652, -0.04950079694390297, 0.09742152690887451, 0.03989953175187111, 0.011950897984206676, -0.023490553721785545], [-0.1805945485830307, 0.07346173375844955, 0.01084128674119711, -0.1480633020401001, 0.11644655466079712, -0.08266710489988327, 0.12825079262256622, -0.07469601929187775], [-0.028582116588950157, 0.09868010878562927, -0.012091065756976604, -0.006855436135083437, 0.010487722232937813, -0.08323350548744202, 0.015579339116811752, 0.030184345319867134]]], [[[0.06376402080059052, -0.12353553622961044, -0.0981220006942749, -0.03640002757310867, -0.0867370218038559, -0.05883391946554184, -0.030804414302110672, 0.18029513955116272], [0.024177974089980125, -0.08650098741054535, -0.10610122978687286, 0.03266354277729988, 0.0038002373185008764, 0.01807161048054695, 0.04331625625491142, 0.11934833973646164], [-0.029776742681860924, -0.05517415329813957, -0.010228588245809078, 0.0036015850491821766, -0.033473316580057144, -0.0010115160839632154, 0.059884365648031235, 0.06121493875980377]], [[0.028431279584765434, -0.018862202763557434, -0.1054794117808342, -0.03777880594134331, -0.07267539203166962, -0.024188315495848656, 0.074567511677742, 0.22930534183979034], [-0.028769006952643394, -0.053531087934970856, -0.03885888308286667, 0.024678630754351616, -0.007550041191279888, -0.16415485739707947, 0.00886526983231306, 0.05659240111708641], [-0.0820503830909729, -0.05395028740167618, -0.021261584013700485, -0.10769663751125336, 4.903315129922703e-06, 0.014797763898968697, 0.013786954805254936, 0.10593267530202866]], [[-0.026570094749331474, 0.028053928166627884, -0.03298257291316986, -0.02289210446178913, -0.017297010868787766, 0.024193115532398224, 0.11223968863487244, 0.05054294690489769], [-0.00022311728389468044, -0.01840079203248024, -0.01578003168106079, -0.0026640458963811398, -0.013012110255658627, -0.008429965935647488, 0.0003068691003136337, 0.08501171320676804], [-0.021586541086435318, 0.09845566749572754, 0.001326595083810389, -0.030468232929706573, 0.0523628368973732, -0.016113465651869774, 0.06770068407058716, 0.031912487000226974]], [[0.0800144150853157, -0.004367097746580839, -0.004347288049757481, -0.08439932018518448, 0.03610299155116081, 0.0134210754185915, 0.00765126571059227, -0.005751408636569977], [0.01854895055294037, -0.023096397519111633, -0.08212774246931076, -0.08116095513105392, 0.027791328728199005, -0.11509089171886444, 0.05009403079748154, 0.018642732873558998], [-0.060968369245529175, -0.027067579329013824, -0.03962619602680206, -0.04972260817885399, 0.06861859560012817, -0.04411619156599045, 0.049644194543361664, 0.09981117397546768]], [[-0.03625968471169472, -0.08047295361757278, 0.04086115583777428, 0.026190320029854774, 0.12170590460300446, -0.04321571812033653, -0.005788316950201988, 0.05685441195964813], [0.04513715207576752, -0.0068204086273908615, 0.038192689418792725, -0.046844977885484695, 0.04673782363533974, -0.0015120897442102432, 0.03960491344332695, 0.06391641497612], [0.09618668258190155, 0.02784094773232937, 0.09959909319877625, 0.0313737578690052, -0.01243713591247797, 0.026710746809840202, 0.07980255037546158, -0.08071190863847733]], [[-0.056546252220869064, 0.05310209095478058, 0.007753003388643265, -0.006294368300586939, 0.061310652643442154, 0.016353659331798553, 0.029876597225666046, -0.11930587142705917], [-0.045429062098264694, -0.03381666913628578, -0.004421290010213852, 0.036661140620708466, 0.05467568710446358, -0.034403908997774124, 0.10981852561235428, 0.011669722385704517], [-0.033397477120161057, 0.053776174783706665, 0.10758965462446213, 0.005990696605294943, -0.055148325860500336, -0.02417425811290741, 0.08402139693498611, -0.09035787731409073]], [[-0.1038462445139885, 0.10487678647041321, 0.0032460258807986975, -0.10293819010257721, 0.049157630652189255, 0.0011773478472605348, 0.06035754829645157, -0.04290000721812248], [-0.008269382640719414, 0.01705227605998516, 0.1084195226430893, -0.0025002448819577694, 0.13636262714862823, 0.028547415509819984, 0.11666223406791687, -0.04827503859996796], [-0.03199772909283638, 0.013566642999649048, 0.008975536562502384, 0.06542929261922836, 0.034511748701334, -0.06052648276090622, -0.01703558675944805, -0.08074656128883362]], [[-0.13727416098117828, 0.007817194797098637, -0.03958122432231903, 0.027618665248155594, 0.16976624727249146, -0.019259314984083176, 0.08627220243215561, 0.03237971290946007], [0.11250583082437515, -0.04436164349317551, 0.0361802764236927, -0.0879252552986145, 0.017391322180628777, -0.020492034032940865, 0.19464585185050964, -0.009459740482270718], [0.019056031480431557, 0.013302693143486977, -0.10885738581418991, 0.07328297942876816, 0.0535745806992054, 0.02587420493364334, 0.12477140873670578, 0.015018663369119167]], [[-0.10495138168334961, 0.1418028175830841, 0.053494613617658615, 0.03460713475942612, 0.04211821034550667, -0.03968656808137894, 0.11366996169090271, -0.004170368891209364], [-0.022434039041399956, -0.06547423452138901, -0.016987206414341927, 0.019926242530345917, 0.02488778717815876, -0.10149599611759186, 0.03449230268597603, -0.07737138122320175], [-0.014882504940032959, -0.09445855766534805, -0.026915745809674263, 0.0012867337791249156, -0.04253680631518364, -0.09311482310295105, -0.04415133595466614, 0.08412984758615494]]], [[[0.09143180400133133, -0.09759482741355896, -0.044892795383930206, 0.028114385902881622, 0.08154396712779999, -0.010856985114514828, 0.030335715040564537, 0.06682510673999786], [-0.06825002282857895, -0.02084200829267502, -0.008923937566578388, 0.033472731709480286, -0.07735951244831085, 0.0008648051880300045, 0.08335865288972855, 0.14143531024456024], [0.00033603544579818845, 0.029854649677872658, 0.020865142345428467, 0.03816693648695946, 0.07398229837417603, 0.04385857284069061, 0.06378376483917236, 0.04111238941550255]], [[0.08612284064292908, -0.029950778931379318, -0.052817173302173615, 0.07817769050598145, 0.026969509199261665, -0.10955335944890976, -0.01679554395377636, 0.10824798047542572], [0.01717172935605049, 0.05001096799969673, 0.023087970912456512, 0.029227707535028458, 0.0272027850151062, 0.0021412931382656097, 0.002842032117769122, 0.15471334755420685], [0.03911163657903671, 0.04882316663861275, 0.09459325671195984, 0.07700983434915543, 0.05118406191468239, -0.09107798337936401, -0.07665044069290161, -0.01573958992958069]], [[0.11536169797182083, -0.08868028223514557, 0.13952381908893585, -0.03713948652148247, -0.031579695641994476, -0.13304203748703003, -0.02045198529958725, 0.027037331834435463], [0.02118212915956974, -0.05053060129284859, 0.010189996100962162, 0.02186824195086956, -0.05478818714618683, -0.10466025024652481, -0.01665344461798668, -0.04719590023159981], [0.09471121430397034, 0.02065032348036766, 0.1455693393945694, 0.04305163770914078, -0.024874748662114143, -0.10253360122442245, -0.0034316552337259054, 0.004108368884772062]], [[0.11019917577505112, 0.06428993493318558, 0.08876140415668488, -0.06547637283802032, 0.07631170749664307, 0.0555134154856205, 0.08053979277610779, 0.0582292377948761], [-0.001364979543723166, 0.07125258445739746, -0.028957126662135124, 0.0374358594417572, 0.08863801509141922, -0.05390699952840805, 0.10243135690689087, 0.0900915116071701], [0.02454211749136448, -0.052462395280599594, 0.1022891104221344, 0.043164629489183426, 0.09266404807567596, -0.06937021762132645, 0.017392344772815704, -0.08742032945156097]], [[0.04125823825597763, -0.0751890242099762, -0.00521357636898756, -0.05917413905262947, 0.07270576059818268, -0.031022094190120697, 0.0885685384273529, 0.10626529902219772], [-0.013697819784283638, -0.10813432186841965, 0.060892555862665176, -0.07236094772815704, -0.020559806376695633, 0.00493167620152235, 0.07910574972629547, 0.0653347298502922], [0.09428177028894424, -0.03960106521844864, 0.0580439530313015, 0.027742134407162666, -0.06588664650917053, 0.011308733373880386, 0.0011813031742349267, 0.05509022995829582]], [[-0.036689501255750656, 0.04647192731499672, 0.1212107390165329, -0.0022502162028104067, 0.11186208575963974, -0.03289097547531128, 0.03946038708090782, -0.09090542793273926], [-0.09283783286809921, -0.04585941135883331, 0.053117793053388596, 0.05619828775525093, 0.07954847067594528, 0.08034058660268784, 0.13647638261318207, -0.069693423807621], [0.030834747478365898, -0.0951162576675415, -0.006844463292509317, -0.06474665552377701, -0.026122624054551125, -0.030936503782868385, -0.02583838440477848, -0.055289674550294876]], [[-0.1500491350889206, -0.04472874850034714, 0.03612113744020462, 0.04147180914878845, 0.09940595924854279, 0.021676847711205482, -0.021144000813364983, -0.039356864988803864], [0.04772472009062767, 0.008270514197647572, 0.07846055179834366, -0.07134584337472916, 0.0411713682115078, -0.04649285972118378, 0.03594762459397316, -0.07490866631269455], [0.016091609373688698, -0.07432228326797485, -0.02439371682703495, -0.09094115346670151, 0.08679357916116714, 0.03718472272157669, 0.1240299791097641, 0.08647850900888443]], [[-0.13764019310474396, 0.07028067111968994, -0.00290452828630805, 0.006594075355678797, 0.031727589666843414, -0.017629045993089676, 0.007295385003089905, -0.03213517740368843], [-0.02120141312479973, 0.07914456725120544, -0.053241610527038574, 0.0058862208388745785, 0.1332816779613495, -0.01493237167596817, 0.10053765028715134, -0.031348224729299545], [-0.019139325246214867, -0.034169215708971024, -0.05100150406360626, 0.026456881314516068, -0.022923411801457405, 0.02582491748034954, 0.03362593054771423, -0.02826087363064289]], [[-0.0866045132279396, 0.04149225354194641, -0.0016705862944945693, -0.0812673345208168, 0.05553508922457695, 0.047736428678035736, 0.09707636386156082, 0.08509519696235657], [-0.052679117769002914, -0.03843163326382637, -0.046099599450826645, -0.10511516034603119, 0.11120898276567459, 0.04885635897517204, 0.045544687658548355, 0.06336484849452972], [0.033808089792728424, -0.059233274310827255, -0.09034121036529541, 0.004590104334056377, -0.0006973544950596988, -0.06928271800279617, -0.04090867191553116, -0.0058156466111540794]]], [[[0.13693954050540924, -0.02135259471833706, 0.04232470318675041, -0.006549650803208351, -0.03079802170395851, 0.046397339552640915, -0.011635858565568924, -0.02737053483724594], [-0.0450461246073246, 0.10041040182113647, -0.06619991362094879, 0.15082566440105438, 0.0041768718510866165, 0.06628475338220596, -0.03542844578623772, 0.035008251667022705], [-0.024707909673452377, -0.008390466682612896, 0.1022922694683075, 0.0408569760620594, 0.04062073677778244, 0.09531237185001373, 0.06495434790849686, -0.10501812398433685]], [[0.016887877136468887, 0.007461776491254568, -0.031153803691267967, 0.004544621799141169, 0.042686209082603455, -0.0931050106883049, -0.007386776618659496, 0.0020759713370352983], [0.07505877315998077, -0.07226423919200897, 0.08622605353593826, 0.020938346162438393, 0.042171675711870193, -0.1209079697728157, -0.060764312744140625, 0.03595330938696861], [0.09203167259693146, 0.014429306611418724, 0.10722384601831436, -0.0328996405005455, -0.035684734582901, -0.06281887739896774, 0.015627624467015266, -0.08577853441238403]], [[0.0738452672958374, -0.016540853306651115, 0.04444153234362602, 0.0009943214245140553, 0.05904272571206093, -0.08152615278959274, 0.07805030047893524, 0.022054722532629967], [0.051058828830718994, -0.023090876638889313, 0.07653342187404633, 0.1046292707324028, 0.013677798211574554, -0.09998201578855515, 0.06083030253648758, 0.04181790351867676], [-0.04046717286109924, 0.07776638120412827, 0.06493465602397919, 0.004370694048702717, -0.05826467275619507, -0.024918509647250175, 0.01276723388582468, -0.015442615374922752]], [[0.10538961738348007, -0.03139364719390869, -0.00611181790009141, 0.08103454858064651, 0.0475766658782959, -0.02880639024078846, -0.0029982931446284056, -0.048111677169799805], [0.020845597609877586, 0.01194614078849554, 0.023701488971710205, -0.02104983665049076, 0.04834076017141342, 0.007630561478435993, 0.1136028990149498, 0.08176834136247635], [0.01068523433059454, 0.05571779981255531, 0.043535180389881134, -0.027761301025748253, -0.010821646079421043, 0.0627845749258995, 0.028475724160671234, -0.07652024179697037]], [[-0.00796432513743639, -0.0017435713671147823, -0.04069877415895462, -0.03977423533797264, 0.10278934240341187, -0.08980774879455566, 0.10276305675506592, 0.12176218628883362], [0.05913815274834633, 0.08624353259801865, 0.044860001653432846, 0.03089323826134205, -0.003071220126003027, -0.12064637988805771, 0.0565367266535759, 0.06221394240856171], [-0.0022354943212121725, -0.059824734926223755, -0.06115581840276718, -0.048460882157087326, 0.055845651775598526, 0.013911420479416847, 0.04460308328270912, 0.12891101837158203]], [[0.03856216371059418, 0.04199334979057312, -0.011692071333527565, 0.09240725636482239, 0.07285372167825699, 0.02520126663148403, 8.472571789752692e-05, -0.036699455231428146], [-0.02822263352572918, -0.03455965220928192, -0.06418821960687637, 0.04527433589100838, 0.08403698354959488, 0.013493754900991917, 0.1208413690328598, -0.05039332062005997], [-0.03463554382324219, 0.052714068442583084, 0.005578663665801287, -0.01744074746966362, 0.03604117035865784, 0.045816149562597275, -0.0432174950838089, 0.06541147083044052]], [[-0.047302231192588806, -0.06352711468935013, 0.009073254652321339, 0.09005537629127502, 0.05490916222333908, 0.013206062838435173, 0.05903581157326698, -0.02131873369216919], [-0.06701309233903885, 0.0050367433577775955, 0.017899900674819946, 0.029929039999842644, 0.04371725767850876, 0.019622718915343285, 0.0786440521478653, -0.026563089340925217], [-0.061956603080034256, -0.013168479315936565, -0.03607577830553055, 0.018311215564608574, 0.06690224260091782, 0.10689932852983475, -0.043939895927906036, 0.025358160957694054]], [[-0.10473839193582535, 0.021301547065377235, 0.03779372572898865, 0.10193784534931183, 0.03867025300860405, -0.03324102982878685, -0.031269676983356476, 0.033356864005327225], [-0.025638669729232788, -0.04296630620956421, -0.09267933666706085, -0.024157756939530373, 0.12082575261592865, 0.013675573281943798, -0.03468417003750801, -0.08400209993124008], [0.00683605158701539, 0.010043480433523655, -0.07482866197824478, -0.09615326672792435, -0.036348920315504074, 0.0957067683339119, -0.06008392199873924, 0.07209493219852448]], [[-0.010111778043210506, 0.009981033392250538, 0.046518050134181976, -0.037753768265247345, 0.0011716075241565704, -0.008141197264194489, 0.06713452190160751, -0.0057946499437093735], [0.036978237330913544, 0.022243406623601913, -0.014258376322686672, 0.04830649122595787, 0.08195431530475616, 0.005471720825880766, 0.010470910929143429, 0.08443856239318848], [0.11184055358171463, -0.1226409524679184, 0.0009957768488675356, 0.016908282414078712, 0.04549264907836914, -0.03913196176290512, -0.08054636418819427, 0.0107281394302845]]], [[[0.04326316714286804, 0.06541473418474197, 0.09423333406448364, 0.025767870247364044, 0.02718273550271988, -0.09145272523164749, 0.04924361780285835, 0.014414847828447819], [0.0015557314036414027, 0.08710761368274689, 0.07702883332967758, 0.028051426634192467, 0.04932323098182678, -0.11036986857652664, -0.02069728821516037, -0.0038678019773215055], [-0.057977594435214996, -0.0573655404150486, 0.10296120494604111, 0.08166855573654175, -0.08812431991100311, 0.055238865315914154, -0.008219683542847633, -0.1025092750787735]], [[0.107998788356781, -0.042353056371212006, 0.09117443859577179, 0.0558793768286705, -0.0038022296503186226, -0.02593211829662323, 0.09684408456087112, -0.047240249812603], [0.021477866917848587, -0.03362802416086197, 0.12848998606204987, -0.009910455904901028, 0.06047428771853447, -0.16733694076538086, 0.03415358439087868, -0.011110223829746246], [0.023383846506476402, -0.05437838286161423, 0.028567686676979065, -0.05260489508509636, -0.052937764674425125, 0.010097818449139595, 0.035768378525972366, -0.045854855328798294]], [[0.10339950770139694, 0.080277219414711, 0.0411556139588356, 0.10379739105701447, -0.033648837357759476, -0.12368010729551315, 0.08624085038900375, 0.0652422085404396], [-0.03900160640478134, -0.00710652768611908, 0.09819234907627106, 0.04481269419193268, 0.05775846540927887, -0.08459849655628204, 0.016125407069921494, 0.019778985530138016], [-0.01662670075893402, 0.07845699787139893, -0.027774348855018616, 0.017436474561691284, 0.03846165910363197, 0.03723122179508209, 0.009790962561964989, 0.06983504444360733]], [[0.027131473645567894, 0.01439699251204729, -0.015711944550275803, 0.07354162633419037, 0.0016197841614484787, -0.11227874457836151, 0.050718873739242554, -0.056678347289562225], [-0.026514826342463493, -0.06686083227396011, -0.08656244724988937, 0.09588027000427246, 0.04833010584115982, -0.018530823290348053, 0.00807398371398449, -0.05453101918101311], [0.025939298793673515, 0.05519653856754303, -0.04469897598028183, 0.06619685143232346, 0.05618470534682274, -0.0712709054350853, 0.047019995748996735, 0.003223584732040763]], [[-0.09098898619413376, -0.01054046768695116, -0.04147575423121452, 0.0591520331799984, 0.06401440501213074, 0.008378607220947742, -0.01801198162138462, -0.004142701625823975], [-0.03357077017426491, -0.04345189407467842, -0.0632772445678711, 0.10393252223730087, 0.10321763157844543, -0.02549615316092968, 0.07710817456245422, -0.03929572179913521], [-0.026322605088353157, 0.03208756074309349, -0.0732041522860527, 0.025046713650226593, -0.04553017020225525, -0.012199033051729202, -0.05833597481250763, -0.017733661457896233]], [[0.06361555308103561, -0.0368843749165535, 0.06631232053041458, 0.06687013059854507, -0.0332072377204895, -0.08976970613002777, 0.007495352998375893, -0.026424724608659744], [-0.06751801818609238, 0.008775448426604271, 0.018442247062921524, -0.018411755561828613, 0.07067350298166275, 0.0037897529546171427, 0.016782458871603012, 0.03371831402182579], [0.029368270188570023, -0.06830870360136032, -0.10803062468767166, 0.03605523705482483, 0.08920067548751831, 0.1209687665104866, -0.0429261177778244, 0.08407490700483322]], [[-0.0687226876616478, -0.012698113918304443, -2.300222695339471e-05, 0.016588589176535606, -0.017522959038615227, 0.03912805765867233, 0.038186367601156235, 0.06703073531389236], [-0.006455737166106701, -0.009911068715155125, 0.06325545161962509, 0.0048162564635276794, 0.10147102922201157, 0.0038242393638938665, 0.012247313745319843, -0.07014346122741699], [-0.1264307051897049, 0.04744874686002731, -0.0038965274579823017, 0.09475798904895782, -0.03941679745912552, -0.00572151830419898, 0.025528959929943085, -0.020611219108104706]], [[-0.1254815310239792, 0.052956707775592804, -0.027709858492016792, -0.03780292719602585, 0.09655909240245819, -0.007876476272940636, 0.05420248582959175, 0.0378563366830349], [-0.11270787566900253, -0.0626276507973671, 0.07242972403764725, 0.012013874016702175, 0.07055705785751343, -0.08223791420459747, -0.006684525404125452, 0.08644253760576248], [-0.03138532117009163, -0.05243667960166931, 0.010863079689443111, 0.05115972086787224, -0.04255465790629387, -0.0184736680239439, -0.033941641449928284, 0.1081676185131073]], [[-0.2017206996679306, -0.05909916013479233, -0.002136032795533538, 0.016115713864564896, 0.009609590284526348, -0.03510186821222305, 0.03522421792149544, 0.0044227358885109425], [-0.035973526537418365, -0.021303441375494003, -0.04843098297715187, -0.026882590726017952, 0.010103580541908741, -0.022196881473064423, 0.011073590256273746, -0.03350045531988144], [0.03231623023748398, -0.09251851588487625, 0.10657748579978943, -0.03235713392496109, -0.04835890233516693, 0.04498710855841637, 0.005631538573652506, -0.0025278639513999224]]], [[[-0.04221276566386223, 0.06394165009260178, 0.007481955457478762, 0.1565786600112915, -0.015470600686967373, -0.03412282094359398, -0.04295823723077774, 0.06528826057910919], [-0.008300842717289925, 0.0015190745471045375, -0.009869244880974293, -0.012713927775621414, 0.03848297894001007, 0.002757192589342594, 0.06526362150907516, -0.08322815597057343], [-0.006707127206027508, 0.0689864307641983, -0.03028525784611702, -0.015809129923582077, 