{"model":{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_normalize_1", "class_name": "InputNormalize", "config": {"name": "input_normalize_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 8, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_normalize_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "size": [1, 1], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 3, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "transform_output", "class_name": "Denormalize", "config": {"name": "transform_output", "trainable": true}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["transform_output", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"},"weights":[{"shape": [9, 9, 3, 8], "kernelweight": [[[[0.14871683716773987, -0.32301437854766846, -0.23675528168678284, -0.18489915132522583, -0.002355048432946205, 0.18050681054592133, 0.20837034285068512, -0.09970512986183167], [0.14048269391059875, 0.06146422401070595, -0.08115193992853165, -0.2720218300819397, -0.2043384164571762, -0.19022424519062042, -0.09466171264648438, 0.2269614189863205], [0.0556463859975338, 0.06431850790977478, 0.4706059992313385, -0.09501123428344727, 0.04303724318742752, 0.09862229228019714, -0.3647645115852356, 0.075164794921875]], [[0.2615010738372803, -0.25355181097984314, -0.08823084086179733, -0.18566782772541046, 0.1770554631948471, 0.2311795949935913, 0.40098458528518677, -0.03295627981424332], [0.22272610664367676, 0.19431118667125702, -0.10394279658794403, -0.315545916557312, -0.05480501055717468, -0.13836294412612915, -0.08667798340320587, 0.29669976234436035], [-0.006796546280384064, 0.16978219151496887, 0.46994322538375854, -0.07731423527002335, 0.11197998374700546, -0.03031768463551998, -0.2602044343948364, -0.05422676354646683]], [[0.29225993156433105, -0.16931942105293274, -0.1080256775021553, -0.13817845284938812, 0.11155061423778534, 0.34491580724716187, 0.45998212695121765, -0.01654851995408535], [0.27831175923347473, 0.1125703901052475, -0.046927910298109055, -0.10613956302404404, -0.1278074085712433, -0.0738949403166771, -0.07941149920225143, 0.08656158298254013], [0.12100481241941452, 0.062008410692214966, 0.32429036498069763, 0.005122211296111345, -0.047053731977939606, 0.04844212904572487, -0.2536396086215973, -0.0029088957235217094]], [[0.17175568640232086, -0.10828115046024323, -0.024433501064777374, -0.03989873826503754, 0.13873067498207092, 0.3533535599708557, 0.27309632301330566, -0.1327727884054184], [0.10710020363330841, -0.00807938165962696, -0.22114937007427216, -0.14168283343315125, -0.2511797547340393, -0.22869259119033813, -0.20044423639774323, -0.009286168962717056], [-0.16120366752147675, 0.12884372472763062, 0.1956639140844345, 0.14398294687271118, -0.17099517583847046, 0.11873625963926315, -0.2520825266838074, -0.011103634722530842]], [[-0.03762922063469887, -0.24192027747631073, -0.21374063193798065, -0.05530952662229538, 0.09030985087156296, 0.24507391452789307, 0.1447162628173828, -0.08637620508670807], [-0.03734991326928139, -0.030497459694743156, -0.3385379910469055, 0.02330785058438778, -0.13733376562595367, -0.28181204199790955, -0.01744832843542099, -0.00907660648226738], [-0.25290095806121826, 0.12333529442548752, 0.06473219394683838, 0.11238020658493042, -0.25696390867233276, 0.16222086548805237, -0.2656254470348358, 0.06766369193792343]], [[-0.302388995885849, -0.11383578181266785, -0.08606196939945221, -0.07202301919460297, 0.15222741663455963, 0.08053115755319595, 0.13057351112365723, -0.03429984301328659], [-0.16318625211715698, 0.01967078261077404, -0.41414543986320496, -0.028324810788035393, -0.0749923586845398, -0.19391319155693054, 0.06072621792554855, 0.16495129466056824], [-0.29926374554634094, 0.16814139485359192, -0.07328348606824875, 0.13156887888908386, -0.25523972511291504, 0.0733526349067688, -0.12799422442913055, 0.26953011751174927]], [[-0.1709810495376587, -0.26423826813697815, -0.04721461236476898, -0.12681882083415985, 0.14569173753261566, 0.27758392691612244, -0.08642656356096268, -0.13205866515636444], [-0.1699652522802353, -0.044431257992982864, -0.2367781400680542, 0.08244942873716354, -0.1498304307460785, 0.04263152927160263, 0.18111920356750488, 0.05869758501648903], [-0.22193321585655212, 0.11194965243339539, 0.14221784472465515, 0.0274844691157341, -0.22517535090446472, 0.2948276698589325, 0.020315278321504593, 0.25748100876808167]], [[-0.044265344738960266, -0.27335092425346375, -0.09522521495819092, -0.3082423210144043, 0.06288711726665497, 0.1048211082816124, -0.10392460972070694, -0.03822680562734604], [-0.13944251835346222, -0.16039393842220306, -0.10555034130811691, -0.09130846709012985, -0.05214418098330498, 0.11872357130050659, 0.26595646142959595, -0.012100578285753727], [-0.04030964896082878, 0.1581142246723175, 0.057828616350889206, 0.11264622956514359, -0.21761322021484375, 0.2808442711830139, 0.001734680961817503, 0.20099122822284698]], [[0.09871591627597809, -0.05981636419892311, -0.03227591514587402, -0.6415246725082397, -0.008704300969839096, 0.07267121970653534, -0.2579846978187561, 0.047510650008916855], [-0.044690508395433426, -0.1372678130865097, -0.21405361592769623, -0.30968451499938965, 0.02351282723248005, 0.060359805822372437, 0.049731332808732986, -0.11940155923366547], [0.0025933319702744484, 0.2412279099225998, 0.1459450125694275, -0.1295577883720398, -0.20468737185001373, 0.3435605764389038, 0.05971329286694527, 0.13655751943588257]]], [[[0.0463830940425396, -0.10311871021986008, -0.19054394960403442, 0.12565185129642487, -0.12849734723567963, 0.23054970800876617, 0.39827480912208557, 0.015699023380875587], [0.012875381857156754, 0.17980052530765533, -0.02600218914449215, -0.12211602926254272, -0.28975558280944824, 0.0006969806854613125, -0.04025988280773163, 0.2376713752746582], [0.07503705471754074, 0.03001363016664982, 0.31494301557540894, -0.0796571597456932, 0.10918056219816208, 0.08416871726512909, -0.16491791605949402, 0.011641616933047771]], [[0.06833340972661972, -0.08774421364068985, -0.18505150079727173, 0.1859961897134781, -0.10723026841878891, 0.32977867126464844, 0.4224492907524109, 0.055677104741334915], [0.15820012986660004, 0.11603468656539917, 0.003956509754061699, -0.07271768897771835, -0.2526349723339081, -0.06193026155233383, -0.12561947107315063, 0.21710313856601715], [0.01685815490782261, 0.02913586050271988, 0.31760185956954956, 0.02312547154724598, -0.11005277186632156, 0.09977515041828156, -0.2396419197320938, -0.09603480249643326]], [[0.06891008466482162, -0.09788931161165237, -0.15397804975509644, 0.2581329941749573, -0.13136620819568634, 0.40774524211883545, 0.3113230764865875, 0.05771869048476219], [0.11005274951457977, 0.0071848551742732525, -0.1690094918012619, 0.08733384311199188, -0.27468833327293396, -0.1827726513147354, -0.17470833659172058, 0.15721513330936432], [-0.00022940851340536028, 0.03111022152006626, 0.1914091855287552, 0.15687721967697144, -0.18464255332946777, 0.1308474838733673, -0.5164732336997986, 0.058799635618925095]], [[0.283830463886261, 0.026175444945693016, -0.21692577004432678, 0.33798596262931824, -0.03833572566509247, 0.24208520352840424, 0.25627318024635315, 0.14926505088806152], [0.17394763231277466, 0.09772878885269165, -0.3089994788169861, 0.05431412160396576, -0.29737523198127747, -0.3180494010448456, -0.15983764827251434, 0.19249747693538666], [0.12169819325208664, -0.0019836202263832092, 0.03691674768924713, 0.17158374190330505, -0.27575090527534485, 0.0897609069943428, -0.47874686121940613, 0.1100686565041542]], [[0.20071448385715485, 0.10241561383008957, -0.3261711299419403, 0.2977081835269928, 0.10685668140649796, 0.17105838656425476, 0.16660188138484955, 0.22589968144893646], [0.20177435874938965, 0.23843124508857727, -0.5389934182167053, 0.20125877857208252, -0.13963158428668976, -0.3561020791530609, -0.08856473863124847, 0.2215699851512909], [0.09970663487911224, 0.2274385243654251, -0.18777310848236084, 0.15815499424934387, -0.10355401039123535, 0.133152574300766, -0.280638724565506, 0.27325475215911865]], [[-0.07301288098096848, 0.13962240517139435, -0.19739368557929993, 0.20850348472595215, 0.10075881332159042, 0.024786941707134247, 0.02562987618148327, 0.18485291302204132], [0.12756949663162231, 0.2086220383644104, -0.5183829069137573, -0.011750848963856697, -0.02948049083352089, -0.35362929105758667, 0.10896379500627518, 0.27871036529541016], [-0.12917640805244446, 0.25228187441825867, -0.18352991342544556, 0.11557719856500626, -0.26979759335517883, 0.11569022387266159, -0.08319001644849777, 0.3678579032421112]], [[-0.08206837624311447, -0.046015746891498566, -0.11030922085046768, 0.3557838201522827, 0.1776033639907837, 0.1988101750612259, -0.07158501446247101, -0.002445701276883483], [-0.06128377839922905, -0.0506540983915329, -0.2644713819026947, 0.2758188247680664, 0.009607451036572456, -0.0013734671520069242, 0.14778393507003784, 0.13161948323249817], [-0.11613599956035614, 0.1200547143816948, -0.06175915524363518, 0.23150718212127686, -0.1704016476869583, 0.37879103422164917, -0.0928601622581482, 0.14007948338985443]], [[-0.2861950695514679, -0.24617446959018707, 0.01806400902569294, 0.28619569540023804, -0.046217817813158035, 0.1689145267009735, -0.05382914841175079, 0.02205537259578705], [-0.23331037163734436, -0.2717101573944092, -0.09438392519950867, 0.12314443290233612, -0.004638546612113714, 0.04007872939109802, 0.14546628296375275, -0.04050798714160919], [-0.18922759592533112, 0.05679469555616379, -0.026765668764710426, 0.3041394352912903, -0.3890964686870575, 0.376520037651062, 0.11923246830701828, 0.153629869222641]], [[-0.27028539776802063, -0.19531118869781494, -0.14627553522586823, -0.24723604321479797, -0.05249374359846115, 0.13321834802627563, -0.2260918766260147, -0.029520021751523018], [-0.27236413955688477, -0.29169702529907227, -0.21964626014232635, -0.028178978711366653, -0.15954653918743134, -0.026703521609306335, 0.1727244257926941, -0.20378637313842773], [-0.21712222695350647, 0.13291355967521667, 0.007593121845275164, 0.08601231127977371, -0.45273295044898987, 0.2310788780450821, 0.020910419523715973, 0.1317082792520523]]], [[[0.08827219903469086, -0.15119557082653046, -0.23509745299816132, -0.06841763108968735, -0.1557777374982834, 0.10186328738927841, 0.38859912753105164, 0.03819512948393822], [-0.2058858573436737, 0.11591073870658875, 0.051180578768253326, -0.148212268948555, -0.2432672381401062, -0.19516146183013916, 0.05652724951505661, 0.10358867794275284], [-0.06752670556306839, -0.10516500473022461, 0.26460614800453186, -0.018076756969094276, 0.03764340281486511, -0.26971712708473206, -0.14181892573833466, -0.0885552242398262]], [[0.031120989471673965, -0.1169612780213356, -0.16530171036720276, 0.24722495675086975, -0.18147346377372742, 0.2403821498155594, 0.4132843315601349, 0.12325836718082428], [-0.1410486102104187, -0.007956412620842457, -0.025456709787249565, -0.036821480840444565, -0.21611203253269196, -0.20687411725521088, -0.1410205066204071, 0.1749143749475479], [0.051715776324272156, -0.16231995820999146, 0.22068321704864502, 0.1386091113090515, 0.057671479880809784, -0.23283396661281586, -0.26147836446762085, -0.1376948356628418]], [[0.11350900679826736, 0.02730276994407177, -0.13800080120563507, 0.3834732472896576, -0.16378140449523926, 0.15669791400432587, 0.2958906590938568, 0.0173905398696661], [-0.026887886226177216, 0.13114440441131592, 0.018962066620588303, 0.02111842669546604, -0.3667362630367279, -0.30777430534362793, -0.2140166163444519, 0.16861113905906677], [-0.03350374847650528, -0.17977288365364075, 0.11708758026361465, 0.13023778796195984, -0.13191697001457214, -0.13619525730609894, -0.36757180094718933, -0.14996576309204102]], [[0.257029265165329, 0.20900696516036987, -0.19519272446632385, 0.23024646937847137, -0.216692715883255, -0.07015921920537949, 0.31747159361839294, 0.2621076703071594], [0.3765183091163635, 0.32226020097732544, -0.2837032973766327, -0.04968191683292389, -0.36731255054473877, -0.6255280375480652, -0.15804359316825867, 0.20778588950634003], [0.28808414936065674, 0.17162348330020905, -0.06831924617290497, 0.07151465862989426, -0.24845708906650543, -0.3813174068927765, -0.2735368609428406, 0.1377096027135849]], [[0.4383309483528137, 0.47872889041900635, -0.28503677248954773, 0.21715369820594788, 0.1771615892648697, -0.18372458219528198, 0.3534347712993622, 0.3993167579174042], [0.5079933404922485, 0.45041754841804504, -0.46956220269203186, -0.08768486976623535, -0.04905635863542557, -0.8350914716720581, 0.020170222967863083, 0.42070871591567993], [0.4086347818374634, 0.32776927947998047, -0.21356424689292908, 0.01793953962624073, -0.07870049774646759, -0.5596473813056946, -0.17148475348949432, 0.2784685492515564]], [[0.24477198719978333, 0.34760403633117676, -0.23530951142311096, -0.19741564989089966, 0.428442120552063, -0.29873162508010864, 0.3171829581260681, 0.24160203337669373], [0.5348446369171143, 0.23605932295322418, -0.4567246437072754, -0.25640425086021423, 0.33947575092315674, -0.792908251285553, 0.27534788846969604, 0.27796757221221924], [0.3192933201789856, 0.28001806139945984, -0.24817070364952087, -0.10956734418869019, 0.07019142061471939, -0.4366482198238373, 0.10769612342119217, 0.2390313446521759]], [[0.09063265472650528, -0.15824773907661438, -0.09648475050926208, -0.15890948474407196, 0.5280812382698059, -0.07887382805347443, 0.07308628410100937, 0.06513570249080658], [0.30939480662345886, -0.25656792521476746, -0.4131021499633789, -0.1497020274400711, 0.41877493262290955, -0.2932591140270233, 0.30950793623924255, -0.06300017237663269], [0.13592863082885742, -0.028310419991612434, -0.22004912793636322, 0.005655227228999138, 0.15065380930900574, -0.05446052551269531, 0.18175055086612701, 0.06088758260011673]], [[-0.1227228119969368, -0.41677427291870117, -0.04687946289777756, 0.04086081683635712, 0.3318864703178406, -0.0972905308008194, -0.06888297945261002, -0.20702722668647766], [-0.025727586820721626, -0.5230202674865723, -0.24261461198329926, 0.10524671524763107, 0.29912325739860535, -0.10265405476093292, 0.28799155354499817, -0.1667170375585556], [-0.19430148601531982, -0.23777930438518524, -0.05871085822582245, 0.3065445125102997, -0.01439233310520649, -0.11114192008972168, 0.1548825055360794, -0.09254709631204605]], [[-0.17865213751792908, -0.46871134638786316, -0.005037384573370218, -0.3409387171268463, 0.19840408861637115, -0.17123529314994812, -0.18430966138839722, -0.1322018951177597], [-0.11250163614749908, -0.5489307641983032, -0.13851749897003174, -0.06647389382123947, 0.13497976958751678, -0.2669236660003662, 0.21092577278614044, -0.26635292172431946], [-0.18230919539928436, 0.04136760160326958, -0.09939008206129074, 0.18007387220859528, -0.2829531133174896, -0.1449134647846222, 0.28704148530960083, -0.006195429712533951]]], [[[-0.08843157440423965, -0.002613706048578024, -0.29632654786109924, 0.2061624974012375, -0.30143970251083374, 0.03014899231493473, 0.33650442957878113, 0.03278740122914314], [-0.22325573861598969, 0.023736663162708282, 0.03799646347761154, -0.002500344766303897, -0.1812560111284256, -0.003653355408459902, -0.093874491751194, 0.17285534739494324], [-0.1267460435628891, -0.12628157436847687, 0.22870749235153198, 0.12327658385038376, 0.17209911346435547, -0.12197822332382202, -0.25657686591148376, -0.20165099203586578]], [[-0.13583210110664368, -0.05577936768531799, -0.07745993882417679, 0.411599338054657, -0.29304343461990356, 0.10725206136703491, 0.34729328751564026, 0.1712765395641327], [-0.18873350322246552, -0.09764809906482697, 0.06939595937728882, 0.15889737010002136, -0.31579819321632385, -0.05456634610891342, -0.17181336879730225, 0.05736829340457916], [-0.028050590306520462, -0.1517144739627838, 0.28580498695373535, 0.15739008784294128, 0.05032763257622719, -0.14632008969783783, -0.4107872545719147, -0.17929419875144958]], [[0.0028820575680583715, 0.02287636697292328, -0.04561097174882889, 0.45311662554740906, -0.2818653881549835, 0.060842979699373245, 0.28934505581855774, 0.11002188175916672], [-0.14791932702064514, 0.09401099383831024, 0.08060487359762192, 0.15383803844451904, -0.3554791212081909, -0.1234217956662178, -0.2697945237159729, 0.07675392925739288], [-0.1879984587430954, -0.06630317121744156, 0.06695780158042908, 0.1749560534954071, -0.24795286357402802, -0.16245387494564056, -0.3625637888908386, -0.033211711794137955]], [[0.1611846387386322, 0.3322961926460266, -0.20796115696430206, 0.27473169565200806, -0.0915888175368309, -0.044583991169929504, 0.3234095275402069, 0.29820629954338074], [0.12292861193418503, 0.2502218186855316, -0.07633066922426224, 0.03199518471956253, -0.3195263743400574, -0.45383262634277344, -0.20470282435417175, 0.1425108164548874], [0.15541237592697144, 0.20619231462478638, -0.1288919895887375, -0.017317229881882668, -0.1644529104232788, -0.3889935612678528, -0.23014239966869354, 0.05029652640223503]], [[0.4289597272872925, 0.5103289484977722, -0.1905873864889145, 0.04357972368597984, 0.218816339969635, -0.2567286491394043, 0.3624843955039978, 0.2752043902873993], [0.39173516631126404, 0.46308180689811707, -0.348928302526474, -0.19906628131866455, 0.14971724152565002, -0.9506576657295227, 0.0919593870639801, 0.04359573870897293], [0.37974345684051514, 0.3072311580181122, -0.1580449342727661, -0.1732463240623474, 0.01625950261950493, -0.6282050013542175, -0.10815704613924026, 0.05426710471510887]], [[0.42267879843711853, 0.31791311502456665, -0.05255868285894394, -0.2999174892902374, 0.5390502214431763, -0.32759252190589905, 0.22305653989315033, -0.10888903588056564], [0.45843979716300964, 0.2508372366428375, -0.21435655653476715, -0.39533859491348267, 0.36123090982437134, -0.7473076581954956, 0.1810147911310196, -0.21763424575328827], [0.24425993859767914, 0.20932002365589142, -0.19391657412052155, -0.1973913013935089, 0.25053855776786804, -0.4771963953971863, 0.15811139345169067, -0.15153390169143677]], [[0.09534718096256256, -0.16563865542411804, 0.009323887526988983, -0.14296934008598328, 0.4865266978740692, -0.005229737609624863, -0.12586307525634766, -0.18880973756313324], [0.28604480624198914, -0.15397940576076508, -0.1587400585412979, -0.1101013720035553, 0.29416126012802124, -0.14379814267158508, -0.0640777051448822, -0.3890209496021271], [0.054404452443122864, -0.10568290948867798, -0.2364845722913742, 0.1009112000465393, 0.174965038895607, 0.05337994173169136, -0.04069382697343826, -0.204096719622612]], [[0.011054931208491325, -0.4684857130050659, 0.04321468994021416, -0.051872413605451584, 0.4165673553943634, 0.01134265586733818, -0.13683296740055084, -0.3877430558204651], [0.17068719863891602, -0.43231692910194397, -0.10837583243846893, 0.046853046864271164, 0.3191887438297272, 0.03763372823596001, -0.0429338775575161, -0.5000975728034973], [-0.021693959832191467, -0.22014084458351135, -0.16491955518722534, 0.20585912466049194, -0.029387833550572395, 0.10923135280609131, 0.021003426983952522, -0.18495097756385803]], [[-0.0038573550991714, -0.48716336488723755, 0.044702548533678055, -0.3119807839393616, 0.16094709932804108, -0.08580213785171509, -0.3166254162788391, -0.1826852262020111], [0.09488672763109207, -0.41966119408607483, -0.13950642943382263, -0.018508199602365494, 0.22057785093784332, -0.20731544494628906, 0.021590158343315125, -0.2675335109233856], [0.07296106219291687, -0.04853193461894989, -0.20204170048236847, 0.30063605308532715, -0.12268183380365372, -0.04312831535935402, 0.10546903312206268, 0.005047204904258251]]], [[[-0.14470148086547852, 0.07653456181287766, -0.13559231162071228, 0.30059266090393066, -0.25140252709388733, -0.03585980087518692, 0.23573391139507294, 0.09935140609741211], [-0.059938542544841766, 0.0736786276102066, 0.20982930064201355, -0.04558143764734268, -0.038639359176158905, -0.07900441437959671, -0.03171645104885101, 0.20711833238601685], [0.026872459799051285, 0.009525362402200699, 0.2717001438140869, 0.026320649310946465, 0.18385975062847137, -0.3051222562789917, -0.16536091268062592, -0.160060852766037]], [[-0.21018029749393463, 0.041011083871126175, -0.13789542019367218, 0.6589792966842651, -0.29424554109573364, 0.22365731000900269, 0.2813344895839691, 0.04797133430838585], [0.006925591733306646, 0.06237831339240074, 0.09200672805309296, 0.11294446140527725, -0.17964553833007812, -0.0621730275452137, -0.16585896909236908, 0.15782000124454498], [-0.030629189684987068, -0.08225079625844955, 0.2602919042110443, 0.13302798569202423, 0.0034617858473211527, -0.15107500553131104, -0.34269869327545166, -0.14747148752212524]], [[-0.31795433163642883, 0.09185511618852615, -0.02292531728744507, 0.6998907923698425, -0.26025834679603577, 0.11871254444122314, 0.11096366494894028, 0.10932076722383499], [-0.17919093370437622, -0.03860003873705864, 0.2422839105129242, 0.08764850348234177, -0.18800346553325653, -0.017026929184794426, -0.2492125779390335, 0.05679619684815407], [-0.22686028480529785, -0.1456194967031479, 0.15013204514980316, 0.023714588955044746, -0.11968409270048141, -0.18910349905490875, -0.22903135418891907, -0.08583525568246841]], [[-0.15341603755950928, 0.06342677026987076, -0.08134879916906357, 0.5997270941734314, -0.12306439131498337, -0.06496214866638184, 0.2669473886489868, 0.12576235830783844], [-0.2630723714828491, 0.031078046187758446, 0.0401485338807106, 0.1207735687494278, -0.0969352051615715, -0.24727775156497955, -0.16892790794372559, 0.05290266126394272], [-0.25960442423820496, -0.12289489060640335, 0.043318409472703934, 0.00929285492748022, -0.11061099916696548, -0.17435140907764435, -0.20304912328720093, 0.07886698096990585]], [[0.0542290024459362, 0.1704433262348175, -0.0818631574511528, 0.33164480328559875, 0.08405342698097229, -0.2258007675409317, 0.26179713010787964, 0.051889486610889435], [-0.05065324902534485, 0.008077193051576614, -0.1328062117099762, 0.05888516455888748, 0.042174823582172394, -0.42590418457984924, 0.158953458070755, -0.09022806584835052], [-0.11242426931858063, 0.013794934377074242, -0.1784704178571701, -0.09270427376031876, 0.0336390882730484, -0.3735061287879944, 0.07380574196577072, 0.05608614161610603]], [[0.05858095735311508, 0.05770735442638397, 0.15897856652736664, 0.04973225295543671, 0.26556292176246643, -0.14954982697963715, 0.09941572695970535, -0.22202268242835999], [0.03290487453341484, -0.0854475349187851, 0.05314537137746811, -0.07910913974046707, 0.21655255556106567, -0.2921249568462372, -0.055226054042577744, -0.4400551915168762], [-0.034140948206186295, 0.05415549874305725, -0.2121700644493103, -0.13522116839885712, 0.07688234001398087, -0.19659118354320526, 0.02619638666510582, -0.1907142698764801]], [[0.07054547220468521, -0.02912323735654354, 0.23113302886486053, 0.013297966681420803, 0.37062913179397583, 0.20186787843704224, -0.2057396024465561, -0.4510956108570099], [-0.09996890276670456, -0.0025130235590040684, 0.13469210267066956, -0.09991248697042465, 0.07120537012815475, 0.1728936731815338, -0.14381811022758484, -0.6208627820014954], [-0.042882874608039856, 0.03615691512823105, -0.0922616496682167, -0.019825510680675507, 0.011275498196482658, 0.19529271125793457, -0.04966157674789429, -0.28168588876724243]], [[0.1344340741634369, -0.060421813279390335, 0.22962217032909393, -0.0004550461599137634, 0.27450016140937805, 0.21717284619808197, -0.21956363320350647, -0.5061315894126892], [0.06653694808483124, -0.07635373622179031, 0.18144427239894867, 0.01651833765208721, 0.02406003326177597, 0.0695764422416687, -0.08981072902679443, -0.4716721773147583], [0.05667896941304207, -0.00011641347373370081, -0.12452758103609085, 0.11118673533201218, -0.0444546639919281, 0.173831507563591, -0.11077582091093063, -0.27748364210128784]], [[0.15390829741954803, -0.10379530489444733, 0.1575354039669037, -0.485711932182312, 0.130600243806839, -0.06969065964221954, -0.40184545516967773, -0.18476788699626923], [0.3274044096469879, -0.0010124130640178919, 0.0014049871824681759, -0.1613924354314804, 0.030541470274329185, -0.18361856043338776, -0.04079238325357437, -0.09623627364635468], [0.14965736865997314, 0.07618602365255356, -0.15229065716266632, -0.035204093903303146, -0.17786358296871185, -0.053338803350925446, 0.13168464601039886, 0.1810995638370514]]], [[[-0.027430640533566475, 0.11750485002994537, -0.03813211992383003, 0.31683769822120667, -0.2128651738166809, 0.04462774470448494, 0.09265227615833282, 0.04865986481308937], [0.10162904858589172, 0.05105909705162048, 0.21335627138614655, -0.007078682538121939, -0.17092476785182953, -0.05559907853603363, 0.010786458849906921, 0.2193303406238556], [0.06889212131500244, -0.08308379352092743, 0.16944070160388947, -0.022284943610429764, 0.21778029203414917, -0.24855126440525055, -0.14873842895030975, -0.034225571900606155]], [[-0.09365170449018478, 0.1647627353668213, 0.0281780157238245, 0.48978152871131897, -0.2739816904067993, 0.2303147166967392, 0.1045011579990387, 0.05380024388432503], [-0.006690768525004387, 0.14572130143642426, 0.2502482235431671, -0.07423245161771774, -0.07226873934268951, 0.16346067190170288, -0.25040170550346375, 0.20335860550403595], [0.02456950582563877, -0.0934903547167778, 0.21838787198066711, -0.054932013154029846, 0.2231958955526352, -0.044937122613191605, -0.30099695920944214, -0.13122907280921936]], [[-0.3293704092502594, 0.020900065079331398, 0.05963815748691559, 0.7192280888557434, -0.24185049533843994, 0.242141455411911, 0.05728919804096222, 0.01857282593846321], [-0.023799339309334755, -0.09705177694559097, 0.22223208844661713, 0.028653088957071304, -0.12191306054592133, 0.14574113488197327, -0.3122803568840027, 0.1476529836654663], [-0.10290330648422241, -0.1560543179512024, 0.123568095266819, -0.03390621021389961, -0.001880427123978734, -0.045617133378982544, -0.24838532507419586, -0.09750673174858093]], [[-0.38072526454925537, -0.20727698504924774, 0.15389050543308258, 0.7327742576599121, -0.10150521248579025, 0.07558764517307281, -0.012639994733035564, 0.18327973783016205], [-0.24937811493873596, -0.3004598319530487, 0.21000251173973083, 0.19295519590377808, 0.022190341725945473, 0.1437990367412567, -0.14670304954051971, 0.1518663614988327], [-0.27921995520591736, -0.3388552963733673, -0.014002973213791847, -0.0030994131229817867, -0.020652635022997856, -0.05194694921374321, -0.12433665990829468, 0.04706000164151192]], [[-0.21770663559436798, -0.2241303026676178, 0.05856378749012947, 0.7190407514572144, 0.04515385255217552, -0.0489194430410862, 0.17155639827251434, 0.17435944080352783], [-0.28644487261772156, -0.24540212750434875, 0.16893742978572845, 0.2720978856086731, 0.056332413107156754, -0.20955751836299896, 0.0018832881469279528, 0.04968630149960518], [-0.2484603226184845, -0.36339226365089417, -0.1394389122724533, 0.13684676587581635, 0.03179866820573807, -0.20679861307144165, 0.09186878055334091, -0.05616692081093788]], [[-0.26303014159202576, -0.018168732523918152, 0.3540363311767578, 0.2454148530960083, -0.02715311199426651, -0.05500275269150734, -0.05182449147105217, -0.2589179575443268], [-0.2037397176027298, -0.1528632789850235, 0.21996822953224182, 0.19057804346084595, 0.1212906613945961, 0.0438825897872448, -0.058173198252916336, -0.3232525587081909], [-0.2836593687534332, -0.14831587672233582, -0.1326981633901596, -0.03024318628013134, -0.11603931337594986, -0.04566555470228195, 0.09981080889701843, -0.19348536431789398]], [[-0.21217313408851624, 0.24619781970977783, 0.4422333240509033, -0.05791648104786873, 0.1071331724524498, 0.2245580404996872, -0.07669192552566528, -0.3587671220302582], [-0.2562095522880554, 0.13255862891674042, 0.27805662155151367, 0.005105725955218077, -0.044696610420942307, 0.21965940296649933, -0.029467850923538208, -0.5191527605056763], [-0.2049291729927063, 0.17056137323379517, 0.03663785010576248, -0.013984553515911102, -0.019241444766521454, 0.039777591824531555, 0.168956458568573, -0.33747971057891846]], [[0.08767369389533997, 0.27239885926246643, 0.21690690517425537, -0.19985350966453552, 0.043115172535181046, 0.0773480162024498, -0.19913031160831451, -0.4827449917793274], [-0.15880900621414185, 0.3377629220485687, 0.13723011314868927, -0.028518611565232277, 0.08975327014923096, 0.01812371425330639, 0.015911893919110298, -0.5337181687355042], [0.020772233605384827, 0.2840707004070282, -0.0051085446029901505, -0.0048807719722390175, -0.15555980801582336, -0.03429783880710602, 0.2875308096408844, -0.2550637722015381]], [[0.21599245071411133, 0.11715500801801682, 0.16612228751182556, -0.33010274171829224, 0.004498173017054796, 0.07197455316781998, -0.2233564555644989, -0.17408786714076996], [0.008311896584928036, 0.11924757063388824, 0.08604755997657776, -0.09022969752550125, 0.06237001717090607, -0.07421676814556122, 0.061862751841545105, -0.16542090475559235], [0.1773882359266281, 0.18650148808956146, -0.12410854548215866, -0.04248131811618805, -0.1587297022342682, 0.05547155812382698, 0.20557618141174316, 0.08129982650279999]]], [[[0.054342206567525864, 0.06601297110319138, -0.01762281358242035, 0.24987652897834778, -0.17964991927146912, 0.11244121193885803, 0.06947727501392365, 0.10193242132663727], [-0.10089311748743057, 0.10926998406648636, 0.26673468947410583, 0.03368838131427765, -0.19256649911403656, 0.09948532283306122, -0.023833440616726875, -0.008947073481976986], [0.09495367109775543, -0.19321569800376892, 0.11151593923568726, -0.1389397382736206, 0.2786085903644562, -0.06608124077320099, 0.027573129162192345, -0.052661553025245667]], [[0.061956703662872314, 0.11399982124567032, 0.02380603738129139, 0.39630284905433655, -0.07663286477327347, 0.17544057965278625, 0.12940798699855804, -0.055871330201625824], [-0.1653345227241516, 0.16972382366657257, 0.3458714485168457, 0.012536882422864437, -0.02480059489607811, 0.1554049849510193, -0.11483011394739151, 0.114805668592453], [0.10895232111215591, -0.10975164920091629, 0.23798635601997375, -0.08986533433198929, 0.294419527053833, -0.005503365769982338, -0.00255606253631413, -0.09235535562038422]], [[0.0012493160320445895, 0.009757189080119133, 0.15020513534545898, 0.5612162351608276, -0.04842781648039818, 0.1412929892539978, -0.0791524276137352, 0.13092485070228577], [0.024651341140270233, 0.002599194645881653, 0.32537561655044556, 0.000811068108305335, 0.06800448149442673, 0.10875899344682693, -0.21231769025325775, 0.023881444707512856], [0.043374884873628616, -0.09368707984685898, 0.0934467688202858, -0.1250651329755783, 0.3246748149394989, -0.06948283314704895, -0.14623810350894928, -0.018040409311652184]], [[-0.08008438348770142, -0.19390426576137543, 0.15566015243530273, 0.7330790758132935, -0.1331799179315567, 0.09808983653783798, -0.10848935693502426, 0.29386106133461], [0.059319593012332916, -0.2799161374568939, 0.1873454451560974, 0.023205038160085678, -0.006795778870582581, 0.157037153840065, -0.2013554573059082, 0.2605152428150177], [0.032422229647636414, -0.3220670819282532, -0.07283894717693329, -0.04084864258766174, 0.13997261226177216, -0.08314009755849838, -0.09950483590364456, 0.008847134187817574]], [[0.04970870912075043, -0.22921030223369598, 0.12090743333101273, 0.4813801646232605, -0.02507339045405388, 0.02785707637667656, -0.15006768703460693, 0.3097355365753174], [0.12294428795576096, -0.25932565331459045, 0.27334731817245483, 0.10134701430797577, 0.18210947513580322, -0.11253056675195694, -0.14818616211414337, 0.29069122672080994], [0.028132649138569832, -0.3492642939090729, -0.12280382961034775, -0.04599466547369957, 0.20768602192401886, -0.15563969314098358, 0.06542035192251205, 0.18387259542942047]], [[-0.10915430635213852, 0.024970754981040955, 0.32086506485939026, 0.283315509557724, -0.08537698537111282, -0.04482697695493698, -0.2022242546081543, 0.08482516556978226], [-0.0008637075079604983, -0.13087761402130127, 0.20772407948970795, 0.07175993919372559, 0.07732339948415756, 0.0274061132222414, 0.025289691984653473, 0.03418652340769768], [0.010084617882966995, -0.21561689674854279, 0.012459095567464828, 0.04777191951870918, -0.023679183796048164, -0.16116777062416077, 0.13803549110889435, 0.015625379979610443]], [[-0.2799965441226959, 0.369649201631546, 0.31898072361946106, -0.03865694999694824, -0.05056407302618027, 0.15807735919952393, -0.1438824087381363, -0.27701669931411743], [-0.1519589126110077, 0.20719891786575317, 0.2186565101146698, -0.0755758062005043, 0.04580720141530037, 0.1188209131360054, 0.09369764477014542, -0.39055493474006653], [-0.1516018509864807, 0.15248149633407593, -0.039236556738615036, -0.05112874135375023, -0.06441032886505127, 0.0363481268286705, 0.2424425482749939, -0.15859301388263702]], [[-0.13398729264736176, 0.3253733515739441, 0.3374709486961365, -0.06034151464700699, -0.007651038467884064, -0.052057188004255295, -0.13155235350131989, -0.3895893394947052], [-0.15487131476402283, 0.33898788690567017, 0.19028207659721375, 0.04943560063838959, -0.007893973961472511, 0.08109243214130402, 0.15017057955265045, -0.46112650632858276], [-0.001506724045611918, 0.3289172649383545, -0.015272911638021469, -0.08513465523719788, -0.12868216633796692, 0.005141076166182756, 0.36140215396881104, -0.16612033545970917]], [[0.07641805708408356, 0.04446041211485863, 0.0838901549577713, -0.14093060791492462, 0.015293153934180737, -0.07716572284698486, -0.10893595963716507, -0.1685500293970108], [-0.07191132754087448, 0.15909235179424286, -0.020841240882873535, 0.027234002947807312, 0.1265610009431839, 0.026853296905755997, 0.2963792085647583, -0.25800153613090515], [0.1154085099697113, 0.21247485280036926, -0.1736162006855011, -0.006816669832915068, -0.05859062075614929, -0.07551444321870804, 0.34093278646469116, 0.072756327688694]]], [[[-0.0329890139400959, 0.14504677057266235, -0.12208947539329529, 0.21644540131092072, -0.27443596720695496, 0.051201026886701584, 0.10358067601919174, 0.026149841025471687], [-0.19557148218154907, 0.07074557989835739, 0.22320802509784698, -0.02405017986893654, -0.1306091845035553, 0.03565293177962303, 0.20394866168498993, 0.059952035546302795], [0.21052779257297516, -0.17469505965709686, 0.1645607203245163, -0.24597443640232086, 0.2257881909608841, -0.04637206345796585, 0.25948283076286316, -0.04825817421078682]], [[-0.13541191816329956, 0.18961578607559204, 0.02649717591702938, 0.24418388307094574, -0.2473560869693756, 0.04767724871635437, 0.0829930379986763, 0.022288823500275612], [-0.26625537872314453, 0.12764425575733185, 0.24401377141475677, -0.02179686725139618, -0.06616955995559692, 0.040041565895080566, 0.04886196553707123, -0.067698173224926], [0.036782942712306976, -0.1365344375371933, 0.039235733449459076, -0.18564756214618683, 0.2152923047542572, -0.17866934835910797, 0.1003965362906456, -0.025398749858140945]], 